       IDENTIFICATION DIVISION.                                                                                                                       
      *------------------------                                                                                                                       
       PROGRAM-ID.   CDSE680.                                                                                                                         
      **********************************************************                                                                                      
      * INSTITUCION      : BANCOESTADO                         *                                                                                      
      * SISTEMA          : CONVENIO DE SERVICIOS               *                                                                                      
      * MODULO           : MANTENCION MANDATOS CARGO           *                                                                                      
      * PROGRAMA         : CDSE680                             *                                                                                      
      * TRX CICS         : DS80                                *                                                                                      
      * ENCARGADO        : SOLUCIONES S.A.                     *                                                                                      
      * ANALISTA         : MARIA EUGENIA DIAZ JERALDO          *                                                                                      
      * PROGRAMADOR      : MARIA EUGENIA DIAZ JERALDO          *                                                                                      
      * FECHA DE CREACION: XX/XX/XXXX                          *                                                                                      
      *                                                        *                                                                                      
      * OBJETIVO PROGRAMA :                                    *                                                                                      
      *   MANTENCION DE MANDATOS DE CARGO                      *                                                                                      
      *                                                        *                                                                                      
      * ARCHIVOS  : AHOMTAB - PAHO.P.TRAN.TABLAS               *                                                                                      
      * TABLAS    :                                            *                                                                                      
      *   NEG140 - TABLA MOVIMIENTO EVENTOS DEL NEGOCIO        *                                                                                      
      *   DTO140 - TABLA DATOS ASOCIADOS MVT DE EVENTOS        *                                                                                      
      *   CVS138 - TABLA DE CONVENIOS DE SERVICIOS             *                                                                                      
      *   EJC103 - TABLA DE EJECUTIVOS                         *                                                                                      
      *   OFI103 - TABLA DE OFICINAS                           *                                                                                      
      *   RCO112 - RELACION CLIENTE OPERACION                  *                                                                                      
      *   OPE112 - OPERACIONES                                 *                                                                                      
      *   MON103 - MONEDAS                                     *                                                                                      
      *   DET138 - TABLA CON DETALLES-MANDATO                  *                                                                                      
      *   OPA110 - TABLA OPERACIONES DE AHORRO                 *                                                                                      
      *   RCA110 - TABLA RELACION CLIENTE - AHORRO             *                                                                                      
      *   CLA114 - TABLA CLIENTES DE AHORRO                    *                                                                                      
      *   ROP112 - TABLA OPERACIONES RELACIONADAS              *                                                                                      
      *   CLI118 - TABLA DE CLIENTES                           *                                                                                      
      *   TBL138 - TABLA DE TABLAS LOCALES (TABLON)            *                                                                                      
      **********************************************************                                                                                      
      *                    MODIFICACION                        *                                                                                      
      **********************************************************                                                                                      
      *    OBJETIVO                              * RESPONSABLE *                                                                                      
      *                                          *   FECHA     *                                                                                      
      **********************************************************                                                                                      
      * INCLUYE CARGOS EN CTAS. AHORRO Y GRABA   *  JPSA       *                                                                                      
      * LOG                                      *  05.07.1998 *                                                                                      
      * RESTRINGE CARGO DE CUENTAS AHORRO VISTA  *  JPSA       *                                                                                      
      *                                          *  20.10.1999 *                                                                                      
      * 1)VER MANDATOS CON CTA CARGO CANCELADA   *  AMC        *                                                                                      
      * PERMITIENDO SOLO REVOCAR                 * 03.02.2000  *                                                                                      
      * 2)VALIDAC. CTAS BIPERS. MANDANTES PUEDE  *             *                                                                                      
      * SER CUALQUIERA DE LOS 2                  *             *                                                                                      
      * 3)VER MANDATO CREADO CON CUENTA PLAZO    *             *                                                                                      
      * 4)CAMBIO DE ELEMENT LIST PARA RCA PUEDA  *             *                                                                                      
      * LEER RCA-EST-REL                         *             *                                                                                      
      * 5)EN PARRAFOS POR-RUT, POR-NUMERO Y POR-CTA            *                                                                                      
      * ERROR EN LOGICA DE GO TO                 *             *                                                                                      
      * PERMITE INGRESO DE CUENTAS AHORRO VIVIEN-*  JPSA       *                                                                                      
      * DA SOLO PARA CONVENIOS EN SEGUROS        *  07.03.2000 *                                                                                      
      * AGRANDA COMMAREA                         *  JPSA       *                                                                                      
      *                                          *  11.04.2000 *                                                                                      
      * RESTRINGE LA CREACION DE MANDATOS A      *  JPSA       *                                                                                      
      * VIGENTES                                 *  27.04.2000 *                                                                                      
      * NORMALIZA PARRAFO VALIDA-RUT2 POR PERDIDA*  AMC        *                                                                                      
      * DE CONTROL.                              *  27.07.2000 *                                                                                      
      * PERMITE EL INGRESO DE CUENTAS DE AHORRO  *  JPSA       *                                                                                      
      * TIPO PLAZO GIRO DIFERIDO CONDICIONAL     *  21.08.2000 *                                                                                      
      * VALIDA TIPO DE CUENTA PARA CVN SONRISA   *  JPSA       *                                                                                      
      * MUJER             ( CORRECCION )         *  30.08.2000 *                                                                                      
      * INCORPORA DESPLIUEGUE SEGUNDO TITULAR    *  JPSA       *                                                                                      
      *                                          *  04.10.2000 *                                                                                      
      * PERMITE INGRESO DE CUENTA DE AHORRO CON  *  JPSA       *                                                                                      
      * RELACION TI1 O TIT2                      *  21.11.2000 *                                                                                      
      * INGRESO DE CONVENIO AHORRO SEGURO        *  JPSA       *                                                                                      
      *                                          *  26.12.2000 *                                                                                      
      * INCLUYE NUEVA VALIDACION DE CUENTA EN    *  JPSA       *                                                                                      
      * AHO                                      *  04.01.2000 *                                                                                      
      * VALIDACION DE RUT TITULAR 1 Y TITULAR 2  *  JPSA       *                                                                                      
      *                                          *  18.06.2001 *                                                                                      
      * ELIMINA OPCION DE IMPRESION              *  JPSA       *                                                                                      
      *                                          *  09.07.2001 *                                                                                      
      * INCLUYE NUEVO TIPO DE CONVENIO           *  JPSA       *                                                                                      
      *                                          *  31.08.2001 *                                                                                      
      * SI REVOCA MANDATO MODIFICA ESTADO EN RCO *  AMC        *                                                                                      
      *                                          *  23.04.2002 *                                                                                      
      * RESCATA OFICINA DE AHO DE ARCHIVO        *  JPSA       *                                                                                      
      * AHOMTAB                                  *  09.05.2002 *                                                                                      
      * ACEPTA SUPRODUCTO DE AHORRO ESTUDIO SEG. *  JPSA       *                                                                                      
      *                                          *  05.11.2002 *                                                                                      
      * ACEPTA INGRESAR TIT2 COMO RUT1           *  ALMCA      *                                                                                      
      *                                          *  28.02.2003 *                                                                                      
      * INCLUYE CARACTERISTICAS DE CONVENIO PARA *  JPSA       *                                                                                      
      * ELIMINACION/BLOQUEO                      *  17.03.2003 *                                                                                      
      * VALIDA CUENTAS TCR                       *  JPSA       *                                                                                      
      *                                          *  03.11.2004 *                                                                                      
      * MODIFICA MENSAJES DE TCR                 *  JPSA       *                                                                                      
      *                                          *  18.01.2005 *                                                                                      
      * PERMITE CANCELACION A OFICINAS MDT TCR   *  JPSA       *                                                                                      
      *                                          *  31.01.2005 *                                                                                      
      * SI TIPOCTA = TCR Y CTA NO VIGENTE ENVIA  *  AMC       *                                                                                       
      * MENSAJE PARTICULAR                       *  30.06.2005 *                                                                                      
      *                                          *  31.01.2005 *                                                                                      
      * SE AGREGA COMPARACION DEL VALOR 'TIT'    *  01.12.2006 *                                                                                      
      * PARA CAMPO RCO-COD-RCOP                  *             *                                                                                      
      * ENRIQUE MARIN I.                         *  EMI        *                                                                                      
      *                                          *             *                                                                                      
      * SE UTILIZA FECHA DEL DIA PARA CREAR NUEVO*  01.12.2006 *                                                                                      
      * MANDATO                                  *             *                                                                                      
      * ENRIQUE MARIN I.                         *  EMI01      *                                                                                      
      * SE ELIMINA ESTADOS PENDIENTES            *  06.02.2008 *                                                                                      
      * JUAN PABLO SOTO AZOCAR                   *  JPSA01     *                                                                                      
      * SE INCORPORA INGRESO DE CUENTA RUT       *  31.03.2008 *                                                                                      
      * ENRIQUE MARIN I.                         *  EMI02      *                                                                                      
      * SE INCORPORA MENSDAJE DE AVISO DE CIERRE *  10.09.2008 *                                                                                      
      * PAC HIPOTECARIO                          *             *                                                                                      
      * SERGIO LYON B.                           *  SLB01      *                                                                                      
      * SE CORRIGE BUSQUEDA POR MANDATO PARA     *  10.06.2009 *                                                                                      
      * CUENTA RUT                               *             *                                                                                      
      * ENRIQUE MARIN I.                         *  EMI03      *                                                                                      
      * ELIMINAR TS DE PRUEBA                    *  29.07.2009 *                                                                                      
      * ENRIQUE MARIN I.                         *             *                                                                                      
      * ELIMINAR USO DE RUTINA SCHC224           *  05.04.2012 *                                                                                      
      * AUGUSTO EDDING                           *             *                                                                                      
      * SE ELIMINA RESTRICCION PARA CARGOS TCR   *  08.10.2015 *                                                                                      
      * Y TIPO CRE                               *             *                                                                                      
      * SEBASTIAN GALLARDO CACERES (SGC1)        *             *                                                                                      
      **********************************************************                                                                                      
       ENVIRONMENT DIVISION.                                                                                                                          
      *----------------------                                                                                                                         
       CONFIGURATION SECTION.                                                                                                                         
      *----------------------                                                                                                                         
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.                                                                                                         
       DATA DIVISION.                                                                                                                                 
      *--------------                                                                                                                                 
       WORKING-STORAGE SECTION.                                                                                                                       
      *------------------------                                                                                                                       
      *----AREA ABEND                                                                                                                                 
EMI02  01  ABEND.                                                                                                                                     
           05  V-COD-ABEND          PIC  X(04) VALUE ALL '0'.                                                                                         
           05  V-PGM-ABEND          PIC  X(08) VALUE SPACES.                                                                                          
           05  OTROS.                                                                                                                                 
               10  WS-GLS-ERR       PIC  X(40).                                                                                                       
                                                                                                                                                      
       01  REGDAT-AHOMSGRT.                                                                                                                           
           05 LLAVE-AHOMSGRT.                                                                                                                         
              10 RUT-AHOMSGRT          PIC X(09).                                                                                                     
              10 CTA-AHOMSGRT          PIC X(11).                                                                                                     
              10 FILLER                PIC X(01).                                                                                                     
                                                                                                                                                      
       01  W-LARGO-AHOMTAB             PIC S9(04) COMP VALUE +80.                                                                                     
       01  REGDAT-AHOMTAB.                                                                                                                            
       COPY PTABOFI.                                                                                                                                  
SLB01  01  W-MSJ-ESP.                                                                                                                                 
           05 FILLER                    PIC X(18) VALUE                                                                                               
              'Cierre PAC HIP Ná '.                                                                                                                   
           05 W-NUM-ESP                 PIC X(09).                                                                                                    
           05 FILLER                    PIC X(40) VALUE                                                                                               
              ' perderê Tasa Pref aumentando Div en UF '.                                                                                             
           05 W-MTO-ESP                 PIC ZZZZ9,999999.                                                                                             
       01  W-MENSAJE-ESP REDEFINES W-MSJ-ESP PIC X(79).                                                                                               
                                                                                                                                                      
       01  W-VARIABLES.                                                                                                                               
EMI02      05 WS-CUENTA                PIC X(11)  VALUE SPACES.                                                                                       
           05 WS-SW-SNELI              PIC 9(02)  VALUE ZEROES.                                                                                       
              88 WS-SW-SNELI-OK        VALUE 1.                                                                                                       
           05 WS-SW-SALTA              PIC 9(02)  VALUE ZEROES.                                                                                       
              88 WS-SW-SALTA-OK        VALUE 1.                                                                                                       
           05 WS-SW-CTA-AHO            PIC X(04)  VALUE SPACES.                                                                                       
              88 WS-SW-CTA-AHO-OK      VALUE '0100' '0400' '0500'                                                                                     
                                             '0300' '0200' '0600'.                                                                                    
           05 WS-CRV-EVT               PIC 9(08)  VALUE ZEROES.                                                                                       
           05 W-VAL-COD                PIC X(10).                                                                                                     
           05 FILLER REDEFINES W-VAL-COD.                                                                                                             
              10 W-TPO-CTA             PIC X(04).                                                                                                     
              10 FILLER                PIC X(06).                                                                                                     
           05 WS-COD-ERROR             PIC 9(02).                                                                                                     
           05 W-NUMERO                 PIC 9(11).                                                                                                     
           05 W-MONTO-UF               PIC ZZ.ZZZ.ZZZ.ZZ9,9999.                                                                                       
           05 W-MONTO-PESO             PIC ZZZ.ZZZ.ZZZ.ZZZ.ZZ9.                                                                                       
           05 W-I                      PIC 9(02).                                                                                                     
           05 W-J                      PIC 9(02).                                                                                                     
           05 W-CORRX                  PIC X(05).                                                                                                     
           05 W-CORRN REDEFINES W-CORRX PIC 9(05).                                                                                                    
SLB01 *    05 W-LENGTH                 PIC S9(04) COMP VALUE +134.                                                                                    
           05 W-LENGTH                 PIC S9(04) COMP VALUE +161.                                                                                    
           05 W-LENVT01                PIC S9(04) COMP VALUE +80.                                                                                     
           05 W-PRD-COD                PIC X(04).                                                                                                     
           05 W-OPERACION              PIC X(30).                                                                                                     
           05 FILLER REDEFINES W-OPERACION.                                                                                                           
              10 W-NUM-11              PIC X(11).                                                                                                     
              10 FILLER                PIC X(19).                                                                                                     
           05 W-EXISTE                 PIC X(02).                                                                                                     
           05 W-EXISTE-RUT             PIC X(02).                                                                                                     
           05 W-ERROR                  PIC X(02).                                                                                                     
           05 W-VIGTE                  PIC X(02).                                                                                                     
           05 W-IDENTIF.                                                                                                                              
              10 W-APLIC               PIC X(04).                                                                                                     
              10 FILLER REDEFINES W-APLIC.                                                                                                            
                 15 W-COD-PRO          PIC X(03).                                                                                                     
                 15 FILLER             PIC X(01).                                                                                                     
              10 W-NRO-CTA             PIC X(11).                                                                                                     
              10 FILLER                PIC X(19).                                                                                                     
              10 FILLER                PIC X(06).                                                                                                     
           05 W-CONVENIO.                                                                                                                             
              10 W-COD-CVN             PIC X(11).                                                                                                     
              10 FILLER                PIC X.                                                                                                         
              10 W-GLO-CVN             PIC X(19).                                                                                                     
           05 W-SW-RUT                 PIC 9(01) VALUE 0.                                                                                             
           05 W-RUT-AUX.                                                                                                                              
              10 W-NUMRUT-AUX          PIC X(09).                                                                                                     
              10 W-DIGRUT-AUX          PIC X(01).                                                                                                     
                                                                                                                                                      
       01  CONSTANTES.                                                                                                                                
           05 CT-GLS-CRUT              PIC X(20) VALUE 'CUENTA RUT'.                                                                                  
           05 CT-MODPAC                PIC X(06) VALUE 'MODPAC'.                                                                                      
           05 CT-INST                  PIC X(05) VALUE 'INST.'.                                                                                       
           05 CT-CALI                  PIC X(04) VALUE 'CALI'.                                                                                        
           05 CT-CRUT                  PIC X(04) VALUE 'CRUT'.                                                                                        
           05 CT-DS80                  PIC X(04) VALUE 'DS80'.                                                                                        
           05 CT-CTV                   PIC X(04) VALUE 'CTV '.                                                                                        
           05 CT-AHO                   PIC X(04) VALUE 'AHO '.                                                                                        
           05 CT-MDT                   PIC X(04) VALUE 'MDT '.                                                                                        
           05 CT-CVN                   PIC X(03) VALUE 'CVN'.                                                                                         
           05 CT-TCR                   PIC X(03) VALUE 'TCR'.                                                                                         
           05 CT-VIG                   PIC X(03) VALUE 'VIG'.                                                                                         
           05 CT-TIT                   PIC X(03) VALUE 'TIT'.                                                                                         
           05 CT-TI1                   PIC X(03) VALUE 'TI1'.                                                                                         
           05 CT-TI2                   PIC X(03) VALUE 'TI2'.                                                                                         
           05 CT-TI                    PIC X(02) VALUE 'TI'.                                                                                          
           05 CT-1XX                   PIC X(03) VALUE '1  '.                                                                                         
           05 CT-2XX                   PIC X(03) VALUE '2  '.                                                                                         
           05 CT-3XX                   PIC X(03) VALUE '3  '.                                                                                         
           05 CT-SG                    PIC X(02) VALUE 'SG'.                                                                                          
           05 CT-SGAHO                 PIC X(05) VALUE 'SGAHO'.                                                                                       
           05 CT-13                    PIC 9(03) VALUE 013.                                                                                           
           05 CT-100                   PIC 9(03) VALUE 100.                                                                                           
           05 CT-999                   PIC 9(03) VALUE 999.                                                                                           
           05 CT-1                     PIC 9(01) VALUE 1.                                                                                             
           05 CT-2                     PIC 9(01) VALUE 2.                                                                                             
           05 CT-3                     PIC 9(01) VALUE 3.                                                                                             
           05 CT-4                     PIC 9(01) VALUE 4.                                                                                             
           05 CT-5                     PIC 9(01) VALUE 5.                                                                                             
           05 CT-6                     PIC 9(01) VALUE 6.                                                                                             
           05 CT-7                     PIC 9(01) VALUE 7.                                                                                             
           05 CT-8                     PIC 9(01) VALUE 8.                                                                                             
           05 CT-9                     PIC 9(01) VALUE 9.                                                                                             
           05 CT-10                    PIC 9(02) VALUE 10.                                                                                            
           05 CT-11                    PIC 9(02) VALUE 11.                                                                                            
           05 CT-12                    PIC 9(02) VALUE 12.                                                                                            
           05 CT-14                    PIC 9(02) VALUE 14.                                                                                            
           05 CT-15                    PIC 9(02) VALUE 15.                                                                                            
           05 CT-18                    PIC 9(02) VALUE 18.                                                                                            
           05 CT-19                    PIC 9(02) VALUE 19.                                                                                            
           05 CT-30                    PIC 9(02) VALUE 30.                                                                                            
           05 CT-60                    PIC 9(02) VALUE 60.                                                                                            
           05 CT-103                   PIC 9(03) VALUE 103.                                                                                           
           05 CT-118                   PIC 9(03) VALUE 118.                                                                                           
           05 CT-138                   PIC 9(03) VALUE 138.                                                                                           
           05 CT-001                   PIC 9(03) VALUE 001.                                                                                           
           05 CT-1N                    PIC S9(01) VALUE -1.                                                                                           
           05 CT-8000                  PIC 9(04) VALUE 8000.                                                                                          
           05 CT-99999                 PIC 9(05) VALUE 99999.                                                                                         
           05 CT-CDSE680               PIC X(07) VALUE 'CDSE680'.                                                                                     
           05 CT-SI                    PIC X(02) VALUE 'SI'.                                                                                          
           05 CT-NO                    PIC X(02) VALUE 'NO'.                                                                                          
           05 CT-N                     PIC X(01) VALUE 'N'.                                                                                           
           05 CT-1X                    PIC X(02) VALUE '1'.                                                                                           
           05 CT-2X                    PIC X(01) VALUE '2'.                                                                                           
           05 CT-3X                    PIC X(01) VALUE '3'.                                                                                           
           05 CT-4X                    PIC X(01) VALUE '4'.                                                                                           
           05 CT-5X                    PIC X(01) VALUE '5'.                                                                                           
           05 CT-6X                    PIC X(01) VALUE '6'.                                                                                           
           05 CT-7X                    PIC X(01) VALUE '7'.                                                                                           
           05 CT-8X                    PIC X(01) VALUE '8'.                                                                                           
           05 CT-14X                   PIC X(02) VALUE '14'.                                                                                          
           05 CT-RDUKY                 PIC X(05) VALUE 'RDUKY'.                                                                                       
           05 CT-UPDAT                 PIC X(05) VALUE 'UPDAT'.                                                                                       
           05 CT-RELES                 PIC X(05) VALUE 'RELES'.                                                                                       
           05 CT-VIGENTE               PIC X(07) VALUE 'VIGENTE'.                                                                                     
           05 CT-VIGENTE2              PIC X(10) VALUE 'VIGENTE   '.                                                                                  
           05 CT-S                     PIC X(01) VALUE 'S'.                                                                                           
           05 CT-SLASH                 PIC X(01) VALUE '/'.                                                                                           
           05 CT-DOS-PUNTO             PIC X(01) VALUE ':'.                                                                                           
           05 CT-RDUKG                 PIC X(05) VALUE 'RDUKG'.                                                                                       
           05 CT-RCO01                 PIC X(05) VALUE 'RCO01'.                                                                                       
           05 CT-ELIMINADO             PIC X(09) VALUE 'ELIMINADO'.                                                                                   
           05 CT-REDKY                 PIC X(05) VALUE 'REDKY'.                                                                                       
           05 CT-CVN-SN-ELI            PIC X(10) VALUE 'CVN-SN-ELI'.                                                                                  
           05 CT-CANCE                 PIC X(05) VALUE 'CANCE'.                                                                                       
           05 CT-RDUNX                 PIC X(05) VALUE 'RDUNX'.                                                                                       
           05 CT-REDKG                 PIC X(05) VALUE 'REDKG'.                                                                                       
           05 CT-REDNX                 PIC X(05) VALUE 'REDNX'.                                                                                       
           05 CT-CDS                   PIC X(03) VALUE 'CDS'.                                                                                         
           05 CT-ADDIT                 PIC X(05) VALUE 'ADDIT'.                                                                                       
           05 CT-NEG01                 PIC X(05) VALUE 'NEG01'.                                                                                       
           05 CT-B                     PIC X(01) VALUE 'B'.                                                                                           
           05 CT-DTO01                 PIC X(05) VALUE 'DTO01'.                                                                                       
           05 CT-RCO00                 PIC X(05) VALUE 'RCO00'.                                                                                       
           05 CT-MDT-TIP-CTA-CAR       PIC X(15) VALUE                                                                                                
                                                 'MDT-TIP-CTA-CAR'.                                                                                   
           05 CT-999X                  PIC X(03) VALUE '999'.                                                                                         
           05 CT-OPE01                 PIC X(05) VALUE 'OPE01'.                                                                                       
           05 CT-OPA01                 PIC X(05) VALUE 'OPA01'.                                                                                       
           05 CT-RCA02                 PIC X(05) VALUE 'RCA02'.                                                                                       
           05 CT-CLA01                 PIC X(05) VALUE 'CLA01'.                                                                                       
           05 CT-ROP00                 PIC X(05) VALUE 'ROP00'.                                                                                       
           05 CT-CLI                   PIC X(03) VALUE 'CLI'.                                                                                         
           05 CT-CLI01                 PIC X(05) VALUE 'CLI01'.                                                                                       
           05 CT-TBL01                 PIC X(05) VALUE 'TBL01'.                                                                                       
           05 CT-MDT-COD-EST           PIC X(11) VALUE 'MDT-COD-EST'.                                                                                 
           05 CT-GLS-EJEC              PIC X(06) VALUE 'EJEC. '.                                                                                      
           05 CT-CVS                   PIC X(03) VALUE 'CVS'.                                                                                         
           05 CT-CVS01                 PIC X(05) VALUE 'CVS01'.                                                                                       
           05 CT-EJC                   PIC X(03) VALUE 'EJC'.                                                                                         
           05 CT-EJC01                 PIC X(05) VALUE 'EJC01'.                                                                                       
           05 CT-OFI                   PIC X(03) VALUE 'OFI'.                                                                                         
           05 CT-OFI01                 PIC X(05) VALUE 'OFI01'.                                                                                       
           05 CT-MON                   PIC X(03) VALUE 'MON'.                                                                                         
           05 CT-MON01                 PIC X(05) VALUE 'MON01'.                                                                                       
           05 CT-000X                  PIC X(03) VALUE '000'.                                                                                         
           05 CT-ROP01                 PIC X(05) VALUE 'ROP01'.                                                                                       
           05 CT-K                     PIC X(01) VALUE 'K'.                                                                                           
           05 CT-0X                    PIC X(01) VALUE '0'.                                                                                           
           05 CT-REDKL                 PIC X(05) VALUE 'REDKL'.                                                                                       
           05 CT-REDBR                 PIC X(05) VALUE 'REDBR'.                                                                                       
           05 CT-DET01                 PIC X(05) VALUE 'DET01'.                                                                                       
           05 CT-A                     PIC X(01) VALUE 'A'.                                                                                           
           05 CT-XOFI                  PIC X(04) VALUE ' OFI'.                                                                                        
           05 CT-DET                   PIC X(03) VALUE 'DET'.                                                                                         
           05 CT-N11X                  PIC X(12) VALUE 'N           '.                                                                                
           05 CT-BCCE040               PIC X(08) VALUE 'BCCE040 '.                                                                                    
           05 CT-PACV008               PIC X(08) VALUE 'PACV008 '.                                                                                    
           05 CT-TEGR010               PIC X(08) VALUE 'TEGR010 '.                                                                                    
           05 CT-TEGR009               PIC X(08) VALUE 'TEGR009 '.                                                                                    
           05 CT-CDSE681               PIC X(08) VALUE 'CDSE681 '.                                                                                    
           05 CT-ASICFIN               PIC X(08) VALUE 'ASICFIN '.                                                                                    
           05 CT-AHOMTAB               PIC X(08) VALUE 'AHOMTAB '.                                                                                    
           05 CT-GNSPPRFN              PIC X(08) VALUE 'GNSPPRFN'.                                                                                    
           05 CT-AHOMSGRT              PIC X(08) VALUE 'AHOMSGRT'.                                                                                    
           05 CT-LARGO-9               PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0009.                                                                                  
           05 CT-LARGO-10              PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0010.                                                                                  
           05 CT-LARGO-11              PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0011.                                                                                  
           05 CT-LARGO-12              PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0012.                                                                                  
           05 CT-LARGO-16              PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0016.                                                                                  
           05 CT-LARGO-33              PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0033.                                                                                  
           05 CT-LARGO-43              PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0043.                                                                                  
           05 CT-LARGO-161             PIC S9(04) USAGE BINARY                                                                                        
                                                        VALUE +0161.                                                                                  
                                                                                                                                                      
       01  GLOSAS.                                                                                                                                    
           05 GL-VIGENTE               PIC X(10) VALUE 'VIGENTE   '.                                                                                  
           05 GL-NO-EXI                PIC X(09) VALUE 'No existe'.                                                                                   
           05 GL-NO-DEF                PIC X(11) VALUE 'No definido'.                                                                                 
           05 GL-NE                    PIC X(04) VALUE 'N.E.'.                                                                                        
           05 GL-INGRESO               PIC X(55) VALUE                                                                                                
              'Ingrese Numero, Tipo Cuenta, Cuenta y R.U.T. Mandante 1'.                                                                              
           05 GL-ING-SUSP              PIC X(20) VALUE                                                                                                
              'Ingreso suspendido  '.                                                                                                                 
           05 GL-MAND-REV              PIC X(27) VALUE                                                                                                
              '** Mandato esta revocado **'.                                                                                                          
           05 GL-MAND-PEND             PIC X(37) VALUE                                                                                                
              '** Mandato pendiente de revocacion **'.                                                                                                
           05 GL-MAND-ACT1             PIC X(30) VALUE                                                                                                
              '** Mandato ya esta activado **'.                                                                                                       
           05 GL-MAND-REV-NOACT        PIC X(49) VALUE                                                                                                
              '** Mandato esta revocado. No se puede activar. **'.                                                                                    
           05 GL-CARGO                 PIC X(42) VALUE                                                                                                
              'Cargo TCR solo modificable por Oficina CRE'.                                                                                           
           05 GL-INC-MAND              PIC X(46) VALUE                                                                                                
              '* INCONSISTENCIA * Mandato no esta relacionado'.                                                                                       
           05 GL-CONF-ACT              PIC X(27) VALUE                                                                                                
              'Confirme activacion con PF2'.                                                                                                          
           05 GL-ERR-ACT-MAND          PIC X(31) VALUE                                                                                                
              '* ERROR * AL ACTUALIZAR MANDATO'.                                                                                                      
           05 GL-MAND-ACT2             PIC X(56) VALUE                                                                                                
             'Mandato activado. Detalles deben ser activados uno a uno'.                                                                              
           05 GL-MAND-ELIM             PIC X(31) VALUE                                                                                                
              '** Mandato ya esta Eliminado **'.                                                                                                      
           05 GL-CONF-REVOC            PIC X(27) VALUE                                                                                                
              'Confirme revocacion con PF4'.                                                                                                          
           05 GL-MAND-NO-RELAC         PIC X(46) VALUE                                                                                                
              '* INCONSISTENCIA * Mandato no esta relacionado'.                                                                                       
           05 GL-MAND-NO-ELIM          PIC X(33) VALUE                                                                                                
              'Mandato no Eliminado por completo'.                                                                                                    
           05 GL-MAND-REVOC            PIC X(37) VALUE                                                                                                
              'Mandato revocado. Detalles cancelados'.                                                                                                
           05 GL-ERR-ACT-DET           PIC X(31) VALUE                                                                                                
              '* ERROR * AL ACTUALIZAR DETALLE'.                                                                                                      
           05 GL-CTA-SOLO-VISTA        PIC X(27) VALUE                                                                                                
              'CUENTA SOLO PUEDE SER VISTA'.                                                                                                          
           05 GL-CLI-NO-MAND           PIC X(39) VALUE                                                                                                
              'Cliente no tiene mas mandatos asociados'.                                                                                              
           05 GL-MAND-NO-EXI           PIC X(17) VALUE                                                                                                
              'Mandato no existe'.                                                                                                                    
           05 GL-MAND-MAS-1TIT         PIC X(50) VALUE                                                                                                
              '* INCONSISTENCIA * Mandato con mas de un titular 1'.                                                                                   
           05 GL-MAND-SIN-CLI          PIC X(46) VALUE                                                                                                
              'Numero de mandato no tiene cliente relacionado'.                                                                                       
           05 GL-MAND-SIN-OPE          PIC X(47) VALUE                                                                                                
              'Mandato no tiene operacion relacionada de cargo'.                                                                                      
           05 GL-CTA-NO-EXI            PIC X(16) VALUE                                                                                                
              'Cuenta no existe'.                                                                                                                     
           05 GL-CTA-NO-VIG            PIC X(22) VALUE                                                                                                
              'Cuenta no esta vigente'.                                                                                                               
           05 GL-TIP-CTA-NO-VAL        PIC X(44) VALUE                                                                                                
              'Tipo de cta. de ahorro no valida para cargos'.                                                                                         
           05 GL-MON-CTA-NO-PES        PIC X(28) VALUE                                                                                                
              'Moneda de cuenta no es pesos'.                                                                                                         
           05 GL-TIT1-NO-CLI           PIC X(33) VALUE                                                                                                
              'TITULAR 1 NO ES CLIENTE DEL BANCO'.                                                                                                    
           05 GL-TIT2-NO-CLI           PIC X(33) VALUE                                                                                                
              'TITULAR 2 NO ES CLIENTE DEL BANCO'.                                                                                                    
           05 GL-TIT-NO-IGU            PIC X(40) VALUE                                                                                                
              'TITULAR 1 NO DEBER SER IGUAL A TITULAR 2'.                                                                                             
           05 GL-EJEC-NO-EXI           PIC X(19) VALUE                                                                                                
              'Ejecutivo no existe'.                                                                                                                  
           05 GL-TIP-CTA-NO-CORR       PIC X(38) VALUE                                                                                                
              'Tipo de cuenta de cargo no corresponde'.                                                                                               
           05 GL-CTA-SIN-MAND          PIC X(30) VALUE                                                                                                
              'Cuenta sin mandato relacionado'.                                                                                                       
           05 GL-N-MAND-NO-REL         PIC X(37) VALUE                                                                                                
              'Numero de mandato no esta relacionado'.                                                                                                
           05 GL-MAND2-NO-REL          PIC X(44) VALUE                                                                                                
              'Mandante 2 no esta relacionado con la cuenta'.                                                                                         
           05 GL-RUT-SIN-CTA           PIC X(28) VALUE                                                                                                
              'Rut no tiene cuenta asociada'.                                                                                                         
           05 GL-ERR-CTA-RUT           PIC X(20) VALUE                                                                                                
              'Error en cuenta rut:'.                                                                                                                 
           05 GL-MAND1-ING             PIC X(45) VALUE                                                                                                
              'Mandante 1 ingresado, no es cliente del Banco'.                                                                                        
           05 GL-RUT-SIN-MAND          PIC X(26) VALUE                                                                                                
              'R.U.T sin mandato asociado'.                                                                                                           
           05 GL-RUT-NO-TIT1           PIC X(33) VALUE                                                                                                
              'R.U.T. no es titular 1 de mandato'.                                                                                                    
           05 GL-MAND-NO-CTA-CGO       PIC X(44) VALUE                                                                                                
              'Mandato no tiene cuenta de cargo relacionada'.                                                                                         
           05 GL-EXI-MAND-NO-VIG       PIC X(41) VALUE                                                                                                
              'Existe mandato asociado y no esta vigente'.                                                                                            
           05 GL-INF-CRC               PIC X(26) VALUE                                                                                                
              '** Informacion Correcta **'.                                                                                                           
           05 GL-ING-FEC-SOL           PIC X(29) VALUE                                                                                                
              'Debe ingresar Fecha Solicitud'.                                                                                                        
           05 GL-ING-TIP-CTA           PIC X(28) VALUE                                                                                                
              'Debe ingresar Tipo de Cuenta'.                                                                                                         
           05 GL-ING-NUM-CTA           PIC X(30) VALUE                                                                                                
              'Debe ingresar Numero de Cuenta'.                                                                                                       
           05 GL-ING-NUM-RUT1          PIC X(38) VALUE                                                                                                
              'Debe ingresar numero R.U.T. mandante 1'.                                                                                               
           05 GL-ING-DIG-RUT1          PIC X(38) VALUE                                                                                                
              'Debe ingresar digito R.U.T. mandante 1'.                                                                                               
           05 GL-REV-EST-TARJ          PIC X(57) VALUE                                                                                                
            'Revise en Consulta Estado SituaciÏn, estado de la Tarjeta'.                                                                              
           05 GL-FEC-SOL-INC           PIC X(26) VALUE                                                                                                
              'Fecha Solicitud incorrecta'.                                                                                                           
           05 GL-FEC-SOL-NO-VAL        PIC X(25) VALUE                                                                                                
              'Fecha Solicitud no valida'.                                                                                                            
           05 GL-FEC-SOL-MEN-IGU       PIC X(56) VALUE                                                                                                
              'Fecha Solicitud debe ser menor o igual a Fecha del Dia'.                                                                               
           05 GL-DIG-INC               PIC X(29) VALUE                                                                                                
              'Digito verificador incorrecto'.                                                                                                        
           05 GL-RUT1-NO-CLI           PIC X(41) VALUE                                                                                                
              'R.U.T. mandante 1 no es cliente del banco'.                                                                                            
           05 GL-REL-MAND1-NOEXI       PIC X(44) VALUE                                                                                                
              'Relacion cuenta/R.U.T. mandante 1, no existe'.                                                                                         
           05 GL-REL-MAND1-NOVIG       PIC X(45) VALUE                                                                                                
              'Relacion cuenta/R.U.T. mandante 1, no vigente'.                                                                                        
           05 GL-REL-MAND1-SOLTIT      PIC X(74) VALUE                                                                                                
                      'Relacion cuenta/R.U.T. mandante 1, solo para titu                                                                              
      -               'lar sea unipers.o bipers.'.                                                                                                    
           05 GL-RUT-MAND1-NOTIT1      PIC X(46) VALUE                                                                                                
              'R.U.T. mandante 1 no es titular 1 de la cuenta'.                                                                                       
           05 GL-RUT-MAND2-NOTIT       PIC X(41) VALUE                                                                                                
              'R.U.T. mandante 2 no es cliente del banco'.                                                                                            
           05 GL-REL-MAND2-NOEXI       PIC X(44) VALUE                                                                                                
              'Relacion cuenta/R.U.T. mandante 2, no existe'.                                                                                         
           05 GL-REL-MAND2-NOVIG       PIC X(45) VALUE                                                                                                
              'Relacion cuenta/R.U.T. mandante 2, no vigente'.                                                                                        
           05 GL-RUT-MAND2-NOTIT2      PIC X(46) VALUE                                                                                                
              'R.U.T. mandante 2 no es titular 2 de la cuenta'.                                                                                       
           05 GL-NO-EXI-MAND           PIC X(40) VALUE                                                                                                
              'No existe mandato, pero esta relacionado'.                                                                                             
           05 GL-NUM-IGU-0             PIC X(25) VALUE                                                                                                
              'Numero debe ser igual a 0'.                                                                                                            
           05 GL-EXI-MAND-NO-TER       PIC X(44) VALUE                                                                                                
              'Existe mandato asociado, y no esta terminado'.                                                                                         
           05 GL-CONF-GRA              PIC X(45) VALUE                                                                                                
              'Confirme Grabacion con PF9'.                                                                                                           
           05 GL-MAND-NO-DET           PIC X(43) VALUE                                                                                                
              '*INCONSISTENCIA*, Mandato no tiene detalles'.                                                                                          
           05 GL-MAND-SIN-DET          PIC X(38) VALUE                                                                                                
              '*INCONSISTENCIA*, Mandato sin detalles'.                                                                                               
           05 GL-NO-MAS-DET            PIC X(25) VALUE                                                                                                
              '** No hay mas detalles **'.                                                                                                            
           05 GL-MAS-DET               PIC X(16) VALUE                                                                                                
              'Hay mas detalles'.                                                                                                                     
           05 GL-NO-EXI-CNV            PIC X(18) VALUE                                                                                                
              'NO EXISTE CONVENIO'.                                                                                                                   
           05 GL-NO-EXI-RCO            PIC X(15) VALUE                                                                                                
              'NO EXISTE (RCO)'.                                                                                                                      
           05 GL-NO-EXI-CLI            PIC X(15) VALUE                                                                                                
              'NO EXISTE (CLI)'.                                                                                                                      
           05 GL-NO-DET                PIC X(21) VALUE                                                                                                
              '** No hay detalles **'.                                                                                                                
           05 GL-PRI-PAG               PIC X(14) VALUE                                                                                                
              'Primera pagina'.                                                                                                                       
           05 GL-FNC-NO-CRR            PIC X(22) VALUE                                                                                                
              'Funcion no corresponde'.                                                                                                               
           05 GL-CNV-NO-EXI            PIC X(48) VALUE                                                                                                
              'Inconsistencia, convenio no existe en Sis. Cvns.'.                                                                                     
           05 GL-NUM-MAND-INCRC        PIC X(25) VALUE                                                                                                
              'Numero mandato incorrecto'.                                                                                                            
           05 GL-TIP-CTA-INCRC         PIC X(25) VALUE                                                                                                
              'Tipo de cuenta incorrecta'.                                                                                                            
           05 GL-NUM-CTA-INCRC         PIC X(26) VALUE                                                                                                
              'Numero de Cuenta incorreto'.                                                                                                           
           05 GL-RUT-MAND1-INCRC       PIC X(36) VALUE                                                                                                
              'Numero R.U.T. mandante 1, incorrecto'.                                                                                                 
           05 GL-DIG-MAND1-INCRC       PIC X(36) VALUE                                                                                                
              'Digito R.U.T. mandante 1, incorrecto'.                                                                                                 
           05 GL-FEC-SOL-INCRC         PIC X(26) VALUE                                                                                                
              'Fecha Solicitud incorrecta'.                                                                                                           
           05 GL-RUT-MAND2-INCRC       PIC X(36) VALUE                                                                                                
              'Numero R.U.T. mandante 2, incorrecto'.                                                                                                 
           05 GL-DIG-MAND2-INCRC       PIC X(36) VALUE                                                                                                
              'Digito R.U.T. mandante 2, incorrecto'.                                                                                                 
           05 GL-ERR-ARC-VSAM          PIC X(19) VALUE                                                                                                
              'Error archivos VSAM'.                                                                                                                  
           05 GL-ERR-DATACOM           PIC X(18) VALUE                                                                                                
              'Error base DATACOM'.                                                                                                                   
           05 GL-ERR-NO-IDENT          PIC X(21) VALUE                                                                                                
              'Error no identificado'.                                                                                                                
           05 GL-PRB-AHOMSGRT          PIC X(57) VALUE                                                                                                
            'Problemas con el archivo AHOMSGRT, avisar a informatica: '.                                                                              
           05 GL-RUT-YA-ASOC           PIC X(57) VALUE                                                                                                
            'RUT ingresado ya esta asociado a un convenio de este tipo'.                                                                              
           05 GL-AHOMSGRT-CERR         PIC X(46) VALUE                                                                                                
              'Archivo AHOMSGRT cerrado, avisar a informatica'.                                                                                       
           05 GL-OPC-ELI-MMNTO         PIC X(32) VALUE                                                                                                
              'OPCION ELIMINA POR EL MOMENTO...'.                                                                                                     
           05 GL-MAND-NO-ING           PIC X(28) VALUE                                                                                                
              'Mandato no ha sido ingresado'.                                                                                                         
           05 GL-CLI-CTA-CANCEL        PIC X(49) VALUE                                                                                                
              'Cliente con cta cancelada, sÏlo puede F4:ELIMINAR'.                                                                                    
           05 GL-CTA-SOLO-VOV          PIC X(38) VALUE                                                                                                
              'CUENTA SOLO PUEDE SER VISTA O VIVIENDA'.                                                                                               
           05 GL-ERR-GRAL              PIC X(19) VALUE                                                                                                
              'DS80: ERROR GENERAL'.                                                                                                                  
           05 GL-ERR-ABEND             PIC X(18) VALUE                                                                                                
              'DS80: ERROR ABEND:'.                                                                                                                   
           05 GL-ERR-ABEND2            PIC X(13) VALUE                                                                                                
              ' EN PROGRAMA:'.                                                                                                                        
           05 GL-TECL-INCRC            PIC X(22) VALUE                                                                                                
              '** Tecla incorrecta **'.                                                                                                               
           05 GL-CONF-SAL              PIC X(24) VALUE                                                                                                
              'Confirme Salida con PF10'.                                                                                                             
           05 GL-ERR-FECHA             PIC X(24) VALUE                                                                                                
              'FECHA NO NUMERICA'.                                                                                                                    
                                                                                                                                                      
       01  W-MSJ-ERROR.                                                                                                                               
           05 FILLER                   PIC X(15) VALUE '* ERROR *'.                                                                                   
           05 FILLER                   PIC X(07) VALUE 'BASE :'.                                                                                      
           05 ERROR-BASE               PIC X(04).                                                                                                     
           05 FILLER                   PIC X(05) VALUE SPACES.                                                                                        
           05 FILLER                   PIC X(08) VALUE 'TABLA ;'.                                                                                     
           05 ERROR-TABLA              PIC X(03).                                                                                                     
           05 FILLER                   PIC X(05) VALUE SPACES.                                                                                        
           05 FILLER                   PIC X(11) VALUE 'COD. RET :'.                                                                                  
           05 ERROR-RET                PIC X(02).                                                                                                     
                                                                                                                                                      
       01  W-MSJ-BCC.                                                                                                                                 
           05 FILLER                   PIC X(15) VALUE '* ERROR *'.                                                                                   
           05 FILLER                   PIC X(25) VALUE                                                                                                
              'BCCE040 CODIGO RETORNO : '.                                                                                                            
           05 ERR-BCC-RET              PIC 9(01).                                                                                                     
           05 FILLER                   PIC X(16) VALUE                                                                                                
              ' COD. DATACOM : '.                                                                                                                     
           05 ERR-BCC-CMN              PIC 9(06).                                                                                                     
                                                                                                                                                      
       01  W-MSJ.                                                                                                                                     
           05 W-MENSAJE                PIC X(79).                                                                                                     
           05 FILLER REDEFINES W-MENSAJE.                                                                                                             
              10 W-GLO-UNO             PIC X(30).                                                                                                     
              10 W-GLO-DOS             PIC X(49).                                                                                                     
                                                                                                                                                      
       01  W-RUT.                                                                                                                                     
           05 W-SUMA                   PIC 9(05).                                                                                                     
           05 W-RESTO                  PIC 9(05).                                                                                                     
           05 W-VALOR-DIG              PIC 9(02).                                                                                                     
           05 W-NUMRUT                 PIC X(09).                                                                                                     
           05 FILLER REDEFINES W-NUMRUT OCCURS 9 TIMES.                                                                                               
              10 W-DIG                 PIC 9(01).                                                                                                     
           05 W-DIG-VER                PIC X(01).                                                                                                     
           05 W-DIG-VER-N REDEFINES W-DIG-VER PIC 9(01).                                                                                              
                                                                                                                                                      
       01  W-INDICADORES.                                                                                                                             
           05 W-VALOR-CAMBIO           PIC X(01).                                                                                                     
              88 CAMBIO-NUMERO         VALUE '1'.                                                                                                     
              88 CAMBIO-TPOCTA         VALUE '2'.                                                                                                     
              88 CAMBIO-CUENTA         VALUE '3'.                                                                                                     
              88 CAMBIO-NUMRUT1        VALUE '4'.                                                                                                     
              88 CAMBIO-DIGRUT1        VALUE '5'.                                                                                                     
              88 CAMBIO-FECSOL         VALUE '6'.                                                                                                     
              88 CAMBIO-NUMRUT2        VALUE '7'.                                                                                                     
              88 CAMBIO-DIGRUT2        VALUE '8'.                                                                                                     
              88 SIN-CAMBIO            VALUE SPACES.                                                                                                  
           05 W-VALOR-ERROR            PIC X(01).                                                                                                     
              88 ERROR-NUMERO          VALUE '1'.                                                                                                     
              88 ERROR-TPOCTA          VALUE '2'.                                                                                                     
              88 ERROR-CUENTA          VALUE '3'.                                                                                                     
              88 ERROR-NUMRUT1         VALUE '4'.                                                                                                     
              88 ERROR-DIGRUT1         VALUE '5'.                                                                                                     
              88 ERROR-FECSOL          VALUE '6'.                                                                                                     
              88 ERROR-NUMRUT2         VALUE '7'.                                                                                                     
              88 ERROR-DIGRUT2         VALUE '8'.                                                                                                     
              88 ERROR-VSAM            VALUE 'A'.                                                                                                     
              88 ERROR-DATACOM         VALUE 'B'.                                                                                                     
              88 ERROR-OFIUSR          VALUE 'D'.                                                                                                     
              88 SIN-ERROR             VALUE ' '.                                                                                                     
                                                                                                                                                      
       01  W-TABLA-POSICIONES.                                                                                                                        
           05 FILLER                   PIC 9(04) VALUE 1120.                                                                                          
           05 FILLER                   PIC 9(04) VALUE 1280.                                                                                          
           05 FILLER                   PIC 9(04) VALUE 1440.                                                                                          
           05 FILLER                   PIC 9(04) VALUE 1600.                                                                                          
       01  W-TPOCIS     REDEFINES W-TABLA-POSICIONES.                                                                                                 
           05 W-POSICION               PIC 9(04) OCCURS 4 TIMES.                                                                                      
                                                                                                                                                      
       01  W-RCO01.                                                                                                                                   
           05 W-PRO-RCO01              PIC X(04).                                                                                                     
           05 W-OPE-RCO01              PIC X(30).                                                                                                     
           05 FILLER REDEFINES W-OPE-RCO01.                                                                                                           
              10 W-NUM-11-RCO01        PIC X(11).                                                                                                     
              10 FILLER                PIC X(19).                                                                                                     
           05 FILLER REDEFINES W-OPE-RCO01.                                                                                                           
              10 W-NUM-20-RCO01        PIC X(20).                                                                                                     
              10 FILLER                PIC X(10).                                                                                                     
           05 W-RUT-RCO01              PIC 9(09).                                                                                                     
                                                                                                                                                      
       01  W-RCO00.                                                                                                                                   
           05 W-RUT-RCO00              PIC 9(09).                                                                                                     
           05 W-PRO-RCO00              PIC X(04).                                                                                                     
           05 W-OPE-RCO00              PIC X(30).                                                                                                     
           05 FILLER REDEFINES W-OPE-RCO00.                                                                                                           
              10 W-NUM-RCO00           PIC X(11).                                                                                                     
              10 FILLER                PIC X(19).                                                                                                     
                                                                                                                                                      
       01  W-ROP00-ROP01.                                                                                                                             
           05 W-PRO-UNO-ROP            PIC X(04).                                                                                                     
           05 W-OPE-UNO-ROP            PIC X(30).                                                                                                     
           05 W-PRO-DOS-ROP            PIC X(04).                                                                                                     
           05 W-OPE-DOS-ROP            PIC X(30).                                                                                                     
                                                                                                                                                      
      *--------------------------------------------------*                                                                                            
      * AREA COMUN                                       *                                                                                            
      *--------------------------------------------------*                                                                                            
                                                                                                                                                      
       01  COM-CTARUT.                                                                                                                                
           05 COM-RUT               PIC X(09).                                                                                                        
           05 COM-DRT               PIC X(01).                                                                                                        
           05 COM-CTA               PIC X(20).                                                                                                        
           05 COM-RET               PIC X(03).                                                                                                        
                                                                                                                                                      
       01  FILLER                    PIC X(016) VALUE 'DFH-AREA-COMUN'.                                                                               
       01  DFH-AREA-COMUN.                                                                                                                            
           05 DFH-ENCABEZADO.                                                                                                                         
              10 DFH-PGM-ORG         PIC X(07).                                                                                                       
              10 DFH-OFIUSR          PIC X(03).                                                                                                       
              10 DFH-MODO            PIC X(03).                                                                                                       
              10 DFH-NUMERO          PIC X(11).                                                                                                       
              10 DFH-FECSOL          PIC X(08).                                                                                                       
              10 DFH-FECSOL-ED       PIC X(10).                                                                                                       
              10 DFH-TIP-CTA-AHO     PIC X(04).                                                                                                       
              10 DFH-TPOCTA          PIC X(04).                                                                                                       
              10 DFH-CUENTA          PIC X(20).                                                                                                       
              10 DFH-RUT1.                                                                                                                            
                 15 DFH-NUMRUT1      PIC X(09).                                                                                                       
                 15 DFH-DIGRUT1      PIC X(01).                                                                                                       
              10 DFH-RUT2.                                                                                                                            
                 15 DFH-NUMRUT2      PIC X(09).                                                                                                       
                 15 DFH-DIGRUT2      PIC X(01).                                                                                                       
              10 DFH-CODEJC          PIC X(04).                                                                                                       
              10 DFH-CODEST          PIC X(03).                                                                                                       
              10 DFH-OFICTA          PIC X(03).                                                                                                       
              10 DFH-MONCTA          PIC X(03).                                                                                                       
              10 DFH-FECEST          PIC X(08).                                                                                                       
              10 DFH-CORACT          PIC X(05).                                                                                                       
SLB01         10 DFH-TASESP          PIC X(01).                                                                                                       
SLB01         10 DFH-TASCTA          PIC X(11).                                                                                                       
SLB01         10 DFH-DIVESP          PIC 9(009)V9(006).                                                                                               
              10 DFH-DIVESPX         REDEFINES                                                                                                        
                 DFH-DIVESP          PIC X(015).                                                                                                      
           05 DFH-RESTO.                                                                                                                              
              10 DFH-CORUNO          PIC X(05).                                                                                                       
              10 DFH-ERROR           PIC X(01).                                                                                                       
              10 DFH-ERASE           PIC X(02).                                                                                                       
              10 DFH-REVOCA          PIC 9(01).                                                                                                       
              10 DFH-GRABAR          PIC 9(01).                                                                                                       
              10 DFH-ACTIVA          PIC 9(01).                                                                                                       
              10 DFH-SALIR           PIC 9(01).                                                                                                       
              10 DFH-IMPRIM          PIC 9(01).                                                                                                       
              10 DFH-ULTCOR          PIC 9(05).                                                                                                       
                                                                                                                                                      
      *--------------------------------------------------*                                                                                            
      * FORMATOS DE FECHAS                               *                                                                                            
      *--------------------------------------------------*                                                                                            
       01  W-FECHA-AMD           PIC X(10).                                                                                                           
       01  FILLER REDEFINES W-FECHA-AMD.                                                                                                              
           05 W-F-AMD            PIC 9(08).                                                                                                           
           05 FILLER REDEFINES W-F-AMD.                                                                                                               
              10 W-ANO-AMD       PIC 9(04).                                                                                                           
              10 W-MES-AMD       PIC 9(02).                                                                                                           
              10 W-DIA-AMD       PIC 9(02).                                                                                                           
           05 FILLER             PIC X(02).                                                                                                           
                                                                                                                                                      
       01  W-FECHA-DMA           PIC X(10).                                                                                                           
       01  FILLER REDEFINES W-FECHA-DMA.                                                                                                              
           05 FILLER             PIC X(02).                                                                                                           
           05 W-F-DMA            PIC 9(08).                                                                                                           
           05 FILLER REDEFINES W-F-DMA.                                                                                                               
              10 W-DIA-DMA       PIC 9(02).                                                                                                           
              10 W-MES-DMA       PIC 9(02).                                                                                                           
              10 W-ANO-DMA       PIC 9(04).                                                                                                           
                                                                                                                                                      
       01  W-FECHA-ED.                                                                                                                                
           02 W-DIA-ED            PIC 99.                                                                                                             
           02 FILLER              PIC X VALUE '/'.                                                                                                    
           02 W-MES-ED            PIC 99.                                                                                                             
           02 FILLER              PIC X VALUE '/'.                                                                                                    
           02 W-ANO-ED            PIC 9(04).                                                                                                          
                                                                                                                                                      
       01  W-HORA-FECHA.                                                                                                                              
           05 W-A1                PIC S9(15) COMP-3.                                                                                                  
           05 W-F1                PIC X(10).                                                                                                          
           05 FILLER REDEFINES W-F1.                                                                                                                  
              10 W-F1-AMD         PIC 9(08).                                                                                                          
              10 FILLER           PIC X(02).                                                                                                          
           05 W-H1                PIC X(08).                                                                                                          
           05 FILLER REDEFINES W-H1.                                                                                                                  
              10 W-H1-HMS             PIC 9(06).                                                                                                      
              10 FILLER               PIC X(02).                                                                                                      
                                                                                                                                                      
       01  W-FECHA-SOL            PIC 9(08).                                                                                                          
       01  FILLER REDEFINES W-FECHA-SOL.                                                                                                              
           05 W-ANO-SOL           PIC 9(04).                                                                                                          
           05 W-MES-SOL           PIC 9(02).                                                                                                          
           05 W-DIA-SOL           PIC 9(02).                                                                                                          
                                                                                                                                                      
      *--------------------------------------------------*                                                                                            
      *  PARAMETROS RUTINA DE FECHA                      *                                                                                            
      *--------------------------------------------------*                                                                                            
                                                                                                                                                      
       01  PRM-LINK-FECHA.                                                                                                                            
           02 FECHA-LINK           PIC 9(08).                                                                                                         
           02 FILLER REDEFINES FECHA-LINK.                                                                                                            
              03 DIA-LINK          PIC 9(02).                                                                                                         
              03 MES-LINK          PIC 9(02).                                                                                                         
              03 ANO-LINK          PIC 9(04).                                                                                                         
           02 NUMERO-LINK          PIC 9(7).                                                                                                          
           02 DIASEM-LINK          PIC 9.                                                                                                             
                                                                                                                                                      
       01 COM-TEGR009.                                                                                                                                
          05 COM-TEGR9-FECHA.                                                                                                                         
             10 COM-TGR9-DIA                PIC 9(02).                                                                                                
             10 COM-TGR9-MES                PIC 9(02).                                                                                                
             10 COM-TGR9-ANO                PIC 9(04).                                                                                                
          05 COM-TEGR9-INDICADOR            PIC 9(01).                                                                                                
                                                                                                                                                      
                                                                                                                                                      
      *--------------------------------------------------*                                                                                            
      *  PARAMETROS BCCE040                              *                                                                                            
      *--------------------------------------------------*                                                                                            
                                                                                                                                                      
       01  PRM-BCCE040.                                                                                                                               
           02 BCC-FIL              PIC 9(05).                                                                                                         
           02 BCC-RUT              PIC 9(09).                                                                                                         
           02 BCC-RUT-DV           PIC X(01).                                                                                                         
           02 BCC-OFI              PIC 9(03).                                                                                                         
           02 BCC-FEC              PIC X(08).                                                                                                         
           02 BCC-RET              PIC 9(01).                                                                                                         
           02 BCC-CMN              PIC 9(06).                                                                                                         
           02 BCC-MSG              PIC X(15).                                                                                                         
                                                                                                                                                      
      *-------------------------------------------------*                                                                                             
      *                                                 *                                                                                             
      *  VARIABLES CICS                                 *                                                                                             
      *                                                 *                                                                                             
      *-------------------------------------------------*                                                                                             
       COPY DFHBMSCA.                                                                                                                                 
       COPY DFHAID.                                                                                                                                   
                                                                                                                                                      
      *-------------------------------------------------*                                                                                             
      *                                                 *                                                                                             
      *  MAPA CDSM680                                   *                                                                                             
      *                                                 *                                                                                             
      *-------------------------------------------------*                                                                                             
       COPY CDSM680.                                                                                                                                  
       01  FILLER REDEFINES CDSM680I.                                                                                                                 
           05 FILLER             PIC X(378).                                                                                                          
           05 LINEAS             PIC X(492).                                                                                                          
           05 FILLER REDEFINES LINEAS OCCURS 6 TIMES.                                                                                                 
              10 FILLER          PIC X(03).                                                                                                           
              10 LINEA           PIC X(79).                                                                                                           
           05 FILLER REDEFINES LINEAS OCCURS 6 TIMES.                                                                                                 
              10 FILLER          PIC X(03).                                                                                                           
              10 CORREL          PIC X(05).                                                                                                           
              10 FILLER          PIC X(07).                                                                                                           
              10 CONVENIO        PIC X(31).                                                                                                           
              10 FILLER REDEFINES CONVENIO.                                                                                                           
                 15 APLI         PIC X(04).                                                                                                           
                 15 FILLER       PIC X(07).                                                                                                           
                 15 NCTA         PIC X(20).                                                                                                           
              10 FILLER          PIC X(02).                                                                                                           
              10 BNCO            PIC X(03).                                                                                                           
              10 FILLER          PIC X(01).                                                                                                           
              10 MNTO            PIC X(19).                                                                                                           
              10 FILLER          PIC X(01).                                                                                                           
              10 FECH            PIC X(10).                                                                                                           
           05 FILLER REDEFINES LINEAS OCCURS 6 TIMES.                                                                                                 
              10 FILLER          PIC X(03).                                                                                                           
              10 IDEN            PIC X(40).                                                                                                           
              10 FILLER          PIC X(01).                                                                                                           
              10 ESTA            PIC X(05).                                                                                                           
              10 FILLER          PIC X(03).                                                                                                           
              10 CART            PIC X(06).                                                                                                           
              10 FILLER          PIC X(01).                                                                                                           
              10 MNDA            PIC X(05).                                                                                                           
              10 FILLER          PIC X(03).                                                                                                           
              10 OFIC            PIC X(06).                                                                                                           
              10 FILLER          PIC X(04).                                                                                                           
              10 DIAP            PIC X(04).                                                                                                           
              10 FILLER          PIC X(01).                                                                                                           
           05 FILLER             PIC X(82).                                                                                                           
       01  FILLER     PIC X(100).                                                                                                                     
                                                                                                                                                      
      *********************                                                                                                                           
      *  AREA DATACOM/DB  *                                                                                                                           
      *********************                                                                                                                           
       01  RQ-UIB                      PIC X(32) VALUE 'CDSE680'.                                                                                     
                                                                                                                                                      
       01  RQ-AREA.                                                                                                                                   
           05 RQ-COM                   PIC X(05).                                                                                                     
           05 RQ-FIL                   PIC X(03).                                                                                                     
           05 RQ-KEY                   PIC X(05).                                                                                                     
           05 RQ-RET                   PIC X(02).                                                                                                     
           05 RQ-INT                   PIC X(01).                                                                                                     
           05 RQ-DBI                   PIC S9(04) COMP.                                                                                               
           05 RQ-RCI                   PIC X(07).                                                                                                     
           05 RQ-RES                   PIC X(51).                                                                                                     
           05 RQ-KEY-VAL               PIC X(60).                                                                                                     
                                                                                                                                                      
      * CLIENTE                                                                                                                                       
       01  W-LLAVE-CLI.                                                                                                                               
           05 RQ-RUT-CLI.                                                                                                                             
              10 RQ-NUM-CLI         PIC 9(09).                                                                                                        
              10 RQ-DIG-CLI         PIC X(01).                                                                                                        
                                                                                                                                                      
       01  FILLER.                                                                                                                                    
           COPY T118CLI1.                                                                                                                             
                                                                                                                                                      
      * CONVENIOS                                                                                                                                     
       01  W-LLAVE-CVS.                                                                                                                               
           05 RQ-PRO-CVS            PIC X(04).                                                                                                        
           05 RQ-CVN-CVS            PIC X(11).                                                                                                        
                                                                                                                                                      
       01  FILLER.                                                                                                                                    
           COPY T138CVS1.                                                                                                                             
                                                                                                                                                      
      * OFICINAS                                                                                                                                      
       01  W-LLAVE-OFI.                                                                                                                               
           05 RQ-COD-OFI            PIC X(03).                                                                                                        
                                                                                                                                                      
       01  FILLER.                                                                                                                                    
           COPY T103OFI1.                                                                                                                             
                                                                                                                                                      
      * EJECUTIVOS                                                                                                                                    
       01  W-LLAVE-EJC.                                                                                                                               
           05 RQ-COD-EJC            PIC 9(04).                                                                                                        
                                                                                                                                                      
       01  FILLER.                                                                                                                                    
           COPY T103EJC1.                                                                                                                             
                                                                                                                                                      
      * MONEDAS                                                                                                                                       
       01  W-LLAVE-MON.                                                                                                                               
           05 RQ-COD-MON            PIC X(03).                                                                                                        
                                                                                                                                                      
       01  FILLER.                                                                                                                                    
           COPY T103MON1.                                                                                                                             
                                                                                                                                                      
      * OPERACIONES AHO                                                                                                                               
                                                                                                                                                      
       01  RQ-AREA-OPA.                                                                                                                               
           05 RQ-COM-OPA               PIC X(05)  VALUE 'REDKX'.                                                                                      
           05 RQ-FIL-OPA               PIC X(03)  VALUE 'OPA'.                                                                                        
           05 RQ-KEY-OPA               PIC X(05)  VALUE 'OPA02'.                                                                                      
           05 RQ-RET-OPA               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-OPA               PIC X(01).                                                                                                     
           05 RQ-DBI-OPA               PIC S9(04) COMP  VALUE +110.                                                                                   
           05 RQ-RCI-OPA               PIC X(07).                                                                                                     
           05 RQ-RES-OPA               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-OPA           PIC X(11).                                                                                                     
                                                                                                                                                      
       01  FILLER.                                                                                                                                    
           COPY T110OPA1.                                                                                                                             
                                                                                                                                                      
      * RELACION CLIENTE OPERACION AHO                                                                                                                
                                                                                                                                                      
       01  RQ-AREA-RCA.                                                                                                                               
           05 RQ-COM-RCA               PIC X(05)  VALUE 'REDKX'.                                                                                      
           05 RQ-FIL-RCA               PIC X(03)  VALUE 'RCA'.                                                                                        
           05 RQ-KEY-RCA               PIC X(05)  VALUE 'RCA03'.                                                                                      
           05 RQ-RET-RCA               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-RCA               PIC X(01).                                                                                                     
           05 RQ-DBI-RCA               PIC S9(04) COMP  VALUE +110.                                                                                   
           05 RQ-RCI-RCA               PIC X(07).                                                                                                     
           05 RQ-RES-RCA               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-RCA.                                                                                                                         
              10 RQ-OPE-NUM-RCA        PIC X(11).                                                                                                     
              10 RQ-RUT-CLI-RCA        PIC 9(09).                                                                                                     
              10 RQ-DRT-CLI-RCA        PIC X(01).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T110RCA2.                                                                                                                              
                                                                                                                                                      
      * CLIENTE AHO                                                                                                                                   
                                                                                                                                                      
       01  RQ-AREA-CLA.                                                                                                                               
           05 RQ-COM-CLA               PIC X(05)  VALUE 'REDKX'.                                                                                      
           05 RQ-FIL-CLA               PIC X(03)  VALUE 'CLA'.                                                                                        
           05 RQ-KEY-CLA               PIC X(05)  VALUE 'CLA01'.                                                                                      
           05 RQ-RET-CLA               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-CLA               PIC X(01).                                                                                                     
           05 RQ-DBI-CLA               PIC S9(04) COMP  VALUE +114.                                                                                   
           05 RQ-RCI-CLA               PIC X(07).                                                                                                     
           05 RQ-RES-CLA               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-CLA.                                                                                                                         
              10 RQ-RUT-CLA            PIC X(09).                                                                                                     
              10 RQ-DRT-CLA            PIC X(01).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T114CLA1.                                                                                                                              
                                                                                                                                                      
      * RELACION CLIENTE OPERACION                                                                                                                    
                                                                                                                                                      
       01  RQ-AREA-RCO.                                                                                                                               
           05 RQ-COM-RCO               PIC X(05).                                                                                                     
           05 RQ-FIL-RCO               PIC X(03)  VALUE 'RCO'.                                                                                        
           05 RQ-KEY-RCO               PIC X(05).                                                                                                     
           05 RQ-RET-RCO               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-RCO               PIC X(01).                                                                                                     
           05 RQ-DBI-RCO               PIC S9(04) COMP  VALUE +112.                                                                                   
           05 RQ-RCI-RCO               PIC X(07).                                                                                                     
           05 RQ-RES-RCO               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-RCO           PIC X(50).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T112RCO1.                                                                                                                              
                                                                                                                                                      
      * OPERACIONES                                                                                                                                   
                                                                                                                                                      
       01  RQ-AREA-OPE.                                                                                                                               
           05 RQ-COM-OPE               PIC X(05).                                                                                                     
           05 RQ-FIL-OPE               PIC X(03)  VALUE 'OPE'.                                                                                        
           05 RQ-KEY-OPE               PIC X(05)  VALUE 'OPE00'.                                                                                      
           05 RQ-RET-OPE               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-OPE               PIC X(01).                                                                                                     
           05 RQ-DBI-OPE               PIC S9(04) COMP  VALUE +112.                                                                                   
           05 RQ-RCI-OPE               PIC X(07).                                                                                                     
           05 RQ-RES-OPE               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-OPE.                                                                                                                         
              10 RQ-PRO-OPE            PIC X(04).                                                                                                     
              10 RQ-OPE-OPE            PIC X(30).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T112OPE1.                                                                                                                              
                                                                                                                                                      
      * OPERACIONES RELACIONADAS                                                                                                                      
                                                                                                                                                      
       01  RQ-AREA-ROP.                                                                                                                               
           05 RQ-COM-ROP               PIC X(05).                                                                                                     
           05 RQ-FIL-ROP               PIC X(03)  VALUE 'ROP'.                                                                                        
           05 RQ-KEY-ROP               PIC X(05).                                                                                                     
           05 RQ-RET-ROP               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-ROP               PIC X(01).                                                                                                     
           05 RQ-DBI-ROP               PIC S9(04) COMP  VALUE +112.                                                                                   
           05 RQ-RCI-ROP               PIC X(07).                                                                                                     
           05 RQ-RES-ROP               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-ROP           PIC X(68).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T112ROP0.                                                                                                                              
                                                                                                                                                      
      * TABLA DE TABLAS                                                                                                                               
                                                                                                                                                      
       01  RQ-AREA-TBL.                                                                                                                               
           05 RQ-COM-TBL               PIC X(05).                                                                                                     
           05 RQ-FIL-TBL               PIC X(03)  VALUE 'TBL'.                                                                                        
           05 RQ-KEY-TBL               PIC X(05)  VALUE 'TBL01'.                                                                                      
           05 RQ-RET-TBL               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-TBL               PIC X(01).                                                                                                     
           05 RQ-DBI-TBL               PIC S9(04) COMP  VALUE +138.                                                                                   
           05 RQ-RCI-TBL               PIC X(07).                                                                                                     
           05 RQ-RES-TBL               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-TBL.                                                                                                                         
              10 RQ-COD-TBL            PIC X(15).                                                                                                     
              10 RQ-VAL-TBL            PIC X(10).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T138TBL1.                                                                                                                              
                                                                                                                                                      
      * DETALLES MANDATOS                                                                                                                             
                                                                                                                                                      
       01  RQ-AREA-DET.                                                                                                                               
           05 RQ-COM-DET               PIC X(05).                                                                                                     
           05 RQ-FIL-DET               PIC X(03)  VALUE 'DET'.                                                                                        
           05 RQ-KEY-DET               PIC X(05)  VALUE 'DET01'.                                                                                      
           05 RQ-RET-DET               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-DET               PIC X(01).                                                                                                     
           05 RQ-DBI-DET               PIC S9(04) COMP  VALUE +138.                                                                                   
           05 RQ-RCI-DET               PIC X(07).                                                                                                     
           05 RQ-RES-DET               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-DET.                                                                                                                         
              10 RQ-PRO-DET            PIC X(04).                                                                                                     
              10 RQ-OPE-DET            PIC X(11).                                                                                                     
              10 RQ-COR-DET            PIC X(05).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T138DET1.                                                                                                                              
                                                                                                                                                      
      * LOG EVENTOS                                                                                                                                   
                                                                                                                                                      
       01  RQ-AREA-DTO.                                                                                                                               
           05 RQ-COM-DTO               PIC X(05).                                                                                                     
           05 RQ-FIL-DTO               PIC X(03)  VALUE 'DTO'.                                                                                        
           05 RQ-KEY-DTO               PIC X(05)  VALUE 'DTO01'.                                                                                      
           05 RQ-RET-DTO               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-DTO               PIC X(01).                                                                                                     
           05 RQ-DBI-DTO               PIC S9(04) COMP  VALUE +140.                                                                                   
           05 RQ-RCI-DTO               PIC X(07).                                                                                                     
           05 RQ-RES-DTO               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-DTO.                                                                                                                         
              10 RQ-FEC-MOV-DTO        PIC 9(08).                                                                                                     
              10 RQ-EVT-COD-DTO        PIC X(10).                                                                                                     
              10 RQ-CRV-EVT-DTO        PIC X(04).                                                                                                     
              10 RQ-DTO-COD-DTO        PIC X(10).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T140DTO1.                                                                                                                              
                                                                                                                                                      
      * LOG NEGOCIO                                                                                                                                   
                                                                                                                                                      
       01  RQ-AREA-NEG.                                                                                                                               
           05 RQ-COM-NEG               PIC X(05).                                                                                                     
           05 RQ-FIL-NEG               PIC X(03)  VALUE 'NEG'.                                                                                        
           05 RQ-KEY-NEG               PIC X(05)  VALUE 'NEG01'.                                                                                      
           05 RQ-RET-NEG               PIC X(02)  VALUE SPACES.                                                                                       
           05 RQ-INT-NEG               PIC X(01).                                                                                                     
           05 RQ-DBI-NEG               PIC S9(04) COMP  VALUE +140.                                                                                   
           05 RQ-RCI-NEG               PIC X(07).                                                                                                     
           05 RQ-RES-NEG               PIC X(51).                                                                                                     
           05 RQ-KEY-VAL-NEG.                                                                                                                         
              10 RQ-EVT-COD-NEG        PIC X(10).                                                                                                     
              10 RQ-FEC-MVT-NEG        PIC 9(08).                                                                                                     
              10 RQ-CRV-EVT-NEG        PIC 9(09).                                                                                                     
                                                                                                                                                      
       01 FILLER.                                                                                                                                     
          COPY T140NEG1.                                                                                                                              
                                                                                                                                                      
       01  W-ELEMENT-LIST.                                                                                                                            
           02 W-ELM-NAME          PIC X(5)  VALUE SPACES.                                                                                             
           02 W-ELE-SEGU          PIC X.                                                                                                              
           02 FILLER              PIC X(5)  VALUE SPACES.                                                                                             
                                                                                                                                                      
       01  COMM-FIELDS.                                                                                                                               
           05 COMM-S1PGFIN        PIC  X(080).                                                                                                        
       01  COMM-F REDEFINES COMM-FIELDS.                                                                                                              
           05 COMM-ACCESS         PIC  X(010).                                                                                                        
           05 COMM-EST            PIC  9.                                                                                                             
                                                                                                                                                      
       LINKAGE SECTION.                                                                                                                               
      *----------------                                                                                                                               
       01  DFHCOMMAREA            PIC  X(161).                                                                                                        
                                                                                                                                                      
       01  TCTUA-AREA.                                                                                                                                
           05 TCTUA-RUT-USERID    PIC  X(008).                                                                                                        
           05 TCTUA-OFICINA       PIC  X(003).                                                                                                        
           05 TCTUA-DDMMYY        PIC  X(008).                                                                                                        
           05 TCTUA-SEC.                                                                                                                              
              10 TCTUA-MOD        PIC  X(001)    OCCURS 20 TIMES.                                                                                     
           05 TCTUA-NOMBRE        PIC  X(040).                                                                                                        
           05 TCTUA-CTA-CANCELADA PIC  X.                                                                                                             
           05 TCTUA-CTA-NOVISTA   PIC  X.                                                                                                             
                                                                                                                                                      
       PROCEDURE DIVISION.                                                                                                                            
      *-------------------                                                                                                                            
           ENTRY 'DBMSCBL'.                                                                                                                           
                                                                                                                                                      
           EXEC CICS HANDLE CONDITION ERROR (ERROR-GENERAL) END-EXEC                                                                                  
           EXEC CICS HANDLE ABEND LABEL     (9999-ABEND)   END-EXEC                                                                                   
           EXEC CICS IGNORE CONDITION MAPFAIL               END-EXEC                                                                                  
           EXEC CICS ADDRESS TCTUA (ADDRESS OF TCTUA-AREA)  END-EXEC                                                                                  
                                                                                                                                                      
           MOVE SPACES TO W-VALOR-ERROR                                                                                                               
                                                                                                                                                      
           IF EIBCALEN < CT-100                                                                                                                       
              MOVE SPACES         TO DFH-AREA-COMUN                                                                                                   
SLB01         MOVE SPACES         TO DFH-TASESP                                                                                                       
SLB01         MOVE SPACES         TO DFH-TASCTA                                                                                                       
SLB01         MOVE ZEROS          TO DFH-DIVESP                                                                                                       
              MOVE CT-CDSE680     TO DFH-PGM-ORG                                                                                                      
              MOVE CT-SI          TO DFH-ERASE                                                                                                        
              GO TO COMIENZO.                                                                                                                         
                                                                                                                                                      
           MOVE DFHCOMMAREA       TO DFH-AREA-COMUN                                                                                                   
           MOVE SPACES            TO W-MENSAJE                                                                                                        
                                                                                                                                                      
           IF DFH-MODO NOT = SPACES                                                                                                                   
              GO TO VUELVE-DETALLE.                                                                                                                   
                                                                                                                                                      
           MOVE CT-NO             TO DFH-ERASE                                                                                                        
                                                                                                                                                      
           EXEC CICS HANDLE AID                                                                                                                       
                     PF1      (COMIENZO)                                                                                                              
                     PF2      (ACTIVAR)                                                                                                               
                     PF4      (REVOCAR)                                                                                                               
                     PF5      (IMPRIMIR)                                                                                                              
                     PF6      (BUSCAR)                                                                                                                
                     PF7      (RETROCEDE)                                                                                                             
                     PF8      (AVANZA)                                                                                                                
                     PF9      (INGRESAR)                                                                                                              
                     PF10     (SALIR)                                                                                                                 
                     PF11     (DETALLES)                                                                                                              
                     ENTER    (VALIDAR)                                                                                                               
                     CLEAR    (TECLA-CLEAR)                                                                                                           
                     ANYKEY   (TECLA-INCORRECTA)                                                                                                      
                     END-EXEC                                                                                                                         
      *                                                                                                                                               
           EXEC CICS RECEIVE MAP ('CDSM680') END-EXEC.                                                                                                
                                                                                                                                                      
       COMIENZO.                                                                                                                                      
      *---------                                                                                                                                      
           MOVE LOW-VALUES      TO CDSM680O                                                                                                           
           MOVE LOW-VALUES      TO CDSM680I                                                                                                           
           PERFORM LIMPIA-TODO                                                                                                                        
           MOVE SPACES          TO NUMEROO  FECSOLO  TPOCTAO  CUENTAO                                                                                 
                                   NUMRUT1O DIGRUT1O NUMRUT2O DIGRUT2O                                                                                
                                   DFH-ERROR DFH-TIP-CTA-AHO                                                                                          
           MOVE ZEROES          TO DFH-REVOCA                                                                                                         
                                   DFH-ACTIVA                                                                                                         
                                   DFH-GRABAR                                                                                                         
                                   DFH-SALIR                                                                                                          
                                   DFH-IMPRIM                                                                                                         
                                   DFH-CORUNO                                                                                                         
                                   DFH-ULTCOR                                                                                                         
                                                                                                                                                      
           MOVE TCTUA-OFICINA   TO DFH-OFIUSR                                                                                                         
                                                                                                                                                      
           MOVE GL-INGRESO      TO W-MENSAJE                                                                                                          
           MOVE CT-N            TO TCTUA-CTA-CANCELADA                                                                                                
                                   TCTUA-CTA-NOVISTA                                                                                                  
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       VUELVE-DETALLE.                                                                                                                                
      *---------------                                                                                                                                
           MOVE CT-SI            TO DFH-ERASE                                                                                                         
                                                                                                                                                      
           IF (DFH-NUMERO    = SPACES) AND                                                                                                            
              (DFH-FECSOL-ED = SPACES) AND                                                                                                            
              (DFH-TPOCTA    = SPACES) AND                                                                                                            
              (DFH-CUENTA    = SPACES) AND                                                                                                            
              (DFH-RUT1      = SPACES)                                                                                                                
               MOVE SPACES       TO DFH-AREA-COMUN                                                                                                    
               MOVE CT-CDSE680   TO DFH-PGM-ORG                                                                                                       
               GO TO COMIENZO.                                                                                                                        
                                                                                                                                                      
           MOVE LOW-VALUES       TO CDSM680O                                                                                                          
           MOVE LOW-VALUES       TO CDSM680I                                                                                                          
           MOVE SPACES           TO DFH-MODO                                                                                                          
           MOVE ZEROES           TO DFH-REVOCA  DFH-ACTIVA  DFH-GRABAR                                                                                
                                    DFH-SALIR   DFH-IMPRIM  DFH-CORUNO                                                                                
                                    DFH-ULTCOR                                                                                                        
                                                                                                                                                      
           MOVE DFH-NUMERO       TO NUMEROO                                                                                                           
           MOVE DFH-TPOCTA       TO TPOCTAO                                                                                                           
EMI02      IF DFH-TPOCTA = CT-CRUT                                                                                                                    
EMI02         MOVE DFH-NUMRUT1   TO CUENTAO                                                                                                           
EMI02      ELSE                                                                                                                                       
              MOVE DFH-CUENTA    TO CUENTAO                                                                                                           
EMI02      END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE DFH-NUMRUT1      TO NUMRUT1O                                                                                                          
           MOVE DFH-DIGRUT1      TO DIGRUT1O                                                                                                          
                                                                                                                                                      
           MOVE DFH-NUMRUT2      TO NUMRUT2O                                                                                                          
           MOVE DFH-DIGRUT2      TO DIGRUT2O                                                                                                          
                                                                                                                                                      
           MOVE SPACE            TO DFH-ERROR                                                                                                         
                                    W-VALOR-ERROR                                                                                                     
                                    W-VALOR-CAMBIO                                                                                                    
                                                                                                                                                      
           PERFORM COMPLETA-ENCABEZADO                                                                                                                
                                                                                                                                                      
           IF DFH-NUMERO = SPACES OR ZEROS                                                                                                            
              MOVE GL-ING-SUSP              TO W-MENSAJE                                                                                              
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           PERFORM PRIMERA-PAGINA                                                                                                                     
                                                                                                                                                      
           IF CODESTI = CT-3XX                                                                                                                        
              MOVE GL-MAND-REV              TO W-MENSAJE                                                                                              
           ELSE                                                                                                                                       
              IF CODESTI = CT-2XX                                                                                                                     
                 MOVE GL-MAND-PEND          TO W-MENSAJE                                                                                              
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       REVISA-PANEL.                                                                                                                                  
      *-------------                                                                                                                                  
           MOVE SPACES                 TO W-VALOR-CAMBIO                                                                                              
                                                                                                                                                      
           IF NUMEROI = SPACES OR LOW-VALUES                                                                                                          
              MOVE SPACES              TO NUMEROI                                                                                                     
           ELSE                                                                                                                                       
              IF NUMEROI NOT = DFH-NUMERO                                                                                                             
                 EXEC CICS BIF DEEDIT FIELD(NUMEROI)                                                                                                  
                                      LENGTH(CT-LARGO-11)                                                                                             
                 END-EXEC                                                                                                                             
                 MOVE CT-1X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF TPOCTAI = SPACES OR LOW-VALUES                                                                                                          
              MOVE SPACES              TO TPOCTAI                                                                                                     
           ELSE                                                                                                                                       
              IF TPOCTAI NOT = DFH-TPOCTA                                                                                                             
                 MOVE CT-2X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF CUENTAI = SPACES OR LOW-VALUES                                                                                                          
              MOVE SPACES              TO CUENTAI                                                                                                     
           ELSE                                                                                                                                       
              IF (CUENTAI NOT = DFH-CUENTA AND                                                                                                        
EMI02             TPOCTAI NOT = CT-CRUT) OR                                                                                                           
EMI02            (CUENTAI(CT-1:CT-9) NOT = DFH-NUMRUT1 AND                                                                                            
EMI02             TPOCTAI     = CT-CRUT)                                                                                                              
                 MOVE CT-3X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF NUMRUT1I = SPACES OR LOW-VALUES                                                                                                         
              MOVE SPACES              TO NUMRUT1I                                                                                                    
           ELSE                                                                                                                                       
              IF NUMRUT1I NOT = DFH-NUMRUT1                                                                                                           
                 EXEC CICS BIF DEEDIT FIELD(NUMRUT1I)                                                                                                 
                                      LENGTH(CT-LARGO-9)                                                                                              
                 END-EXEC                                                                                                                             
                 MOVE CT-4X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DIGRUT1I = SPACES OR LOW-VALUES                                                                                                         
              MOVE SPACE  TO DIGRUT1I                                                                                                                 
           ELSE                                                                                                                                       
              IF DIGRUT1I NOT = DFH-DIGRUT1                                                                                                           
                 MOVE CT-5X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF FECSOLI = SPACES OR LOW-VALUES                                                                                                          
              MOVE SPACES              TO FECSOLI                                                                                                     
           ELSE                                                                                                                                       
              IF FECSOLI NOT = DFH-FECSOL-ED                                                                                                          
                 MOVE CT-6X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF NUMRUT2I = SPACES OR LOW-VALUES                                                                                                         
              MOVE SPACES TO NUMRUT2I                                                                                                                 
           ELSE                                                                                                                                       
              IF NUMRUT2I NOT = DFH-NUMRUT2                                                                                                           
                 EXEC CICS BIF DEEDIT FIELD(NUMRUT2I)                                                                                                 
                                     LENGTH(CT-LARGO-9)                                                                                               
                 END-EXEC                                                                                                                             
                 MOVE CT-7X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DIGRUT2I = SPACES OR LOW-VALUES                                                                                                         
              MOVE SPACES              TO DIGRUT2I                                                                                                    
           ELSE                                                                                                                                       
              IF DIGRUT2I NOT = DFH-DIGRUT2                                                                                                           
                 MOVE CT-8X            TO W-VALOR-CAMBIO                                                                                              
                 GO TO FIN-REVISA-PANEL                                                                                                               
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-REVISA-PANEL. EXIT.                                                                                                                        
                                                                                                                                                      
       ACTIVAR.                                                                                                                                       
      *-------                                                                                                                                        
           MOVE ZEROES    TO DFH-GRABAR DFH-IMPRIM DFH-REVOCA DFH-SALIR                                                                               
           MOVE SPACES    TO W-MENSAJE                                                                                                                
           MOVE DFH-ERROR TO W-VALOR-ERROR                                                                                                            
                                                                                                                                                      
           IF CODESTI = CT-1XX                                                                                                                        
              MOVE GL-MAND-ACT1        TO W-MENSAJE                                                                                                   
              MOVE ZEROES              TO DFH-ACTIVA                                                                                                  
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF CODESTI = CT-3XX                                                                                                                        
              MOVE GL-MAND-REV-NOACT   TO W-MENSAJE                                                                                                   
              MOVE ZEROES              TO DFH-ACTIVA                                                                                                  
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
                                                                                                                                                      
           PERFORM REVISA-CAMBIOS THRU FIN-REVISA-CAMBIOS                                                                                             
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              MOVE ZEROES              TO DFH-ACTIVA                                                                                                  
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF NOT SIN-CAMBIO                                                                                                                          
              MOVE ZEROES              TO DFH-ACTIVA                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
EMI        IF DFH-TPOCTA = CT-TCR                                                                                                                     
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-CARGO            TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA                                                                                                                       
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-ACTIVA NOT > ZEROES                                                                                                                 
              MOVE CT-1                TO DFH-ACTIVA                                                                                                  
              MOVE GL-CONF-ACT         TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE ZEROES                 TO DFH-ACTIVA                                                                                                  
                                                                                                                                                      
           EXEC CICS ASKTIME ABSTIME (W-A1) END-EXEC                                                                                                  
           EXEC CICS FORMATTIME ABSTIME (W-A1)                                                                                                        
                                YYYYMMDD(W-FECHA-AMD)                                                                                                 
                                END-EXEC                                                                                                              
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-OPE                                                                                                  
           MOVE DFH-NUMERO             TO RQ-OPE-OPE                                                                                                  
           MOVE CT-RDUKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-INC-MAND         TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE CT-1XX                 TO OPE-COD-STAT                                                                                                
           MOVE W-F-AMD                TO OPE-FEC-FROP                                                                                                
                                                                                                                                                      
           MOVE CT-UPDAT               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
           IF RQ-RET-OPE NOT = SPACES                                                                                                                 
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-ERR-ACT-MAND     TO W-MENSAJE                                                                                                   
              MOVE CT-RELES            TO RQ-COM-OPE                                                                                                  
              PERFORM ACCESA-OPE                                                                                                                      
           ELSE                                                                                                                                       
              MOVE CT-1XX              TO CODESTO DFH-CODEST                                                                                          
              MOVE CT-VIGENTE          TO GLOESTO                                                                                                     
              MOVE GL-MAND-ACT2        TO W-MENSAJE                                                                                                   
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE W-ANO-AMD              TO W-ANO-ED                                                                                                    
           MOVE W-MES-AMD              TO W-MES-ED                                                                                                    
           MOVE W-DIA-AMD              TO W-DIA-ED                                                                                                    
           MOVE W-FECHA-ED             TO FECESTO                                                                                                     
                                                                                                                                                      
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       REVOCAR.                                                                                                                                       
      *-------                                                                                                                                        
           MOVE ZEROES    TO DFH-GRABAR DFH-IMPRIM                                                                                                    
                             DFH-ACTIVA DFH-SALIR                                                                                                     
           MOVE SPACES    TO W-MENSAJE                                                                                                                
           MOVE DFH-ERROR TO W-VALOR-ERROR                                                                                                            
                                                                                                                                                      
           PERFORM REVISA-CAMBIOS THRU FIN-REVISA-CAMBIOS                                                                                             
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              MOVE ZEROES              TO DFH-REVOCA                                                                                                  
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF NOT SIN-CAMBIO                                                                                                                          
              MOVE ZEROES              TO DFH-REVOCA                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF CODESTI = CT-3XX                                                                                                                        
              MOVE GL-MAND-ELIM        TO W-MENSAJE                                                                                                   
              MOVE ZEROES              TO DFH-REVOCA                                                                                                  
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
                                                                                                                                                      
SLB01      IF DFH-REVOCA NOT > ZEROES                                                                                                                 
              MOVE CT-1                TO DFH-REVOCA                                                                                                  
              MOVE GL-CONF-REVOC       TO W-GLO-UNO                                                                                                   
              IF DFH-TASESP = CT-S                                                                                                                    
                 MOVE DFH-TASCTA       TO  W-NUM-ESP                                                                                                  
                 MOVE DFH-DIVESP       TO  W-MTO-ESP                                                                                                  
                 MOVE W-MENSAJE-ESP    TO  W-MENSAJE                                                                                                  
              END-IF                                                                                                                                  
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE ZEROES                 TO DFH-REVOCA                                                                                                  
                                                                                                                                                      
           EXEC CICS ASKTIME ABSTIME (W-A1) END-EXEC                                                                                                  
           EXEC CICS FORMATTIME ABSTIME (W-A1)                                                                                                        
                                YYYYMMDD(W-FECHA-AMD)                                                                                                 
                                END-EXEC                                                                                                              
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-OPE                                                                                                  
           MOVE DFH-NUMERO             TO RQ-OPE-OPE                                                                                                  
           MOVE CT-RDUKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-MAND-NO-RELAC    TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-DET                                                                                                  
           MOVE DFH-NUMERO             TO RQ-OPE-DET                                                                                                  
           MOVE ZEROES                 TO RQ-COR-DET                                                                                                  
           MOVE CT-RDUKG               TO RQ-COM-DET                                                                                                  
           MOVE SPACES                 TO RQ-RET-DET                                                                                                  
           PERFORM ACCESA-DET                                                                                                                         
           PERFORM BLOQUEA-DETALLE UNTIL RQ-RET-DET NOT = SPACES                                                                                      
           MOVE CT-RELES               TO RQ-COM-DET                                                                                                  
           PERFORM ACCESA-DET                                                                                                                         
           IF WS-SW-SNELI-OK                                                                                                                          
              PERFORM PRIMERA-PAGINA                                                                                                                  
              MOVE GL-MAND-NO-ELIM     TO W-MENSAJE                                                                                                   
              MOVE ZEROES              TO DFH-REVOCA                                                                                                  
              MOVE CT-RELES            TO RQ-COM-OPE                                                                                                  
              PERFORM ACCESA-OPE                                                                                                                      
              GO TO ENVIAR-MAPA                                                                                                                       
           END-IF.                                                                                                                                    
                                                                                                                                                      
              MOVE CT-3XX              TO OPE-COD-STAT                                                                                                
              MOVE W-F-AMD             TO OPE-FEC-FROP                                                                                                
              MOVE SPACES              TO W-RCO01                                                                                                     
              MOVE CT-MDT              TO W-PRO-RCO01                                                                                                 
              MOVE DFH-NUMERO          TO W-OPE-RCO01                                                                                                 
              MOVE ZEROS               TO W-RUT-RCO01                                                                                                 
              MOVE W-RCO01             TO RQ-KEY-VAL-RCO                                                                                              
              MOVE CT-RCO01            TO RQ-KEY-RCO                                                                                                  
              MOVE CT-RDUKG            TO RQ-COM-RCO                                                                                                  
              PERFORM LEE-RCO                                                                                                                         
              PERFORM XXX-ACTUALIZA-RCO                                                                                                               
                UNTIL RCO-NUM-OPE NOT = W-OPE-RCO01                                                                                                   
                   OR RQ-RET-RCO      = CT-14X                                                                                                        
              MOVE CT-RELES            TO RQ-COM-RCO                                                                                                  
              PERFORM LEE-RCO                                                                                                                         
                                                                                                                                                      
           MOVE CT-UPDAT               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
           IF RQ-RET-OPE NOT = SPACES                                                                                                                 
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-ERR-ACT-MAND     TO W-MENSAJE                                                                                                   
              MOVE CT-RELES            TO RQ-COM-OPE                                                                                                  
              PERFORM ACCESA-OPE                                                                                                                      
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           PERFORM PRIMERA-PAGINA                                                                                                                     
                                                                                                                                                      
              MOVE CT-3XX              TO CODESTO DFH-CODEST                                                                                          
              MOVE CT-ELIMINADO        TO GLOESTO                                                                                                     
              MOVE GL-MAND-REVOC       TO W-MENSAJE                                                                                                   
                                                                                                                                                      
           MOVE W-F-AMD                TO DFH-FECEST                                                                                                  
           MOVE W-ANO-AMD              TO W-ANO-ED                                                                                                    
           MOVE W-MES-AMD              TO W-MES-ED                                                                                                    
           MOVE W-DIA-AMD              TO W-DIA-ED                                                                                                    
           MOVE W-FECHA-ED             TO FECESTO                                                                                                     
                                                                                                                                                      
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       BLOQUEA-DETALLE.                                                                                                                               
      *----------------                                                                                                                               
           MOVE ZEROES                      TO WS-SW-SALTA                                                                                            
EMI        IF DET-TIP-SER = CT-CVN                                                                                                                    
              MOVE CT-CVN-SN-ELI            TO RQ-COD-TBL                                                                                             
              MOVE OPE-NUM-CVS(CT-2:CT-10)  TO RQ-VAL-TBL                                                                                             
              MOVE CT-REDKY                 TO RQ-COM-TBL                                                                                             
              PERFORM LEE-TBL                                                                                                                         
              IF RQ-RET-TBL = SPACES                                                                                                                  
                 MOVE CT-1                  TO WS-SW-SNELI                                                                                            
                                               WS-SW-SALTA                                                                                            
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF WS-SW-SALTA-OK                                                                                                                          
              MOVE CT-RELES                 TO RQ-COM-DET                                                                                             
              PERFORM ACCESA-DET                                                                                                                      
           ELSE                                                                                                                                       
                 MOVE CT-CANCE              TO DET-COD-EST                                                                                            
                                                                                                                                                      
EMI           IF DET-TIP-SER = CT-CVN                                                                                                                 
                 MOVE PRD-COD-CVS           TO RQ-PRO-CVS                                                                                             
                 MOVE OPE-NUM-CVS           TO RQ-CVN-CVS                                                                                             
                 PERFORM LEE-CVS                                                                                                                      
                 IF RQ-RET = SPACES AND CVS-TIP-CVN(CT-1:CT-2) = CT-SG                                                                                
                    MOVE CT-CANCE           TO DET-COD-EST                                                                                            
                    IF CVS-TIP-CVN = CT-SGAHO                                                                                                         
                       PERFORM GRABA-AHOMSGRT                                                                                                         
                    END-IF                                                                                                                            
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
                                                                                                                                                      
              MOVE W-F-AMD                  TO DET-FEC-ING-EST                                                                                        
              MOVE CT-UPDAT                 TO RQ-COM-DET                                                                                             
              PERFORM GRABA-LOG                                                                                                                       
              PERFORM ACCESA-DET                                                                                                                      
           END-IF.                                                                                                                                    
           IF RQ-RET-DET = SPACES                                                                                                                     
              MOVE CT-RDUNX                 TO RQ-COM-DET                                                                                             
              PERFORM ACCESA-DET                                                                                                                      
           ELSE                                                                                                                                       
              MOVE CT-1X                    TO W-VALOR-ERROR                                                                                          
              MOVE GL-ERR-ACT-DET           TO W-MENSAJE                                                                                              
              MOVE CT-RELES                 TO RQ-COM-DET                                                                                             
              PERFORM ACCESA-DET                                                                                                                      
              MOVE CT-14X                   TO RQ-RET-DET                                                                                             
           END-IF.                                                                                                                                    
                                                                                                                                                      
       GRABA-LOG.                                                                                                                                     
      *--------------                                                                                                                                 
      *    BUSCA CORRELATIVO EVENTO                                                                                                                   
           EXEC CICS ADDRESS TCTUA (ADDRESS OF TCTUA-AREA) END-EXEC.                                                                                  
           EXEC CICS ASKTIME ABSTIME (W-A1) END-EXEC                                                                                                  
           EXEC CICS FORMATTIME ABSTIME (W-A1)                                                                                                        
                                YYYYMMDD(W-F1)                                                                                                        
                                TIME    (W-H1)                                                                                                        
                                END-EXEC.                                                                                                             
                                                                                                                                                      
           MOVE SPACES                 TO RQ-KEY-VAL-NEG                                                                                              
EMI        MOVE CT-MODPAC              TO RQ-EVT-COD-NEG                                                                                              
           MOVE W-F1-AMD               TO RQ-FEC-MVT-NEG                                                                                              
           MOVE CT-REDKG               TO RQ-COM-NEG                                                                                                  
           PERFORM ACCESA-NEG.                                                                                                                        
                                                                                                                                                      
           IF RQ-RET-NEG = CT-14X                                                                                                                     
              MOVE ZEROES              TO WS-CRV-EVT                                                                                                  
           ELSE                                                                                                                                       
              MOVE CT-REDNX            TO RQ-COM-NEG                                                                                                  
              PERFORM UNTIL                                                                                                                           
EMI             ( CT-MODPAC   NOT = EVT-COD     OF E-NEG-01   AND                                                                                     
                  W-F1-AMD    NOT = NEG-MVT-FEC OF E-NEG-01 ) OR                                                                                      
                  RQ-RET-NEG  NOT = SPACES                                                                                                            
                MOVE MVT-CRV-EVT OF E-NEG-01     TO WS-CRV-EVT                                                                                        
                PERFORM ACCESA-NEG                                                                                                                    
              END-PERFORM                                                                                                                             
           END-IF                                                                                                                                     
           ADD  CT-1                   TO WS-CRV-EVT                                                                                                  
           MOVE W-F1-AMD               TO NEG-MVT-FEC OF E-NEG-01                                                                                     
EMI        MOVE CT-MODPAC              TO EVT-COD     OF E-NEG-01                                                                                     
           MOVE WS-CRV-EVT             TO MVT-CRV-EVT OF E-NEG-01                                                                                     
           MOVE ZEROES                 TO CLI-RUT     OF E-NEG-01                                                                                     
           MOVE PRD-COD OF E-MDT-DET-01   TO PRD-COD OF E-NEG-01                                                                                      
           MOVE OPE-NUM OF E-MDT-DET-01   TO OPE-NUM OF E-NEG-01                                                                                      
           MOVE TCTUA-OFICINA          TO OFI-COD OF E-NEG-01                                                                                         
           MOVE W-H1-HMS               TO NEG-HOR-EVT                                                                                                 
           MOVE DET-TIP-SER            TO SUB-PRD-COD                                                                                                 
           MOVE CT-CDS                 TO APC-COD                                                                                                     
           MOVE TCTUA-RUT-USERID       TO USR-RUT-NRT                                                                                                 
           MOVE SPACES                 TO TRM-ID                                                                                                      
           MOVE CT-ADDIT               TO RQ-COM-NEG                                                                                                  
           PERFORM ACCESA-NEG                                                                                                                         
           MOVE W-F1-AMD               TO NEG-MVT-FEC OF E-DTO-01                                                                                     
EMI        MOVE CT-MODPAC              TO EVT-COD OF E-DTO-01                                                                                         
           MOVE WS-CRV-EVT             TO MVT-CRV-EVT OF E-DTO-01                                                                                     
           MOVE SPACES                 TO DTO-COD                                                                                                     
           MOVE E-MDT-DET-01           TO DTO-DES                                                                                                     
           MOVE CT-ADDIT               TO RQ-COM-DTO                                                                                                  
           PERFORM ACCESA-DTO.                                                                                                                        
                                                                                                                                                      
       ACCESA-NEG.                                                                                                                                    
      *-----------                                                                                                                                    
           MOVE SPACES                 TO RQ-RET-NEG                                                                                                  
           MOVE CT-NEG01               TO W-ELM-NAME                                                                                                  
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                           RQ-AREA-NEG                                                                                                                
                           E-NEG-01                                                                                                                   
                           W-ELEMENT-LIST                                                                                                             
                                                                                                                                                      
           IF RQ-RET-NEG NOT = SPACES AND NOT = CT-14X                                                                                                
              MOVE CT-B                TO W-VALOR-ERROR                                                                                               
              MOVE RQ-DBI-NEG          TO ERROR-BASE                                                                                                  
              MOVE RQ-FIL-NEG          TO ERROR-TABLA                                                                                                 
              MOVE RQ-RET-NEG          TO ERROR-RET                                                                                                   
              MOVE W-MSJ-ERROR         TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA                                                                                                                       
           END-IF.                                                                                                                                    
                                                                                                                                                      
       ACCESA-DTO.                                                                                                                                    
      *-----------                                                                                                                                    
           MOVE SPACES                 TO RQ-RET-DTO                                                                                                  
           MOVE CT-DTO01               TO W-ELM-NAME                                                                                                  
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-DTO                                                                                                                 
                          E-DTO-01                                                                                                                    
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-DTO NOT = SPACES AND NOT = CT-14X                                                                                                
              MOVE CT-B                TO W-VALOR-ERROR                                                                                               
              MOVE RQ-DBI-DTO          TO ERROR-BASE                                                                                                  
              MOVE RQ-FIL-DTO          TO ERROR-TABLA                                                                                                 
              MOVE RQ-RET-DTO          TO ERROR-RET                                                                                                   
              MOVE W-MSJ-ERROR         TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA                                                                                                                       
           END-IF.                                                                                                                                    
                                                                                                                                                      
       REVISA-CAMBIOS.                                                                                                                                
      *---------------                                                                                                                                
           PERFORM REVISA-PANEL THRU FIN-REVISA-PANEL                                                                                                 
                                                                                                                                                      
                                                                                                                                                      
           IF SIN-CAMBIO                                                                                                                              
              GO TO FIN-REVISA-CAMBIOS.                                                                                                               
                                                                                                                                                      
           MOVE CT-N              TO TCTUA-CTA-CANCELADA                                                                                              
                                     TCTUA-CTA-NOVISTA                                                                                                
           MOVE ZEROES            TO DFH-REVOCA DFH-GRABAR DFH-IMPRIM                                                                                 
                                     DFH-ACTIVA DFH-SALIR                                                                                             
                                                                                                                                                      
           IF CAMBIO-NUMERO                                                                                                                           
              PERFORM POR-NUMERO THRU FIN-POR-NUMERO                                                                                                  
              PERFORM COMPLETA-ENCABEZADO                                                                                                             
              IF SIN-ERROR                                                                                                                            
                 PERFORM PRIMERA-PAGINA                                                                                                               
              END-IF                                                                                                                                  
              GO TO FIN-REVISA-CAMBIOS                                                                                                                
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF CAMBIO-TPOCTA OR CAMBIO-CUENTA                                                                                                          
EMI02<        IF TPOCTAI = CT-CTV                                                                                                                     
                 MOVE SPACES      TO COM-RUT                                                                                                          
                 MOVE CUENTAI     TO COM-CTA                                                                                                          
                 PERFORM LLAMA-CTARUT                                                                                                                 
                 IF COM-RET = ZEROES                                                                                                                  
                    MOVE CT-CRUT TO TPOCTAI                                                                                                           
                 END-IF                                                                                                                               
EMI02>        END-IF                                                                                                                                  
EMI02         IF TPOCTAI = CT-CRUT                                                                                                                    
EMI02            PERFORM POR-CTARUT THRU FIN-POR-CTARUT                                                                                               
EMI02         ELSE                                                                                                                                    
                 PERFORM POR-CUENTA THRU FIN-POR-CUENTA                                                                                               
EMI02         END-IF                                                                                                                                  
              PERFORM COMPLETA-ENCABEZADO                                                                                                             
              IF SIN-ERROR                                                                                                                            
                 PERFORM PRIMERA-PAGINA                                                                                                               
              END-IF                                                                                                                                  
              GO TO FIN-REVISA-CAMBIOS                                                                                                                
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF CAMBIO-NUMRUT1 OR CAMBIO-DIGRUT1                                                                                                        
              PERFORM POR-RUT THRU FIN-POR-RUT                                                                                                        
              PERFORM COMPLETA-ENCABEZADO                                                                                                             
              IF SIN-ERROR                                                                                                                            
                 PERFORM PRIMERA-PAGINA                                                                                                               
              END-IF                                                                                                                                  
              GO TO FIN-REVISA-CAMBIOS                                                                                                                
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE DFH-FECSOL-ED TO FECSOLO                                                                                                              
           MOVE DFH-NUMRUT2   TO NUMRUT2O                                                                                                             
           MOVE DFH-DIGRUT2   TO DIGRUT2O.                                                                                                            
                                                                                                                                                      
       FIN-REVISA-CAMBIOS. EXIT.                                                                                                                      
                                                                                                                                                      
       BUSCAR.                                                                                                                                        
      *-------                                                                                                                                        
           MOVE ZEROES    TO DFH-REVOCA DFH-GRABAR DFH-IMPRIM                                                                                         
                             DFH-ACTIVA DFH-SALIR                                                                                                     
           MOVE SPACES    TO W-MENSAJE                                                                                                                
           MOVE DFH-ERROR TO W-VALOR-ERROR                                                                                                            
                                                                                                                                                      
           PERFORM REVISA-CAMBIOS THRU FIN-REVISA-CAMBIOS                                                                                             
                                                                                                                                                      
           IF TCTUA-CTA-CANCELADA = CT-S                                                                                                              
              MOVE GL-CLI-CTA-CANCEL   TO W-MENSAJE.                                                                                                  
                                                                                                                                                      
           IF TCTUA-CTA-NOVISTA   = CT-S                                                                                                              
              MOVE GL-CTA-SOLO-VISTA   TO W-MENSAJE.                                                                                                  
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF NOT SIN-CAMBIO                                                                                                                          
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           EXEC CICS BIF DEEDIT FIELD(DFH-NUMERO)                                                                                                     
                                LENGTH(CT-LARGO-11)                                                                                                   
           END-EXEC                                                                                                                                   
           MOVE DFH-NUMERO     TO W-NUMERO                                                                                                            
           ADD  CT-1           TO W-NUMERO                                                                                                            
                                                                                                                                                      
           MOVE DFH-NUMRUT1    TO W-RUT-RCO00                                                                                                         
           MOVE CT-MDT         TO W-PRO-RCO00                                                                                                         
           MOVE W-NUMERO       TO W-OPE-RCO00                                                                                                         
           MOVE W-RCO00        TO RQ-KEY-VAL-RCO                                                                                                      
           MOVE CT-RCO00       TO RQ-KEY-RCO                                                                                                          
           MOVE CT-REDKG       TO RQ-COM-RCO                                                                                                          
           PERFORM LEE-RCO                                                                                                                            
                                                                                                                                                      
           IF (RQ-RET-RCO = CT-14X) OR                                                                                                                
              (RCO-NRT-CLI NOT = DFH-NUMRUT1) OR                                                                                                      
EMI           (RCO-COD-OPE NOT = CT-MDT )                                                                                                             
              MOVE GL-CLI-NO-MAND      TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE RCO-NUM-OPE    TO W-OPERACION                                                                                                         
           MOVE W-NUM-11       TO NUMEROI                                                                                                             
           EXEC CICS BIF DEEDIT FIELD(NUMEROI)                                                                                                        
                                LENGTH(CT-LARGO-11)                                                                                                   
           END-EXEC                                                                                                                                   
           PERFORM POR-NUMERO THRU FIN-POR-NUMERO                                                                                                     
           PERFORM COMPLETA-ENCABEZADO                                                                                                                
           IF SIN-ERROR                                                                                                                               
              PERFORM PRIMERA-PAGINA                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
                                                                                                                                                      
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       LIMPIA-TODO.                                                                                                                                   
      *------------                                                                                                                                   
           MOVE SPACES TO GTPOCTAO NOMBRE1O NOMBRE2O FECESTO                                                                                          
                          CODEJCO  NOMEJCO  CODESTO  GLOESTO                                                                                          
                          CODSUCO  NOMSUCO  CODMONO  GLOMONO                                                                                          
                                                                                                                                                      
           MOVE SPACES TO DFH-NUMERO DFH-FECSOL DFH-FECSOL-ED                                                                                         
                          DFH-TPOCTA DFH-CUENTA DFH-RUT1                                                                                              
                          DFH-RUT2   DFH-CODEJC DFH-CODEST                                                                                            
                          DFH-OFICTA DFH-MONCTA DFH-FECEST                                                                                            
                                                                                                                                                      
           MOVE SPACES TO LINEA(CT-1) LINEA(CT-2) LINEA(CT-3)                                                                                         
           MOVE SPACES TO LINEA(CT-4) LINEA(CT-5) LINEA(CT-6).                                                                                        
                                                                                                                                                      
       POR-NUMERO.                                                                                                                                    
      *-----------                                                                                                                                    
           PERFORM LIMPIA-TODO                                                                                                                        
           MOVE SPACES        TO W-VALOR-ERROR                                                                                                        
           MOVE NUMEROI       TO DFH-NUMERO                                                                                                           
           MOVE SPACES        TO TPOCTAO  CUENTAO  NUMRUT1O DIGRUT1O                                                                                  
                                 NUMRUT2O DIGRUT2O FECSOLO                                                                                            
                                                                                                                                                      
           MOVE CT-MDT        TO RQ-PRO-OPE                                                                                                           
           MOVE DFH-NUMERO    TO RQ-OPE-OPE                                                                                                           
           MOVE CT-REDKY      TO RQ-COM-OPE                                                                                                           
           PERFORM ACCESA-OPE                                                                                                                         
                                                                                                                                                      
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE GL-MAND-NO-EXI      TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-NUMERO.                                                                                                                   
                                                                                                                                                      
           MOVE OPE-COD-STAT  TO DFH-CODEST                                                                                                           
           MOVE OPE-FEC-FTOP  TO DFH-FECSOL                                                                                                           
           MOVE OPE-FEC-FROP  TO DFH-FECEST                                                                                                           
                                                                                                                                                      
           MOVE CT-MDT        TO W-PRO-RCO01                                                                                                          
           MOVE DFH-NUMERO    TO W-OPE-RCO01                                                                                                          
           MOVE ZEROS         TO W-RUT-RCO01                                                                                                          
           MOVE W-RCO01       TO RQ-KEY-VAL-RCO                                                                                                       
           MOVE CT-RCO01      TO RQ-KEY-RCO                                                                                                           
           MOVE CT-REDKG      TO RQ-COM-RCO                                                                                                           
                                                                                                                                                      
           MOVE CT-NO         TO W-EXISTE                                                                                                             
           MOVE CT-NO         TO W-ERROR                                                                                                              
           MOVE W-OPE-RCO01   TO W-OPERACION                                                                                                          
           PERFORM BUSCA-CLI-REL THRU FIN-BUSCA-CLI-REL                                                                                               
             UNTIL W-EXISTE   = CT-SI                                                                                                                 
                OR W-ERROR    = CT-SI                                                                                                                 
                OR RQ-RET-RCO = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF W-ERROR = CT-SI                                                                                                                         
              MOVE GL-MAND-MAS-1TIT    TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-NUMERO.                                                                                                                   
                                                                                                                                                      
           IF W-EXISTE = CT-NO                                                                                                                        
              MOVE GL-MAND-SIN-CLI     TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-NUMERO.                                                                                                                   
                                                                                                                                                      
           MOVE CT-MDT-TIP-CTA-CAR     TO RQ-COD-TBL                                                                                                  
           MOVE SPACES                 TO RQ-VAL-TBL                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-TBL                                                                                                  
           MOVE CT-NO                  TO W-EXISTE                                                                                                    
           MOVE SPACES                 TO W-OPERACION                                                                                                 
           MOVE DFH-NUMERO             TO W-NUM-11                                                                                                    
                                                                                                                                                      
           PERFORM BUSCA-OPE-REL THRU FIN-BUSCA-OPE-REL                                                                                               
             UNTIL W-EXISTE = CT-SI                                                                                                                   
                OR RQ-RET-TBL = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF W-EXISTE = CT-NO                                                                                                                        
              MOVE GL-MAND-SIN-OPE     TO W-MENSAJE                                                                                                   
              MOVE CT-1                TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-NUMERO.                                                                                                                   
                                                                                                                                                      
           MOVE SPACES                 TO DFH-TIP-CTA-AHO                                                                                             
EMI        IF DFH-TPOCTA = CT-AHO                                                                                                                     
              MOVE DFH-CUENTA TO RQ-KEY-VAL-OPA                                                                                                       
              PERFORM ACCESA-OPA                                                                                                                      
              IF RQ-RET-OPA = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI         TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-NUMERO                                                                                                                 
              END-IF                                                                                                                                  
              IF OPA-FEC-CRR NOT = ZEROES                                                                                                             
                 MOVE GL-CTA-NO-VIG         TO W-MENSAJE                                                                                              
                 MOVE CT-S                  TO TCTUA-CTA-CANCELADA                                                                                    
              END-IF                                                                                                                                  
              MOVE SPR-COD OF E-AHR-OPE-01  TO WS-SW-CTA-AHO                                                                                          
              IF WS-SW-CTA-AHO-OK                                                                                                                     
                 MOVE WS-SW-CTA-AHO         TO DFH-TIP-CTA-AHO                                                                                        
              ELSE                                                                                                                                    
                 MOVE GL-TIP-CTA-NO-VAL     TO W-MENSAJE                                                                                              
                 MOVE CT-S                  TO TCTUA-CTA-NOVISTA                                                                                      
                 GO TO FIN-POR-NUMERO                                                                                                                 
              END-IF                                                                                                                                  
              PERFORM LEER-AHOMTAB                                                                                                                    
              MOVE CT-999X                  TO DFH-MONCTA                                                                                             
           ELSE                                                                                                                                       
EMI02<        IF DFH-TPOCTA = CT-CTV                                                                                                                  
EMI03            MOVE SPACES                TO COM-RUT                                                                                                
EMI03            MOVE DFH-CUENTA            TO COM-CTA                                                                                                
                 PERFORM LLAMA-CTARUT                                                                                                                 
                 IF COM-RET = ZEROES                                                                                                                  
                    MOVE CT-CRUT            TO DFH-TPOCTA                                                                                             
                 END-IF                                                                                                                               
EMI02>        END-IF                                                                                                                                  
EMI02         IF DFH-TPOCTA = CT-CRUT                                                                                                                 
EMI02            MOVE CT-CTV                TO RQ-PRO-OPE TPOCTAO                                                                                     
EMI02            MOVE DFH-NUMRUT1           TO CUENTAO                                                                                                
EMI02         ELSE                                                                                                                                    
                 MOVE DFH-TPOCTA            TO RQ-PRO-OPE TPOCTAO                                                                                     
                 MOVE DFH-CUENTA            TO CUENTAO                                                                                                
EMI02         END-IF                                                                                                                                  
              MOVE DFH-CUENTA               TO RQ-OPE-OPE                                                                                             
              MOVE CT-REDKY                 TO RQ-COM-OPE                                                                                             
              PERFORM ACCESA-OPE                                                                                                                      
              IF RQ-RET-OPE = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI         TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-NUMERO                                                                                                                 
              END-IF                                                                                                                                  
                                                                                                                                                      
EMI           IF OPE-COD-STAT NOT = CT-VIG AND NOT = CT-1XX                                                                                           
                 MOVE GL-CTA-NO-VIG         TO W-MENSAJE                                                                                              
                 MOVE CT-S                  TO TCTUA-CTA-CANCELADA                                                                                    
              END-IF                                                                                                                                  
                                                                                                                                                      
              IF OPE-MON NOT = ZERO AND NOT = CT-999                                                                                                  
                 MOVE GL-MON-CTA-NO-PES     TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-NUMERO                                                                                                                 
              END-IF                                                                                                                                  
                                                                                                                                                      
              MOVE OPE-COD-OFI TO CODSUCO DFH-OFICTA                                                                                                  
              IF OPE-MON = ZERO                                                                                                                       
                 MOVE CT-999X               TO CODMONO DFH-MONCTA                                                                                     
              ELSE                                                                                                                                    
                 MOVE OPE-MON               TO CODMONO DFH-MONCTA                                                                                     
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-POR-NUMERO. EXIT.                                                                                                                          
                                                                                                                                                      
       BUSCA-CLI-REL.                                                                                                                                 
      *--------------                                                                                                                                 
           PERFORM LEE-RCO                                                                                                                            
                                                                                                                                                      
           IF RQ-RET-RCO = CT-14X                                                                                                                     
              GO TO FIN-BUSCA-CLI-REL.                                                                                                                
                                                                                                                                                      
EMI        IF (RCO-COD-OPE NOT = CT-MDT ) OR                                                                                                          
              (RCO-NUM-OPE NOT = W-OPERACION)                                                                                                         
              IF DFH-RUT1 = SPACES                                                                                                                    
                 MOVE CT-14X           TO RQ-RET-RCO                                                                                                  
              ELSE                                                                                                                                    
                 MOVE CT-SI            TO W-EXISTE                                                                                                    
              END-IF                                                                                                                                  
              GO TO FIN-BUSCA-CLI-REL                                                                                                                 
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF RCO-COD-RCOP = CT-TI1                                                                                                                   
              IF DFH-RUT1 = SPACES                                                                                                                    
                 MOVE RCO-NRT-CLI      TO DFH-NUMRUT1                                                                                                 
                 MOVE RCO-DRT-CLI      TO DFH-DIGRUT1                                                                                                 
              ELSE                                                                                                                                    
                 MOVE CT-SI            TO W-ERROR                                                                                                     
                 GO TO FIN-BUSCA-CLI-REL                                                                                                              
              END-IF                                                                                                                                  
           ELSE                                                                                                                                       
              IF RCO-COD-RCOP = CT-TI2                                                                                                                
                 IF DFH-RUT2 = SPACES                                                                                                                 
                    MOVE RCO-NRT-CLI   TO DFH-NUMRUT2                                                                                                 
                    MOVE RCO-DRT-CLI   TO DFH-DIGRUT2                                                                                                 
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE CT-REDNX               TO RQ-COM-RCO.                                                                                                 
                                                                                                                                                      
       FIN-BUSCA-CLI-REL. EXIT.                                                                                                                       
                                                                                                                                                      
       LEE-RCO.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE SPACES    TO RQ-RET-RCO                                                                                                               
           MOVE CT-RCO01  TO W-ELM-NAME                                                                                                               
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-RCO                                                                                                                 
                          CLI-OPE-REL01                                                                                                               
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-RCO NOT = SPACES AND NOT = CT-14X                                                                                                
              MOVE CT-B        TO W-VALOR-ERROR                                                                                                       
              MOVE RQ-DBI-RCO  TO ERROR-BASE                                                                                                          
              MOVE RQ-FIL-RCO  TO ERROR-TABLA                                                                                                         
              MOVE RQ-RET-RCO  TO ERROR-RET                                                                                                           
              MOVE W-MSJ-ERROR TO W-MENSAJE                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
       ACCESA-OPE.                                                                                                                                    
      *----------                                                                                                                                     
           MOVE SPACES    TO RQ-RET-OPE                                                                                                               
           MOVE CT-OPE01  TO W-ELM-NAME                                                                                                               
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-OPE                                                                                                                 
                          OPE01                                                                                                                       
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-OPE NOT = SPACES AND RQ-RET-OPE NOT = CT-14X                                                                                     
              MOVE CT-B        TO W-VALOR-ERROR                                                                                                       
              MOVE RQ-DBI-OPE  TO ERROR-BASE                                                                                                          
              MOVE RQ-FIL-OPE  TO ERROR-TABLA                                                                                                         
              MOVE RQ-RET-OPE  TO ERROR-RET                                                                                                           
              MOVE W-MSJ-ERROR TO W-MENSAJE                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
       ACCESA-OPA.                                                                                                                                    
      *----------                                                                                                                                     
           MOVE SPACES    TO RQ-RET-OPA                                                                                                               
           MOVE CT-OPA01  TO W-ELM-NAME                                                                                                               
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-OPA                                                                                                                 
                          E-AHR-OPE-01                                                                                                                
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-OPA NOT = SPACES AND RQ-RET-OPA NOT = CT-14X                                                                                     
              MOVE CT-B        TO W-VALOR-ERROR                                                                                                       
              MOVE RQ-DBI-OPA  TO ERROR-BASE                                                                                                          
              MOVE RQ-FIL-OPA  TO ERROR-TABLA                                                                                                         
              MOVE RQ-RET-OPA  TO ERROR-RET                                                                                                           
              MOVE W-MSJ-ERROR TO W-MENSAJE                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
       ACCESA-RCA.                                                                                                                                    
      *----------                                                                                                                                     
           MOVE SPACES    TO RQ-RET-RCA                                                                                                               
           MOVE CT-RCA02  TO W-ELM-NAME                                                                                                               
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-RCA                                                                                                                 
                          E-REL-CLA-02                                                                                                                
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-RCA NOT = SPACES AND RQ-RET-RCA NOT = CT-14X                                                                                     
              MOVE CT-B        TO W-VALOR-ERROR                                                                                                       
              MOVE RQ-DBI-RCA  TO ERROR-BASE                                                                                                          
              MOVE RQ-FIL-RCA  TO ERROR-TABLA                                                                                                         
              MOVE RQ-RET-RCA  TO ERROR-RET                                                                                                           
              MOVE W-MSJ-ERROR TO W-MENSAJE                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
       ACCESA-CLA.                                                                                                                                    
      *----------                                                                                                                                     
           MOVE SPACES    TO RQ-RET-CLA                                                                                                               
           MOVE CT-CLA01  TO W-ELM-NAME                                                                                                               
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-CLA                                                                                                                 
                          E-AHR-CLI-01                                                                                                                
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-CLA NOT = SPACES AND RQ-RET-CLA NOT = CT-14X                                                                                     
              MOVE CT-B        TO W-VALOR-ERROR                                                                                                       
              MOVE RQ-DBI-CLA  TO ERROR-BASE                                                                                                          
              MOVE RQ-FIL-CLA  TO ERROR-TABLA                                                                                                         
              MOVE RQ-RET-CLA  TO ERROR-RET                                                                                                           
              MOVE W-MSJ-ERROR TO W-MENSAJE                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
       BUSCA-OPE-REL.                                                                                                                                 
      *--------------                                                                                                                                 
           PERFORM LEE-TBL                                                                                                                            
           IF RQ-RET-TBL = CT-14X                                                                                                                     
              GO TO FIN-BUSCA-OPE-REL.                                                                                                                
                                                                                                                                                      
           MOVE TBL-VAL-COD            TO W-VAL-COD                                                                                                   
                                                                                                                                                      
           MOVE CT-MDT                 TO W-PRO-UNO-ROP                                                                                               
           MOVE W-OPERACION            TO W-OPE-UNO-ROP                                                                                               
           MOVE W-TPO-CTA              TO W-PRO-DOS-ROP                                                                                               
           MOVE SPACES                 TO W-OPE-DOS-ROP                                                                                               
           MOVE W-ROP00-ROP01          TO RQ-KEY-VAL-ROP                                                                                              
           MOVE CT-ROP00               TO RQ-KEY-ROP                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-ROP                                                                                                  
           MOVE SPACES                 TO RQ-RET-ROP                                                                                                  
                                                                                                                                                      
           PERFORM LEE-ROP                                                                                                                            
           IF RQ-RET-ROP = SPACES                                                                                                                     
              MOVE CT-SI               TO W-EXISTE                                                                                                    
VER           MOVE ROP-COD-REL         TO DFH-TPOCTA                                                                                                  
              MOVE ROP-NUM-REL         TO DFH-CUENTA                                                                                                  
EMI02<        IF DFH-TPOCTA = CT-CTV                                                                                                                  
                 MOVE SPACES           TO COM-RUT                                                                                                     
                 MOVE DFH-CUENTA       TO COM-CTA                                                                                                     
                 PERFORM LLAMA-CTARUT                                                                                                                 
EMI02>        END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE CT-REDNX               TO RQ-COM-TBL.                                                                                                 
                                                                                                                                                      
       FIN-BUSCA-OPE-REL. EXIT.                                                                                                                       
                                                                                                                                                      
       LEE-ROP.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE SPACES    TO RQ-RET-ROP                                                                                                               
           MOVE CT-ROP00  TO W-ELM-NAME                                                                                                               
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-ROP                                                                                                                 
                          OPE-OPE-REL00                                                                                                               
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-ROP NOT = SPACES AND NOT = CT-14X                                                                                                
              MOVE CT-B           TO W-VALOR-ERROR                                                                                                    
              MOVE RQ-DBI-ROP     TO ERROR-BASE                                                                                                       
              MOVE RQ-FIL-ROP     TO ERROR-TABLA                                                                                                      
              MOVE RQ-RET-ROP     TO ERROR-RET                                                                                                        
              MOVE W-MSJ-ERROR    TO W-MENSAJE                                                                                                        
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF RQ-RET-ROP = SPACES                                                                                                                     
              IF RQ-KEY-ROP = CT-ROP00                                                                                                                
                 IF ROP-COD-OPE NOT = W-PRO-UNO-ROP OR                                                                                                
                    ROP-NUM-OPE NOT = W-OPE-UNO-ROP OR                                                                                                
                    ROP-COD-REL NOT = W-PRO-DOS-ROP                                                                                                   
                    MOVE CT-14X   TO RQ-RET-ROP                                                                                                       
                 END-IF                                                                                                                               
              ELSE                                                                                                                                    
                 IF ROP-COD-REL NOT = W-PRO-UNO-ROP OR                                                                                                
                    ROP-NUM-REL NOT = W-OPE-UNO-ROP OR                                                                                                
                    ROP-COD-OPE NOT = W-PRO-DOS-ROP                                                                                                   
                    MOVE CT-14X   TO RQ-RET-ROP                                                                                                       
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       LEE-CLI.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE CT-REDKY     TO RQ-COM                                                                                                                
           MOVE CT-CLI       TO RQ-FIL                                                                                                                
           MOVE CT-CLI01     TO RQ-KEY                                                                                                                
           MOVE CT-118       TO RQ-DBI                                                                                                                
           MOVE SPACES       TO RQ-RET                                                                                                                
           MOVE W-LLAVE-CLI  TO RQ-KEY-VAL                                                                                                            
           MOVE CT-CLI01     TO W-ELM-NAME                                                                                                            
           CALL 'DBNTRY'     USING RQ-UIB                                                                                                             
                             RQ-AREA                                                                                                                  
                             E-CLI-01                                                                                                                 
                             W-ELEMENT-LIST                                                                                                           
                                                                                                                                                      
           IF RQ-RET NOT = SPACES AND NOT = CT-14X                                                                                                    
              MOVE CT-B        TO W-VALOR-ERROR                                                                                                       
              MOVE RQ-DBI      TO ERROR-BASE                                                                                                          
              MOVE RQ-FIL      TO ERROR-TABLA                                                                                                         
              MOVE RQ-RET      TO ERROR-RET                                                                                                           
              MOVE W-MSJ-ERROR TO W-MENSAJE                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
       LEE-TBL.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE SPACES    TO RQ-RET-TBL                                                                                                               
           MOVE CT-TBL01  TO W-ELM-NAME                                                                                                               
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-TBL                                                                                                                 
                          E-TBL-LOC-01                                                                                                                
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-TBL NOT = SPACES AND NOT = CT-14X                                                                                                
              MOVE CT-B        TO W-VALOR-ERROR                                                                                                       
              MOVE RQ-DBI-TBL  TO ERROR-BASE                                                                                                          
              MOVE RQ-FIL-TBL  TO ERROR-TABLA                                                                                                         
              MOVE RQ-RET-TBL  TO ERROR-RET                                                                                                           
              MOVE W-MSJ-ERROR TO W-MENSAJE                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF RQ-RET-TBL = CT-14X                                                                                                                     
              MOVE GL-NO-EXI   TO TBL-DES-COD                                                                                                         
           END-IF.                                                                                                                                    
                                                                                                                                                      
       COMPLETA-ENCABEZADO.                                                                                                                           
      *--------------------                                                                                                                           
           IF DFH-NUMERO NOT = SPACES                                                                                                                 
              MOVE DFH-NUMERO TO NUMEROO                                                                                                              
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-NUMRUT1 NOT = SPACES                                                                                                                
              MOVE DFH-NUMRUT1              TO NUMRUT1O RQ-NUM-CLI                                                                                    
              MOVE DFH-DIGRUT1              TO DIGRUT1O RQ-DIG-CLI                                                                                    
              PERFORM LEE-CLI                                                                                                                         
              IF RQ-RET = SPACES                                                                                                                      
                 MOVE CLI-NOM               TO NOMBRE1O                                                                                               
                 MOVE CLI-COD-EJC           TO DFH-CODEJC                                                                                             
              ELSE                                                                                                                                    
EMI              IF DFH-TPOCTA NOT = CT-AHO                                                                                                           
                    MOVE GL-TIT1-NO-CLI     TO NOMBRE1O                                                                                               
                    MOVE CT-4X              TO W-VALOR-ERROR                                                                                          
                 ELSE                                                                                                                                 
                    MOVE DFH-NUMRUT1        TO RQ-RUT-CLA                                                                                             
                    MOVE DFH-DIGRUT1        TO RQ-DRT-CLA                                                                                             
                    PERFORM ACCESA-CLA                                                                                                                
                    IF RQ-RET-CLA = CT-14X                                                                                                            
                       MOVE GL-TIT1-NO-CLI  TO NOMBRE1O                                                                                               
                       MOVE CT-4X           TO W-VALOR-ERROR                                                                                          
                    ELSE                                                                                                                              
                       MOVE CLA-NOM         TO NOMBRE1O                                                                                               
                       MOVE CT-8000         TO DFH-CODEJC                                                                                             
                       MOVE DFH-OFICTA      TO DFH-CODEJC(CT-2:CT-3)                                                                                  
                       INITIALIZE PRM-BCCE040                                                                                                         
                       MOVE DFH-NUMRUT1     TO BCC-RUT                                                                                                
                       MOVE DFH-DIGRUT1     TO BCC-RUT-DV                                                                                             
                       MOVE DFH-OFICTA      TO BCC-OFI                                                                                                
                       MOVE DFH-FECSOL(CT-1:CT-4) TO BCC-FEC(CT-5:CT-4)                                                                               
                       MOVE DFH-FECSOL(CT-5:CT-2) TO BCC-FEC(CT-3:CT-2)                                                                               
                       MOVE DFH-FECSOL(CT-7:CT-2) TO BCC-FEC(CT-1:CT-2)                                                                               
                       EXEC CICS LINK PROGRAM(CT-BCCE040)                                                                                             
                            COMMAREA(PRM-BCCE040)                                                                                                     
                            LENGTH(CT-LARGO-43)                                                                                                       
                       END-EXEC                                                                                                                       
                       IF BCC-RET NOT = ZEROES                                                                                                        
                          MOVE CT-B         TO W-VALOR-ERROR                                                                                          
                          MOVE BCC-RET      TO ERR-BCC-RET                                                                                            
                          MOVE BCC-CMN      TO ERR-BCC-CMN                                                                                            
                          MOVE W-MSJ-BCC    TO W-MENSAJE                                                                                              
                          GO TO ENVIAR-MAPA                                                                                                           
                       END-IF                                                                                                                         
                    END-IF                                                                                                                            
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-NUMRUT2 = SPACES AND DFH-NUMERO = SPACES AND                                                                                        
              SIN-ERROR                                                                                                                               
EMI           IF DFH-TPOCTA = CT-AHO                                                                                                                  
                 MOVE SPACES             TO RQ-KEY-VAL-RCA                                                                                            
                 MOVE DFH-CUENTA         TO RQ-OPE-NUM-RCA                                                                                            
                 MOVE CT-REDKG           TO RQ-COM-RCA                                                                                                
                 PERFORM ACCESA-RCA                                                                                                                   
                 MOVE CT-REDNX           TO RQ-COM-RCA                                                                                                
                 PERFORM UNTIL ( RQ-RET-RCA  NOT = SPACES    OR                                                                                       
                                 DFH-NUMRUT2 NOT = SPACES    OR                                                                                       
                                 OPE-NUM OF E-REL-CLA-02                                                                                              
                                             NOT = DFH-CUENTA )                                                                                       
                                                                                                                                                      
                                                                                                                                                      
                 IF CLA-NRT OF E-REL-CLA-02 NOT = DFH-NUMRUT1 AND                                                                                     
                    COD-TIP-REL(CT-1:CT-2) = CT-TI                                                                                                    
                    MOVE CLA-NRT OF E-REL-CLA-02 TO DFH-NUMRUT2                                                                                       
                    MOVE CLA-DRT OF E-REL-CLA-02                                                                                                      
                                   TO DFH-DIGRUT2                                                                                                     
                    ELSE                                                                                                                              
                      PERFORM ACCESA-RCA                                                                                                              
                   END-IF                                                                                                                             
                 END-PERFORM                                                                                                                          
                 IF W-SW-RUT = CT-1                                                                                                                   
                    MOVE DFH-NUMRUT2     TO W-NUMRUT-AUX                                                                                              
                    MOVE DFH-DIGRUT2     TO W-DIGRUT-AUX                                                                                              
                    MOVE DFH-NUMRUT1     TO DFH-NUMRUT2                                                                                               
                    MOVE DFH-DIGRUT1     TO DFH-DIGRUT2                                                                                               
                    MOVE W-NUMRUT-AUX    TO DFH-NUMRUT1                                                                                               
                                            NUMRUT1O                                                                                                  
                    MOVE W-DIGRUT-AUX    TO DFH-DIGRUT1                                                                                               
                                            DIGRUT1O                                                                                                  
                    PERFORM RESCATA-NOMBRE1                                                                                                           
                 END-IF                                                                                                                               
              ELSE                                                                                                                                    
EMI02<           IF DFH-TPOCTA = CT-CTV                                                                                                               
                    MOVE SPACES          TO COM-RUT                                                                                                   
                    MOVE DFH-CUENTA      TO COM-CTA                                                                                                   
                    PERFORM LLAMA-CTARUT                                                                                                              
                    IF COM-RET = ZEROES                                                                                                               
                       MOVE CT-CRUT      TO DFH-TPOCTA                                                                                                
                    END-IF                                                                                                                            
EMI02>           END-IF                                                                                                                               
EMI02            IF DFH-TPOCTA = CT-CRUT                                                                                                              
EMI02               MOVE CT-CTV          TO W-PRO-RCO01 W-PRD-COD                                                                                     
EMI02            ELSE                                                                                                                                 
                    MOVE DFH-TPOCTA      TO W-PRO-RCO01 W-PRD-COD                                                                                     
EMI02            END-IF                                                                                                                               
                 MOVE DFH-CUENTA         TO W-OPE-RCO01 W-OPERACION                                                                                   
                 MOVE ZEROS              TO W-RUT-RCO01                                                                                               
                 MOVE W-RCO01            TO RQ-KEY-VAL-RCO                                                                                            
                 MOVE CT-RCO01           TO RQ-KEY-RCO                                                                                                
                 MOVE CT-REDKG           TO RQ-COM-RCO                                                                                                
                 MOVE CT-NO              TO W-EXISTE-RUT                                                                                              
                 PERFORM BUSCA-RUT2 THRU FIN-BUSCA-RUT2                                                                                               
                   UNTIL RQ-RET-RCO    = CT-14X                                                                                                       
                      OR W-EXISTE-RUT  = CT-SI                                                                                                        
                                                                                                                                                      
                                                                                                                                                      
                 IF W-SW-RUT = CT-1                                                                                                                   
                    MOVE DFH-NUMRUT2     TO W-NUMRUT-AUX                                                                                              
                    MOVE DFH-DIGRUT2     TO W-DIGRUT-AUX                                                                                              
                    MOVE DFH-NUMRUT1     TO DFH-NUMRUT2                                                                                               
                    MOVE DFH-DIGRUT1     TO DFH-DIGRUT2                                                                                               
                    MOVE W-NUMRUT-AUX    TO DFH-NUMRUT1                                                                                               
                                            NUMRUT1O                                                                                                  
                    MOVE W-DIGRUT-AUX    TO DFH-DIGRUT1                                                                                               
                                            DIGRUT1O                                                                                                  
                    PERFORM RESCATA-NOMBRE1                                                                                                           
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-NUMRUT2 NOT = SPACES                                                                                                                
              MOVE DFH-NUMRUT2              TO NUMRUT2O RQ-NUM-CLI                                                                                    
              MOVE DFH-DIGRUT2              TO DIGRUT2O RQ-DIG-CLI                                                                                    
              PERFORM LEE-CLI                                                                                                                         
              IF RQ-RET = SPACES                                                                                                                      
                 MOVE CLI-NOM TO NOMBRE2O                                                                                                             
              ELSE                                                                                                                                    
EMI              IF DFH-TPOCTA NOT = CT-AHO                                                                                                           
                    MOVE GL-TIT2-NO-CLI     TO NOMBRE2O                                                                                               
                    MOVE CT-4               TO W-VALOR-ERROR                                                                                          
                 ELSE                                                                                                                                 
                    MOVE DFH-NUMRUT2        TO RQ-RUT-CLA                                                                                             
                    MOVE DFH-DIGRUT2        TO RQ-DRT-CLA                                                                                             
                    PERFORM ACCESA-CLA                                                                                                                
                    IF RQ-RET-CLA = CT-14X                                                                                                            
                       MOVE GL-TIT2-NO-CLI  TO NOMBRE2O                                                                                               
                       MOVE CT-4            TO W-VALOR-ERROR                                                                                          
                    ELSE                                                                                                                              
                       MOVE CLA-NOM         TO NOMBRE2O                                                                                               
                       INITIALIZE PRM-BCCE040                                                                                                         
                       MOVE DFH-NUMRUT2     TO BCC-RUT                                                                                                
                       MOVE DFH-DIGRUT2     TO BCC-RUT-DV                                                                                             
                       MOVE DFH-OFICTA      TO BCC-OFI                                                                                                
                       MOVE DFH-FECSOL(CT-1:CT-4) TO BCC-FEC(CT-5:CT-4)                                                                               
                       MOVE DFH-FECSOL(CT-5:CT-2) TO BCC-FEC(CT-3:CT-2)                                                                               
                       MOVE DFH-FECSOL(CT-7:CT-2) TO BCC-FEC(CT-1:CT-2)                                                                               
                       EXEC CICS LINK PROGRAM(CT-BCCE040)                                                                                             
                            COMMAREA(PRM-BCCE040)                                                                                                     
                            LENGTH(CT-LARGO-43)                                                                                                       
                       END-EXEC                                                                                                                       
                       IF BCC-RET NOT = ZEROES                                                                                                        
                          MOVE CT-B         TO W-VALOR-ERROR                                                                                          
                          MOVE BCC-RET      TO ERR-BCC-RET                                                                                            
                          MOVE BCC-CMN      TO ERR-BCC-CMN                                                                                            
                          MOVE W-MSJ-BCC    TO W-MENSAJE                                                                                              
                          GO TO ENVIAR-MAPA                                                                                                           
                       END-IF                                                                                                                         
                    END-IF                                                                                                                            
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF SIN-ERROR                                                                                                                               
              IF DFH-NUMRUT1 = DFH-NUMRUT2                                                                                                            
                 MOVE GL-TIT-NO-IGU      TO NOMBRE2O                                                                                                  
                 MOVE CT-4               TO W-VALOR-ERROR                                                                                             
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF SIN-ERROR                                                                                                                               
              IF DFH-CODEST NOT = SPACES                                                                                                              
                 MOVE CT-MDT-COD-EST     TO RQ-COD-TBL                                                                                                
                 MOVE DFH-CODEST         TO RQ-VAL-TBL CODESTO                                                                                        
                 MOVE CT-REDKY           TO RQ-COM-TBL                                                                                                
                 PERFORM LEE-TBL                                                                                                                      
                 IF RQ-RET-TBL = SPACES                                                                                                               
                    MOVE TBL-DES-COD     TO GLOESTO                                                                                                   
                 ELSE                                                                                                                                 
                    MOVE GL-NO-DEF       TO GLOESTO                                                                                                   
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-FECEST NOT = SPACES                                                                                                                 
              MOVE DFH-FECEST   TO W-F-AMD                                                                                                            
              MOVE W-DIA-AMD    TO W-DIA-ED                                                                                                           
              MOVE W-MES-AMD    TO W-MES-ED                                                                                                           
              MOVE W-ANO-AMD    TO W-ANO-ED                                                                                                           
              MOVE W-FECHA-ED   TO FECESTO                                                                                                            
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF SIN-ERROR                                                                                                                               
              IF DFH-CODEJC NOT = SPACES                                                                                                              
                 MOVE DFH-CODEJC         TO RQ-COD-EJC CODEJCO                                                                                        
                 PERFORM LEE-EJC                                                                                                                      
                 IF DFH-CODEJC(CT-1:CT-1) = CT-8                                                                                                      
                    IF RQ-RET NOT = SPACES                                                                                                            
                       MOVE EJC-NOM      TO NOMEJCO                                                                                                   
                    ELSE                                                                                                                              
                       MOVE CT-GLS-EJEC  TO NOMEJCO                                                                                                   
                       MOVE EJC-NOM(CT-18:CT-30)                                                                                                      
                                         TO NOMEJCO(CT-6:CT-14)                                                                                       
                    END-IF                                                                                                                            
                 ELSE                                                                                                                                 
                    MOVE EJC-NOM         TO NOMEJCO                                                                                                   
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-TPOCTA NOT = SPACES                                                                                                                 
              MOVE CT-MDT-TIP-CTA-CAR   TO RQ-COD-TBL                                                                                                 
              MOVE DFH-TPOCTA           TO RQ-VAL-TBL TPOCTAO                                                                                         
              MOVE CT-REDKY             TO RQ-COM-TBL                                                                                                 
              PERFORM LEE-TBL                                                                                                                         
              MOVE TBL-DES-COD          TO GTPOCTAO                                                                                                   
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-CUENTA NOT = SPACES                                                                                                                 
EMI02<        IF DFH-TPOCTA = CT-CTV                                                                                                                  
                 MOVE SPACES            TO COM-RUT                                                                                                    
                 MOVE DFH-CUENTA        TO COM-CTA                                                                                                    
                 PERFORM LLAMA-CTARUT                                                                                                                 
                 IF COM-RET = ZEROES                                                                                                                  
                    MOVE CT-CRUT        TO DFH-TPOCTA                                                                                                 
                    MOVE DFH-TPOCTA     TO TPOCTAO                                                                                                    
                    MOVE CT-GLS-CRUT    TO GTPOCTAO                                                                                                   
                 END-IF                                                                                                                               
EMI02>        END-IF                                                                                                                                  
EMI02         IF DFH-TPOCTA = CT-CRUT                                                                                                                 
EMI02            MOVE DFH-NUMRUT1       TO CUENTAO                                                                                                    
EMI02         ELSE                                                                                                                                    
                 MOVE DFH-CUENTA        TO CUENTAO                                                                                                    
EMI02         END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF SIN-ERROR                                                                                                                               
              IF DFH-OFICTA NOT = SPACES                                                                                                              
                 MOVE DFH-OFICTA        TO RQ-COD-OFI CODSUCO                                                                                         
                 PERFORM LEE-OFI                                                                                                                      
                 MOVE OFI-NOM           TO NOMSUCO                                                                                                    
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF SIN-ERROR                                                                                                                               
              IF DFH-MONCTA NOT = SPACES                                                                                                              
                 MOVE DFH-MONCTA        TO RQ-COD-MON CODMONO                                                                                         
                 PERFORM LEE-MON                                                                                                                      
                 MOVE MON-NOM-CRT       TO GLOMONO                                                                                                    
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF DFH-FECSOL NOT = SPACES                                                                                                                 
              MOVE DFH-FECSOL   TO W-F-AMD                                                                                                            
              MOVE W-DIA-AMD    TO W-DIA-ED                                                                                                           
              MOVE W-MES-AMD    TO W-MES-ED                                                                                                           
              MOVE W-ANO-AMD    TO W-ANO-ED                                                                                                           
              MOVE W-FECHA-ED   TO FECSOLO  DFH-FECSOL-ED                                                                                             
           END-IF.                                                                                                                                    
                                                                                                                                                      
       RESCATA-NOMBRE1.                                                                                                                               
      *---------------                                                                                                                                
           MOVE DFH-NUMRUT1              TO RQ-NUM-CLI                                                                                                
           MOVE DFH-DIGRUT1              TO RQ-DIG-CLI                                                                                                
           PERFORM LEE-CLI                                                                                                                            
           IF RQ-RET = SPACES                                                                                                                         
              MOVE CLI-NOM               TO NOMBRE1O                                                                                                  
              MOVE CLI-COD-EJC           TO DFH-CODEJC                                                                                                
           ELSE                                                                                                                                       
EMI           IF DFH-TPOCTA NOT = CT-AHO                                                                                                              
                 MOVE GL-TIT1-NO-CLI     TO NOMBRE1O                                                                                                  
                 MOVE CT-4X              TO W-VALOR-ERROR                                                                                             
              ELSE                                                                                                                                    
                 MOVE DFH-NUMRUT1        TO RQ-RUT-CLA                                                                                                
                 MOVE DFH-DIGRUT1        TO RQ-DRT-CLA                                                                                                
                 PERFORM ACCESA-CLA                                                                                                                   
                 IF RQ-RET-CLA = CT-14X                                                                                                               
                    MOVE GL-TIT1-NO-CLI  TO NOMBRE1O                                                                                                  
                    MOVE CT-4X           TO W-VALOR-ERROR                                                                                             
                 ELSE                                                                                                                                 
                    MOVE CLA-NOM         TO NOMBRE1O                                                                                                  
                    MOVE CT-8000         TO DFH-CODEJC                                                                                                
                    MOVE DFH-OFICTA      TO DFH-CODEJC(CT-2:CT-3)                                                                                     
                    INITIALIZE PRM-BCCE040                                                                                                            
                    MOVE DFH-NUMRUT1     TO BCC-RUT                                                                                                   
                    MOVE DFH-DIGRUT1     TO BCC-RUT-DV                                                                                                
                    MOVE DFH-OFICTA      TO BCC-OFI                                                                                                   
                    MOVE DFH-FECSOL(CT-1:CT-4)   TO BCC-FEC(CT-5:CT-4)                                                                                
                    MOVE DFH-FECSOL(CT-5:CT-2)   TO BCC-FEC(CT-3:CT-2)                                                                                
                    MOVE DFH-FECSOL(CT-7:CT-2)   TO BCC-FEC(CT-1:CT-2)                                                                                
                    EXEC CICS LINK PROGRAM(CT-BCCE040)                                                                                                
                         COMMAREA(PRM-BCCE040)                                                                                                        
                         LENGTH(CT-LARGO-43)                                                                                                          
                    END-EXEC                                                                                                                          
                    IF BCC-RET NOT = ZEROES                                                                                                           
                       MOVE CT-B         TO W-VALOR-ERROR                                                                                             
                       MOVE BCC-RET      TO ERR-BCC-RET                                                                                               
                       MOVE BCC-CMN      TO ERR-BCC-CMN                                                                                               
                       MOVE W-MSJ-BCC    TO W-MENSAJE                                                                                                 
                       GO TO ENVIAR-MAPA                                                                                                              
                    END-IF                                                                                                                            
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       LEE-CVS.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE CT-REDKY          TO RQ-COM                                                                                                           
           MOVE CT-CVS            TO RQ-FIL                                                                                                           
           MOVE CT-CVS01          TO RQ-KEY                                                                                                           
           MOVE CT-138            TO RQ-DBI                                                                                                           
           MOVE SPACES            TO RQ-RET                                                                                                           
           MOVE W-LLAVE-CVS       TO RQ-KEY-VAL                                                                                                       
           MOVE CT-CVS01          TO W-ELM-NAME                                                                                                       
           CALL 'DBNTRY'     USING RQ-UIB                                                                                                             
                             RQ-AREA                                                                                                                  
                             E-CVN-SER-01                                                                                                             
                             W-ELEMENT-LIST                                                                                                           
                                                                                                                                                      
           IF RQ-RET NOT = SPACES AND NOT = CT-14X                                                                                                    
              MOVE CT-B           TO W-VALOR-ERROR                                                                                                    
              MOVE RQ-DBI         TO ERROR-BASE                                                                                                       
              MOVE RQ-FIL         TO ERROR-TABLA                                                                                                      
              MOVE RQ-RET         TO ERROR-RET                                                                                                        
              MOVE W-MSJ-ERROR    TO W-MENSAJE                                                                                                        
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
       LEE-EJC.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE CT-REDKY          TO RQ-COM                                                                                                           
           MOVE CT-EJC            TO RQ-FIL                                                                                                           
           MOVE CT-EJC01          TO RQ-KEY                                                                                                           
           MOVE CT-103            TO RQ-DBI                                                                                                           
           MOVE SPACES            TO RQ-RET                                                                                                           
           MOVE W-LLAVE-EJC       TO RQ-KEY-VAL                                                                                                       
           MOVE CT-EJC01          TO W-ELM-NAME                                                                                                       
           CALL 'DBNTRY'     USING RQ-UIB                                                                                                             
                             RQ-AREA                                                                                                                  
                             E-EJC-01                                                                                                                 
                             W-ELEMENT-LIST                                                                                                           
                                                                                                                                                      
           IF RQ-RET NOT = SPACES AND NOT = CT-14X                                                                                                    
              MOVE CT-B           TO W-VALOR-ERROR                                                                                                    
              MOVE RQ-DBI         TO ERROR-BASE                                                                                                       
              MOVE RQ-FIL         TO ERROR-TABLA                                                                                                      
              MOVE RQ-RET         TO ERROR-RET                                                                                                        
              MOVE W-MSJ-ERROR    TO W-MENSAJE                                                                                                        
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF RQ-RET = CT-14X                                                                                                                         
              MOVE GL-EJEC-NO-EXI TO EJC-NOM                                                                                                          
           END-IF.                                                                                                                                    
                                                                                                                                                      
       LEE-OFI.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE CT-REDKY          TO RQ-COM                                                                                                           
           MOVE CT-OFI            TO RQ-FIL                                                                                                           
           MOVE CT-OFI01          TO RQ-KEY                                                                                                           
           MOVE CT-103            TO RQ-DBI                                                                                                           
           MOVE SPACES            TO RQ-RET                                                                                                           
           MOVE W-LLAVE-OFI       TO RQ-KEY-VAL                                                                                                       
           MOVE CT-OFI01          TO W-ELM-NAME                                                                                                       
           CALL 'DBNTRY'    USING RQ-UIB                                                                                                              
                            RQ-AREA                                                                                                                   
                            OFI-01                                                                                                                    
                            W-ELEMENT-LIST                                                                                                            
                                                                                                                                                      
           IF RQ-RET NOT = SPACES AND NOT = CT-14X                                                                                                    
              MOVE CT-B           TO W-VALOR-ERROR                                                                                                    
              MOVE RQ-DBI         TO ERROR-BASE                                                                                                       
              MOVE RQ-FIL         TO ERROR-TABLA                                                                                                      
              MOVE RQ-RET         TO ERROR-RET                                                                                                        
              MOVE W-MSJ-ERROR    TO W-MENSAJE                                                                                                        
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF RQ-RET = CT-14X                                                                                                                         
              MOVE GL-NO-EXI      TO OFI-NOM                                                                                                          
           END-IF.                                                                                                                                    
                                                                                                                                                      
       LEE-MON.                                                                                                                                       
      *--------                                                                                                                                       
           MOVE CT-REDKY          TO RQ-COM                                                                                                           
           MOVE CT-MON            TO RQ-FIL                                                                                                           
           MOVE CT-MON01          TO RQ-KEY                                                                                                           
           MOVE CT-103            TO RQ-DBI                                                                                                           
           MOVE SPACES            TO RQ-RET                                                                                                           
           MOVE W-LLAVE-MON       TO RQ-KEY-VAL                                                                                                       
           MOVE CT-MON01          TO W-ELM-NAME                                                                                                       
           CALL 'DBNTRY'    USING RQ-UIB                                                                                                              
                            RQ-AREA                                                                                                                   
                            MON-01                                                                                                                    
                            W-ELEMENT-LIST                                                                                                            
                                                                                                                                                      
           IF RQ-RET NOT = SPACES AND NOT = CT-14X                                                                                                    
              MOVE CT-B           TO W-VALOR-ERROR                                                                                                    
              MOVE RQ-DBI         TO ERROR-BASE                                                                                                       
              MOVE RQ-FIL         TO ERROR-TABLA                                                                                                      
              MOVE RQ-RET         TO ERROR-RET                                                                                                        
              MOVE W-MSJ-ERROR    TO W-MENSAJE                                                                                                        
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF RQ-RET = CT-14X                                                                                                                         
              IF RQ-COD-MON = CT-000X                                                                                                                 
                 MOVE SPACES      TO RQ-RET                                                                                                           
                 MOVE CT-000X     TO MON-NOM-CRT                                                                                                      
              ELSE                                                                                                                                    
                 MOVE GL-NE       TO MON-NOM-CRT                                                                                                      
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       POR-CUENTA.                                                                                                                                    
      *-----------                                                                                                                                    
           PERFORM LIMPIA-TODO                                                                                                                        
           MOVE SPACES            TO W-VALOR-ERROR                                                                                                    
           MOVE TPOCTAI           TO DFH-TPOCTA                                                                                                       
           MOVE CUENTAI           TO DFH-CUENTA                                                                                                       
           MOVE SPACES            TO NUMEROO  NUMRUT1O DIGRUT1O                                                                                       
                                     NUMRUT2O DIGRUT2O FECSOLO                                                                                        
                                                                                                                                                      
           MOVE CT-MDT-TIP-CTA-CAR          TO RQ-COD-TBL                                                                                             
           MOVE DFH-TPOCTA                  TO RQ-VAL-TBL                                                                                             
           MOVE CT-REDKY                    TO RQ-COM-TBL                                                                                             
           PERFORM LEE-TBL                                                                                                                            
           IF RQ-RET-TBL = CT-14X                                                                                                                     
              MOVE GL-TIP-CTA-NO-CORR       TO W-MENSAJE                                                                                              
              MOVE CT-2X                    TO W-VALOR-ERROR                                                                                          
              GO TO FIN-POR-CUENTA.                                                                                                                   
                                                                                                                                                      
           MOVE SPACES                      TO DFH-TIP-CTA-AHO                                                                                        
EMI        IF DFH-TPOCTA = CT-AHO                                                                                                                     
              MOVE DFH-CUENTA               TO RQ-KEY-VAL-OPA                                                                                         
              PERFORM ACCESA-OPA                                                                                                                      
              IF RQ-RET-OPA = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI         TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-CUENTA                                                                                                                 
              END-IF                                                                                                                                  
              IF OPA-FEC-CRR NOT = ZEROES                                                                                                             
                 MOVE GL-CTA-NO-VIG         TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-CUENTA                                                                                                                 
              END-IF                                                                                                                                  
                                                                                                                                                      
              MOVE SPR-COD OF E-AHR-OPE-01  TO WS-SW-CTA-AHO                                                                                          
              IF WS-SW-CTA-AHO-OK                                                                                                                     
                 MOVE WS-SW-CTA-AHO         TO DFH-TIP-CTA-AHO                                                                                        
              ELSE                                                                                                                                    
                 MOVE GL-TIP-CTA-NO-VAL     TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-CUENTA                                                                                                                 
              END-IF                                                                                                                                  
              PERFORM LEER-AHOMTAB                                                                                                                    
              MOVE CT-999X                  TO DFH-MONCTA                                                                                             
           ELSE                                                                                                                                       
              MOVE DFH-TPOCTA               TO RQ-PRO-OPE                                                                                             
              MOVE DFH-CUENTA               TO RQ-OPE-OPE                                                                                             
              MOVE CT-REDKY                 TO RQ-COM-OPE                                                                                             
              PERFORM ACCESA-OPE                                                                                                                      
                                                                                                                                                      
              IF RQ-RET-OPE = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI         TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-CUENTA                                                                                                                 
              END-IF                                                                                                                                  
                                                                                                                                                      
EMI           IF OPE-COD-STAT NOT = CT-VIG AND NOT = CT-1XX                                                                                           
                 MOVE GL-CTA-NO-VIG         TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-CUENTA                                                                                                                 
              END-IF                                                                                                                                  
                                                                                                                                                      
              IF OPE-MON NOT = ZERO AND NOT = CT-999                                                                                                  
                 MOVE GL-MON-CTA-NO-PES     TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-POR-CUENTA                                                                                                                 
              END-IF                                                                                                                                  
                                                                                                                                                      
              MOVE OPE-COD-OFI              TO DFH-OFICTA                                                                                             
              IF OPE-MON = ZERO                                                                                                                       
                 MOVE CT-999X               TO DFH-MONCTA                                                                                             
              ELSE                                                                                                                                    
                 MOVE OPE-MON               TO DFH-MONCTA                                                                                             
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
           MOVE DFH-TPOCTA             TO W-PRO-UNO-ROP                                                                                               
           MOVE DFH-CUENTA             TO W-OPE-UNO-ROP                                                                                               
           MOVE CT-MDT                 TO W-PRO-DOS-ROP                                                                                               
           MOVE SPACES                 TO W-OPE-DOS-ROP                                                                                               
           MOVE W-ROP00-ROP01          TO RQ-KEY-VAL-ROP                                                                                              
           MOVE CT-ROP01               TO RQ-KEY-ROP                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-ROP                                                                                                  
           MOVE SPACES                 TO RQ-RET-ROP                                                                                                  
                                                                                                                                                      
           PERFORM LEE-ROP                                                                                                                            
           IF RQ-RET-ROP = CT-14X                                                                                                                     
              MOVE GL-CTA-SIN-MAND     TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CUENTA.                                                                                                                   
                                                                                                                                                      
           MOVE ROP-NUM-OPE            TO W-OPERACION                                                                                                 
           MOVE W-NUM-11               TO DFH-NUMERO                                                                                                  
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-OPE                                                                                                  
           MOVE ROP-NUM-OPE            TO RQ-OPE-OPE                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
                                                                                                                                                      
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE DFH-NUMERO TO NUMEROO                                                                                                              
              MOVE GL-MAND-NO-EXI      TO W-MENSAJE                                                                                                   
              MOVE CT-1                TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CUENTA.                                                                                                                   
                                                                                                                                                      
           MOVE OPE-COD-STAT           TO DFH-CODEST                                                                                                  
           MOVE OPE-FEC-FTOP           TO DFH-FECSOL                                                                                                  
           MOVE OPE-FEC-FROP           TO DFH-FECEST                                                                                                  
                                                                                                                                                      
           MOVE CT-MDT                 TO W-PRO-RCO01                                                                                                 
           MOVE DFH-NUMERO             TO W-OPE-RCO01                                                                                                 
           MOVE ZEROS                  TO W-RUT-RCO01                                                                                                 
           MOVE W-RCO01                TO RQ-KEY-VAL-RCO                                                                                              
           MOVE CT-RCO01               TO RQ-KEY-RCO                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-RCO                                                                                                  
                                                                                                                                                      
           MOVE CT-NO                  TO W-EXISTE                                                                                                    
           MOVE CT-NO                  TO W-ERROR                                                                                                     
           MOVE W-OPE-RCO01            TO W-OPERACION                                                                                                 
           PERFORM BUSCA-CLI-REL THRU FIN-BUSCA-CLI-REL                                                                                               
             UNTIL W-EXISTE   = CT-SI                                                                                                                 
                OR W-ERROR    = CT-SI                                                                                                                 
                OR RQ-RET-RCO = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF W-ERROR = CT-SI                                                                                                                         
              MOVE GL-MAND-MAS-1TIT    TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CUENTA.                                                                                                                   
                                                                                                                                                      
           IF W-EXISTE = CT-NO                                                                                                                        
              MOVE GL-N-MAND-NO-REL    TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CUENTA.                                                                                                                   
                                                                                                                                                      
           IF DFH-NUMRUT2 = SPACES                                                                                                                    
              GO TO FIN-POR-CUENTA.                                                                                                                   
                                                                                                                                                      
           MOVE CT-MDT                 TO W-PRO-RCO01                                                                                                 
           MOVE W-OPERACION            TO W-OPE-RCO01                                                                                                 
           MOVE DFH-NUMRUT2            TO W-RUT-RCO01                                                                                                 
           MOVE W-RCO01                TO RQ-KEY-VAL-RCO                                                                                              
           MOVE CT-RCO01               TO RQ-KEY-RCO                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-RCO                                                                                                  
           PERFORM LEE-RCO                                                                                                                            
           IF RQ-RET-RCO = CT-14X                                                                                                                     
              MOVE CT-7X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-MAND2-NO-REL     TO W-MENSAJE                                                                                                   
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-POR-CUENTA. EXIT.                                                                                                                          
                                                                                                                                                      
EMI02  POR-CTARUT.                                                                                                                                    
      *-----------                                                                                                                                    
           PERFORM LIMPIA-TODO                                                                                                                        
           MOVE SPACES                 TO W-VALOR-ERROR                                                                                               
           MOVE TPOCTAI                TO DFH-TPOCTA                                                                                                  
EMI03>     IF CUENTAI(CT-11:CT-1) = SPACES OR LOW-VALUES                                                                                              
              MOVE CUENTAI             TO COM-RUT                                                                                                     
              MOVE SPACES              TO COM-CTA                                                                                                     
           ELSE                                                                                                                                       
              MOVE SPACES              TO COM-RUT                                                                                                     
              MOVE CUENTAI             TO COM-CTA                                                                                                     
EMI03<     END-IF                                                                                                                                     
           PERFORM LLAMA-CTARUT                                                                                                                       
           EVALUATE COM-RET                                                                                                                           
              WHEN ZEROES                                                                                                                             
                 MOVE COM-CTA          TO DFH-CUENTA                                                                                                  
                 MOVE SPACES           TO DFH-NUMRUT1                                                                                                 
                 MOVE SPACES           TO DFH-DIGRUT1                                                                                                 
              WHEN CT-100                                                                                                                             
                 MOVE GL-RUT-SIN-CTA   TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-POR-CTARUT                                                                                                                 
              WHEN OTHER                                                                                                                              
                 STRING  GL-ERR-CTA-RUT  COM-RET                                                                                                      
                 DELIMITED BY SIZE INTO W-MENSAJE                                                                                                     
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-POR-CTARUT                                                                                                                 
           END-EVALUATE                                                                                                                               
           MOVE SPACES                 TO NUMEROO  NUMRUT1O DIGRUT1O                                                                                  
                                          NUMRUT2O DIGRUT2O FECSOLO                                                                                   
           MOVE SPACES                 TO DFH-TIP-CTA-AHO                                                                                             
           MOVE CT-CTV                 TO RQ-PRO-OPE                                                                                                  
           MOVE DFH-CUENTA             TO RQ-OPE-OPE                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE GL-CTA-NO-EXI       TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CTARUT                                                                                                                    
           END-IF                                                                                                                                     
EMI        IF OPE-COD-STAT NOT = CT-VIG AND NOT = CT-1XX                                                                                              
              MOVE GL-CTA-NO-VIG       TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CTARUT                                                                                                                    
           END-IF                                                                                                                                     
           IF OPE-MON NOT = ZERO AND NOT = CT-999                                                                                                     
              MOVE GL-MON-CTA-NO-PES   TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CTARUT                                                                                                                    
           END-IF                                                                                                                                     
           MOVE OPE-COD-OFI            TO DFH-OFICTA                                                                                                  
           IF OPE-MON = ZERO                                                                                                                          
              MOVE CT-999X             TO DFH-MONCTA                                                                                                  
           ELSE                                                                                                                                       
              MOVE OPE-MON             TO DFH-MONCTA                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
           MOVE CT-CTV                 TO W-PRO-UNO-ROP                                                                                               
           MOVE DFH-CUENTA             TO W-OPE-UNO-ROP                                                                                               
           MOVE CT-MDT                 TO W-PRO-DOS-ROP                                                                                               
           MOVE SPACES                 TO W-OPE-DOS-ROP                                                                                               
           MOVE W-ROP00-ROP01          TO RQ-KEY-VAL-ROP                                                                                              
           MOVE CT-ROP01               TO RQ-KEY-ROP                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-ROP                                                                                                  
           MOVE SPACES                 TO RQ-RET-ROP                                                                                                  
                                                                                                                                                      
           PERFORM LEE-ROP                                                                                                                            
           IF RQ-RET-ROP = CT-14X                                                                                                                     
              MOVE GL-CTA-SIN-MAND     TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CTARUT.                                                                                                                   
                                                                                                                                                      
           MOVE ROP-NUM-OPE            TO W-OPERACION                                                                                                 
           MOVE W-NUM-11               TO DFH-NUMERO                                                                                                  
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-OPE                                                                                                  
           MOVE ROP-NUM-OPE            TO RQ-OPE-OPE                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
                                                                                                                                                      
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE DFH-NUMERO TO NUMEROO                                                                                                              
              MOVE GL-MAND-NO-EXI      TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CTARUT.                                                                                                                   
                                                                                                                                                      
           MOVE OPE-COD-STAT           TO DFH-CODEST                                                                                                  
           MOVE OPE-FEC-FTOP           TO DFH-FECSOL                                                                                                  
           MOVE OPE-FEC-FROP           TO DFH-FECEST                                                                                                  
                                                                                                                                                      
           MOVE CT-MDT                 TO W-PRO-RCO01                                                                                                 
           MOVE DFH-NUMERO             TO W-OPE-RCO01                                                                                                 
           MOVE ZEROS                  TO W-RUT-RCO01                                                                                                 
           MOVE W-RCO01                TO RQ-KEY-VAL-RCO                                                                                              
           MOVE CT-RCO01               TO RQ-KEY-RCO                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-RCO                                                                                                  
                                                                                                                                                      
           MOVE CT-NO                  TO W-EXISTE                                                                                                    
           MOVE CT-NO                  TO W-ERROR                                                                                                     
           MOVE W-OPE-RCO01            TO W-OPERACION                                                                                                 
           PERFORM BUSCA-CLI-REL THRU FIN-BUSCA-CLI-REL                                                                                               
             UNTIL W-EXISTE   = CT-SI                                                                                                                 
                OR W-ERROR    = CT-SI                                                                                                                 
                OR RQ-RET-RCO = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF W-ERROR = CT-SI                                                                                                                         
              MOVE GL-MAND-MAS-1TIT    TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CTARUT.                                                                                                                   
                                                                                                                                                      
           IF W-EXISTE = CT-NO                                                                                                                        
              MOVE GL-N-MAND-NO-REL    TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-CTARUT.                                                                                                                   
                                                                                                                                                      
           IF DFH-NUMRUT2 = SPACES                                                                                                                    
              GO TO FIN-POR-CTARUT.                                                                                                                   
                                                                                                                                                      
           MOVE CT-MDT                 TO W-PRO-RCO01                                                                                                 
           MOVE W-OPERACION            TO W-OPE-RCO01                                                                                                 
           MOVE DFH-NUMRUT2            TO W-RUT-RCO01                                                                                                 
           MOVE W-RCO01                TO RQ-KEY-VAL-RCO                                                                                              
           MOVE CT-RCO01               TO RQ-KEY-RCO                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-RCO                                                                                                  
           PERFORM LEE-RCO                                                                                                                            
           IF RQ-RET-RCO = CT-14X                                                                                                                     
              MOVE CT-7X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-MAND2-NO-REL     TO W-MENSAJE                                                                                                   
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-POR-CTARUT. EXIT.                                                                                                                          
                                                                                                                                                      
       POR-RUT.                                                                                                                                       
      *--------                                                                                                                                       
           PERFORM LIMPIA-TODO                                                                                                                        
           MOVE NUMRUT1I               TO W-NUMRUT                                                                                                    
           PERFORM VALIDA-DIGITO                                                                                                                      
           MOVE W-DIG-VER              TO DIGRUT1I                                                                                                    
                                                                                                                                                      
           MOVE SPACES                 TO W-VALOR-ERROR                                                                                               
           MOVE NUMRUT1I               TO DFH-NUMRUT1                                                                                                 
           MOVE DIGRUT1I               TO DFH-DIGRUT1                                                                                                 
           MOVE SPACES                 TO NUMEROO  TPOCTAO CUENTAO                                                                                    
                                          NUMRUT2O DIGRUT2O FECSOLO                                                                                   
                                                                                                                                                      
           MOVE DFH-NUMRUT1            TO RQ-NUM-CLI                                                                                                  
           MOVE DFH-DIGRUT1            TO RQ-DIG-CLI                                                                                                  
           PERFORM LEE-CLI                                                                                                                            
           IF RQ-RET = CT-14X                                                                                                                         
              MOVE GL-MAND1-ING        TO W-MENSAJE                                                                                                   
              MOVE CT-4X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-RUT.                                                                                                                      
                                                                                                                                                      
           MOVE DFH-NUMRUT1            TO W-RUT-RCO00                                                                                                 
           MOVE CT-MDT                 TO W-PRO-RCO00                                                                                                 
           MOVE SPACES                 TO W-OPE-RCO00                                                                                                 
           MOVE W-RCO00                TO RQ-KEY-VAL-RCO                                                                                              
           MOVE CT-RCO00               TO RQ-KEY-RCO                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-RCO                                                                                                  
                                                                                                                                                      
           PERFORM LEE-RCO                                                                                                                            
                                                                                                                                                      
EMI        IF (RQ-RET-RCO = CT-14X) OR (RCO-COD-OPE NOT = CT-MDT)                                                                                     
              MOVE GL-RUT-SIN-MAND     TO W-MENSAJE                                                                                                   
              MOVE CT-4X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-RUT.                                                                                                                      
                                                                                                                                                      
           MOVE RCO-NUM-OPE            TO W-OPERACION                                                                                                 
           MOVE W-NUM-11               TO DFH-NUMERO                                                                                                  
                                                                                                                                                      
           IF RCO-COD-RCOP NOT = CT-TI1                                                                                                               
              MOVE GL-RUT-NO-TIT1      TO W-MENSAJE                                                                                                   
              MOVE CT-4X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-RUT.                                                                                                                      
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-OPE                                                                                                  
           MOVE DFH-NUMERO             TO RQ-OPE-OPE                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
                                                                                                                                                      
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE GL-MAND-NO-EXI      TO W-MENSAJE                                                                                                   
              MOVE CT-1X  TO W-VALOR-ERROR                                                                                                            
              GO TO FIN-POR-RUT.                                                                                                                      
                                                                                                                                                      
           MOVE OPE-COD-STAT           TO DFH-CODEST                                                                                                  
           MOVE OPE-FEC-FTOP           TO DFH-FECSOL                                                                                                  
           MOVE OPE-FEC-FROP           TO DFH-FECEST                                                                                                  
                                                                                                                                                      
           MOVE CT-MDT                 TO W-PRO-RCO01 W-PRD-COD                                                                                       
           MOVE RCO-NUM-OPE            TO W-OPE-RCO01                                                                                                 
           MOVE ZEROS                  TO W-RUT-RCO01                                                                                                 
           MOVE W-RCO01                TO RQ-KEY-VAL-RCO                                                                                              
           MOVE CT-RCO01               TO RQ-KEY-RCO                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-RCO                                                                                                  
           MOVE CT-NO                  TO W-EXISTE-RUT                                                                                                
           PERFORM BUSCA-RUT2 THRU FIN-BUSCA-RUT2                                                                                                     
             UNTIL RQ-RET-RCO     = CT-14X                                                                                                            
                OR W-EXISTE-RUT   = CT-SI                                                                                                             
                                                                                                                                                      
                                                                                                                                                      
           MOVE CT-MDT-TIP-CTA-CAR     TO RQ-COD-TBL                                                                                                  
           MOVE SPACES                 TO RQ-VAL-TBL                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-TBL                                                                                                  
           MOVE CT-NO                  TO W-EXISTE                                                                                                    
           PERFORM BUSCA-OPE-REL THRU FIN-BUSCA-OPE-REL                                                                                               
             UNTIL W-EXISTE = CT-SI                                                                                                                   
                OR RQ-RET-TBL = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF W-EXISTE = CT-NO                                                                                                                        
              MOVE GL-MAND-NO-CTA-CGO  TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-POR-RUT.                                                                                                                      
                                                                                                                                                      
           MOVE SPACES                 TO DFH-TIP-CTA-AHO                                                                                             
EMI        IF DFH-TPOCTA = CT-AHO                                                                                                                     
              MOVE DFH-CUENTA TO RQ-KEY-VAL-OPA                                                                                                       
              PERFORM ACCESA-OPA                                                                                                                      
              IF RQ-RET-OPA = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI    TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-POR-RUT                                                                                                                    
              END-IF                                                                                                                                  
              IF OPA-FEC-CRR NOT = ZEROES                                                                                                             
                 MOVE GL-CTA-NO-VIG    TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-POR-RUT                                                                                                                    
              END-IF                                                                                                                                  
              MOVE SPR-COD OF E-AHR-OPE-01 TO WS-SW-CTA-AHO                                                                                           
              IF WS-SW-CTA-AHO-OK                                                                                                                     
                 MOVE WS-SW-CTA-AHO    TO DFH-TIP-CTA-AHO                                                                                             
              ELSE                                                                                                                                    
                 MOVE GL-TIP-CTA-NO-VAL   TO W-MENSAJE                                                                                                
                 MOVE CT-3X               TO W-VALOR-ERROR                                                                                            
                 GO TO FIN-POR-RUT                                                                                                                    
              END-IF                                                                                                                                  
              PERFORM LEER-AHOMTAB                                                                                                                    
              MOVE CT-999X             TO DFH-MONCTA                                                                                                  
           ELSE                                                                                                                                       
EMI02<        IF DFH-TPOCTA = CT-CTV                                                                                                                  
EMI03            MOVE SPACES           TO COM-RUT                                                                                                     
EMI03            MOVE DFH-CUENTA       TO COM-CTA                                                                                                     
                 PERFORM LLAMA-CTARUT                                                                                                                 
                 IF COM-RET = ZEROES                                                                                                                  
                    MOVE CT-CRUT       TO DFH-TPOCTA                                                                                                  
                 END-IF                                                                                                                               
EMI02>        END-IF                                                                                                                                  
EMI02         IF DFH-TPOCTA = CT-CRUT                                                                                                                 
EMI02            MOVE CT-CTV           TO RQ-PRO-OPE                                                                                                  
EMI02         ELSE                                                                                                                                    
                 MOVE DFH-TPOCTA       TO RQ-PRO-OPE                                                                                                  
EMI02         END-IF                                                                                                                                  
              MOVE DFH-CUENTA          TO RQ-OPE-OPE                                                                                                  
              MOVE CT-REDKY            TO RQ-COM-OPE                                                                                                  
              PERFORM ACCESA-OPE                                                                                                                      
              IF RQ-RET-OPE = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI    TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-POR-RUT                                                                                                                    
              END-IF                                                                                                                                  
                                                                                                                                                      
EMI           IF OPE-COD-STAT NOT = CT-VIG AND NOT = CT-1XX                                                                                           
                 MOVE GL-CTA-NO-VIG    TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-POR-RUT                                                                                                                    
              END-IF                                                                                                                                  
                                                                                                                                                      
              IF OPE-MON NOT = ZERO AND NOT = CT-999                                                                                                  
                 MOVE GL-MON-CTA-NO-PES   TO W-MENSAJE                                                                                                
                 MOVE CT-3X               TO W-VALOR-ERROR                                                                                            
                 GO TO FIN-POR-RUT                                                                                                                    
              END-IF                                                                                                                                  
                                                                                                                                                      
              MOVE OPE-COD-OFI TO DFH-OFICTA                                                                                                          
              IF OPE-MON = ZERO                                                                                                                       
                 MOVE CT-999X          TO DFH-MONCTA                                                                                                  
              ELSE                                                                                                                                    
                 MOVE OPE-MON          TO DFH-MONCTA                                                                                                  
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-POR-RUT. EXIT.                                                                                                                             
                                                                                                                                                      
       BUSCA-RUT2.                                                                                                                                    
      *-----------                                                                                                                                    
           PERFORM LEE-RCO                                                                                                                            
                                                                                                                                                      
           IF RQ-RET-RCO = CT-14X                                                                                                                     
              GO TO FIN-BUSCA-RUT2.                                                                                                                   
                                                                                                                                                      
           IF (RCO-COD-OPE NOT = W-PRD-COD   ) OR                                                                                                     
              (RCO-NUM-OPE NOT = W-OPERACION)                                                                                                         
               MOVE CT-14X             TO RQ-RET-RCO                                                                                                  
               GO TO FIN-BUSCA-RUT2.                                                                                                                  
                                                                                                                                                      
           IF W-SW-RUT = ZEROES                                                                                                                       
              IF RCO-COD-RCOP = CT-TI2                                                                                                                
                 MOVE CT-SI            TO W-EXISTE-RUT                                                                                                
                 MOVE RCO-NRT-CLI      TO DFH-NUMRUT2                                                                                                 
                 MOVE RCO-DRT-CLI      TO DFH-DIGRUT2                                                                                                 
                 GO TO FIN-BUSCA-RUT2                                                                                                                 
              END-IF                                                                                                                                  
           ELSE                                                                                                                                       
              IF RCO-COD-RCOP = CT-TI1 OR CT-TIT                                                                                                      
                 MOVE CT-SI            TO W-EXISTE-RUT                                                                                                
                 MOVE RCO-NRT-CLI      TO DFH-NUMRUT2                                                                                                 
                 MOVE RCO-DRT-CLI      TO DFH-DIGRUT2                                                                                                 
                 GO TO FIN-BUSCA-RUT2                                                                                                                 
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE CT-REDNX TO RQ-COM-RCO.                                                                                                               
                                                                                                                                                      
       FIN-BUSCA-RUT2. EXIT.                                                                                                                          
                                                                                                                                                      
       VALIDAR.                                                                                                                                       
      *--------                                                                                                                                       
           PERFORM LIMPIA-TODO                                                                                                                        
           MOVE ZEROES            TO DFH-REVOCA DFH-GRABAR DFH-IMPRIM                                                                                 
                                     DFH-ACTIVA DFH-SALIR                                                                                             
           MOVE SPACES            TO W-MENSAJE                                                                                                        
           MOVE DFH-ERROR         TO W-VALOR-ERROR                                                                                                    
                                                                                                                                                      
           PERFORM VALIDA-DATOS THRU FIN-VALIDA-DATOS                                                                                                 
           PERFORM COMPLETA-ENCABEZADO                                                                                                                
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF W-EXISTE = CT-SI                                                                                                                        
              IF DFH-CODEST NOT = SPACES                                                                                                              
                 MOVE CT-MDT-COD-EST   TO RQ-COD-TBL                                                                                                  
                 MOVE DFH-CODEST       TO RQ-VAL-TBL CODESTO                                                                                          
                 MOVE CT-REDKY         TO RQ-COM-TBL                                                                                                  
                 PERFORM LEE-TBL                                                                                                                      
                 IF RQ-RET-TBL = SPACES                                                                                                               
                    MOVE TBL-DES-COD   TO GLOESTO                                                                                                     
                 ELSE                                                                                                                                 
                    MOVE GL-NO-DEF     TO GLOESTO                                                                                                     
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
              MOVE DFH-NUMERO TO NUMEROO                                                                                                              
              PERFORM PRIMERA-PAGINA                                                                                                                  
              IF W-VIGTE = CT-NO                                                                                                                      
                 MOVE GL-EXI-MAND-NO-VIG  TO W-MENSAJE                                                                                                
              ELSE                                                                                                                                    
                 MOVE GL-EXI-MAND-NO-TER  TO W-MENSAJE                                                                                                
              END-IF                                                                                                                                  
           ELSE                                                                                                                                       
                 MOVE CT-1XX           TO CODESTO DFH-CODEST                                                                                          
                 MOVE CT-VIGENTE2      TO GLOESTO                                                                                                     
              END-IF                                                                                                                                  
              MOVE GL-INF-CRC          TO W-MENSAJE                                                                                                   
                                                                                                                                                      
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       VALIDA-DATOS.                                                                                                                                  
      *-------------                                                                                                                                  
           MOVE SPACE   TO W-VALOR-ERROR                                                                                                              
           MOVE CT-NO   TO W-EXISTE                                                                                                                   
           MOVE CT-NO   TO W-VIGTE                                                                                                                    
                                                                                                                                                      
                                                                                                                                                      
           IF FECSOLI = SPACES OR LOW-VALUES                                                                                                          
              EXEC CICS ASKTIME ABSTIME (W-A1) END-EXEC                                                                                               
              EXEC CICS FORMATTIME ABSTIME (W-A1)                                                                                                     
                                   FULLDATE(FECSOLO)                                                                                                  
                                   DATESEP (CT-SLASH)                                                                                                 
                                   END-EXEC                                                                                                           
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF (FECSOLI  = SPACES OR LOW-VALUES) OR                                                                                                    
              (TPOCTAI  = SPACES OR LOW-VALUES) OR                                                                                                    
              (CUENTAI  = SPACES OR LOW-VALUES) OR                                                                                                    
EMI02        ((NUMRUT1I = SPACES OR LOW-VALUES  OR                                                                                                    
EMI02          DIGRUT1I = SPACES OR LOW-VALUES) AND                                                                                                   
EMI02         (TPOCTAI NOT = CT-CRUT))                                                                                                                
              IF FECSOLI  = SPACES OR LOW-VALUES                                                                                                      
                 MOVE CT-6X                 TO W-VALOR-ERROR                                                                                          
                 MOVE GL-ING-FEC-SOL        TO W-MENSAJE                                                                                              
              ELSE                                                                                                                                    
                 IF TPOCTAI  = SPACES OR LOW-VALUES                                                                                                   
                    MOVE CT-2X              TO W-VALOR-ERROR                                                                                          
                    MOVE GL-ING-TIP-CTA     TO W-MENSAJE                                                                                              
                 ELSE                                                                                                                                 
                    IF CUENTAI  = SPACES OR LOW-VALUES                                                                                                
                       MOVE CT-3X           TO W-VALOR-ERROR                                                                                          
                       MOVE GL-ING-NUM-CTA  TO W-MENSAJE                                                                                              
                    ELSE                                                                                                                              
                       IF NUMRUT1I  = SPACES OR LOW-VALUES                                                                                            
                          MOVE CT-4X             TO W-VALOR-ERROR                                                                                     
                          MOVE GL-ING-NUM-RUT1   TO W-MENSAJE                                                                                         
                       ELSE                                                                                                                           
                          MOVE CT-5X             TO W-VALOR-ERROR                                                                                     
                          MOVE GL-ING-DIG-RUT1   TO W-MENSAJE                                                                                         
                       END-IF                                                                                                                         
                    END-IF                                                                                                                            
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
              GO TO FIN-VALIDA-DATOS.                                                                                                                 
                                                                                                                                                      
                                                                                                                                                      
           PERFORM VALIDA-FECHA THRU FIN-VALIDA-FECHA                                                                                                 
                                                                                                                                                      
EMI02      IF TPOCTAI = CT-CRUT                                                                                                                       
EMI02         PERFORM VALIDA-CTARUT THRU FIN-VALIDA-CTARUT                                                                                            
EMI02      ELSE                                                                                                                                       
VOY           PERFORM VALIDA-CUENTA THRU FIN-VALIDA-CUENTA                                                                                            
           END-IF                                                                                                                                     
EMI02<     IF TPOCTAI = CT-CTV                                                                                                                        
              MOVE DFH-CUENTA     TO WS-CUENTA                                                                                                        
              MOVE SPACES         TO COM-RUT                                                                                                          
              MOVE WS-CUENTA      TO COM-CTA                                                                                                          
              PERFORM LLAMA-CTARUT                                                                                                                    
              IF COM-RET = ZEROES                                                                                                                     
                 MOVE CT-CRUT     TO DFH-TPOCTA                                                                                                       
                 MOVE COM-CTA     TO DFH-CUENTA                                                                                                       
              END-IF                                                                                                                                  
EMI02>     END-IF                                                                                                                                     
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO FIN-VALIDA-DATOS.                                                                                                                 
                                                                                                                                                      
EMI02      IF TPOCTAI NOT = CT-CRUT                                                                                                                   
             PERFORM VALIDA-RUT1 THRU FIN-VALIDA-RUT1                                                                                                 
EMI02      END-IF                                                                                                                                     
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO FIN-VALIDA-DATOS.                                                                                                                 
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO FIN-VALIDA-DATOS.                                                                                                                 
                                                                                                                                                      
           IF NUMRUT2I NOT = SPACES AND NOT = LOW-VALUES                                                                                              
              PERFORM VALIDA-RUT2 THRU FIN-VALIDA-RUT2                                                                                                
              IF W-SW-RUT = CT-1                                                                                                                      
                 MOVE DFH-NUMRUT2      TO W-NUMRUT-AUX                                                                                                
                 MOVE DFH-DIGRUT2      TO W-DIGRUT-AUX                                                                                                
                 MOVE DFH-NUMRUT1      TO DFH-NUMRUT2                                                                                                 
                                          NUMRUT2O                                                                                                    
                 MOVE DFH-DIGRUT1      TO DFH-DIGRUT2                                                                                                 
                                          DIGRUT2O                                                                                                    
                 MOVE W-NUMRUT-AUX     TO DFH-NUMRUT1                                                                                                 
                                          NUMRUT1O                                                                                                    
                 MOVE W-DIGRUT-AUX     TO DFH-DIGRUT1                                                                                                 
                                          DIGRUT1O                                                                                                    
                 MOVE NOMBRE1O         TO NOMBRE2O                                                                                                    
                 PERFORM RESCATA-NOMBRE1                                                                                                              
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO FIN-VALIDA-DATOS.                                                                                                                 
                                                                                                                                                      
EMI02      IF DFH-TPOCTA = CT-CRUT                                                                                                                    
EMI02         MOVE CT-CTV              TO W-PRO-UNO-ROP                                                                                               
EMI02      ELSE                                                                                                                                       
              MOVE DFH-TPOCTA          TO W-PRO-UNO-ROP                                                                                               
EMI02      END-IF                                                                                                                                     
           MOVE DFH-CUENTA             TO W-OPE-UNO-ROP                                                                                               
           MOVE CT-MDT                 TO W-PRO-DOS-ROP                                                                                               
           MOVE SPACES                 TO W-OPE-DOS-ROP                                                                                               
           MOVE W-ROP00-ROP01          TO RQ-KEY-VAL-ROP                                                                                              
           MOVE CT-ROP01               TO RQ-KEY-ROP                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-ROP                                                                                                  
           MOVE SPACES                 TO RQ-RET-ROP                                                                                                  
                                                                                                                                                      
           PERFORM EXISTE-MANDATO THRU FIN-EXISTE-MANDATO                                                                                             
             UNTIL RQ-RET-ROP = CT-14X.                                                                                                               
                                                                                                                                                      
                                                                                                                                                      
                                                                                                                                                      
       FIN-VALIDA-DATOS. EXIT.                                                                                                                        
                                                                                                                                                      
       VALIDA-CUENTA.                                                                                                                                 
      *--------------                                                                                                                                 
           MOVE CT-MDT-TIP-CTA-CAR     TO RQ-COD-TBL                                                                                                  
           MOVE TPOCTAI                TO RQ-VAL-TBL                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-TBL                                                                                                  
           PERFORM LEE-TBL                                                                                                                            
           IF RQ-RET-TBL = CT-14X                                                                                                                     
              MOVE GL-TIP-CTA-NO-CORR  TO W-MENSAJE                                                                                                   
              MOVE CT-2X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-CUENTA.                                                                                                                
                                                                                                                                                      
EMI        IF TPOCTAI = CT-TCR                                                                                                                        
              EXEC CICS BIF DEEDIT FIELD(CUENTAI)                                                                                                     
                                   LENGTH(CT-LARGO-9)                                                                                                 
              END-EXEC                                                                                                                                
              MOVE SPACES              TO CUENTAI(CT-10:CT-10)                                                                                        
                                          CUENTAO(CT-10:CT-10)                                                                                        
           ELSE                                                                                                                                       
              EXEC CICS BIF DEEDIT FIELD(CUENTAI)                                                                                                     
                                   LENGTH(CT-LARGO-11)                                                                                                
              END-EXEC                                                                                                                                
              MOVE SPACES              TO CUENTAI(CT-12:CT-8)                                                                                         
                                          CUENTAO(CT-12:CT-8)                                                                                         
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE TPOCTAI                TO DFH-TPOCTA                                                                                                  
           MOVE CUENTAI                TO DFH-CUENTA                                                                                                  
           MOVE SPACES                 TO DFH-TIP-CTA-AHO                                                                                             
EMI        IF DFH-TPOCTA = CT-AHO                                                                                                                     
              MOVE DFH-CUENTA          TO RQ-KEY-VAL-OPA                                                                                              
              PERFORM ACCESA-OPA                                                                                                                      
              IF RQ-RET-OPA = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI    TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-VALIDA-CUENTA                                                                                                              
              END-IF                                                                                                                                  
              IF OPA-FEC-CRR NOT = ZEROES                                                                                                             
                 MOVE GL-CTA-NO-VIG    TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-VALIDA-CUENTA                                                                                                              
              END-IF                                                                                                                                  
              MOVE SPR-COD OF E-AHR-OPE-01  TO WS-SW-CTA-AHO                                                                                          
              IF WS-SW-CTA-AHO-OK                                                                                                                     
                 MOVE WS-SW-CTA-AHO    TO DFH-TIP-CTA-AHO                                                                                             
              ELSE                                                                                                                                    
                 MOVE GL-TIP-CTA-NO-VAL     TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-CUENTA                                                                                                              
              END-IF                                                                                                                                  
              PERFORM LEER-AHOMTAB                                                                                                                    
              MOVE CT-999X             TO DFH-MONCTA                                                                                                  
           ELSE                                                                                                                                       
              MOVE DFH-TPOCTA          TO RQ-PRO-OPE                                                                                                  
              MOVE DFH-CUENTA          TO RQ-OPE-OPE                                                                                                  
              MOVE CT-REDKY            TO RQ-COM-OPE                                                                                                  
              PERFORM ACCESA-OPE                                                                                                                      
              IF RQ-RET-OPE = CT-14X                                                                                                                  
                 MOVE GL-CTA-NO-EXI    TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-VALIDA-CUENTA                                                                                                              
VOY           END-IF                                                                                                                                  
EMI           IF OPE-COD-STAT NOT = CT-VIG AND NOT = CT-1XX                                                                                           
EMI              IF DFH-TPOCTA = CT-TCR                                                                                                               
                    MOVE GL-REV-EST-TARJ    TO W-MENSAJE                                                                                              
                 ELSE                                                                                                                                 
                    MOVE GL-CTA-NO-VIG      TO W-MENSAJE                                                                                              
                 END-IF                                                                                                                               
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-CUENTA                                                                                                              
              END-IF                                                                                                                                  
              IF OPE-MON NOT = ZERO AND NOT = CT-999                                                                                                  
                 MOVE GL-MON-CTA-NO-PES     TO W-MENSAJE                                                                                              
                 MOVE CT-3X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-CUENTA                                                                                                              
              END-IF                                                                                                                                  
              MOVE OPE-COD-OFI         TO DFH-OFICTA                                                                                                  
              IF OPE-MON = ZERO                                                                                                                       
                 MOVE CT-999X          TO DFH-MONCTA                                                                                                  
              ELSE                                                                                                                                    
                 MOVE OPE-MON          TO DFH-MONCTA                                                                                                  
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-VALIDA-CUENTA. EXIT.                                                                                                                       
                                                                                                                                                      
       LLAMA-CTARUT.                                                                                                                                  
      *-------------                                                                                                                                  
           EXEC CICS LINK PROGRAM      (CT-PACV008)                                                                                                   
                          COMMAREA     (COM-CTARUT)                                                                                                   
                          LENGTH       (CT-LARGO-33)                                                                                                  
           END-EXEC                                                                                                                                   
           EVALUATE COM-RET                                                                                                                           
              WHEN ZEROES                                                                                                                             
                 MOVE COM-CTA          TO DFH-CUENTA                                                                                                  
                 MOVE COM-RUT          TO DFH-NUMRUT1                                                                                                 
                 MOVE COM-DRT          TO DFH-DIGRUT1                                                                                                 
              WHEN CT-100                                                                                                                             
                 CONTINUE                                                                                                                             
              WHEN OTHER                                                                                                                              
                 STRING  GL-ERR-CTA-RUT  COM-RET                                                                                                      
                 DELIMITED BY SIZE INTO W-MENSAJE                                                                                                     
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
           END-EVALUATE.                                                                                                                              
                                                                                                                                                      
       VALIDA-CTARUT.                                                                                                                                 
      *--------------                                                                                                                                 
           EXEC CICS BIF DEEDIT FIELD(CUENTAI)                                                                                                        
                                LENGTH(CT-LARGO-9)                                                                                                    
           END-EXEC                                                                                                                                   
           MOVE SPACES                 TO CUENTAI(CT-10:CT-11)                                                                                        
                                          CUENTAO(CT-10:CT-11)                                                                                        
           MOVE TPOCTAI                TO DFH-TPOCTA                                                                                                  
           MOVE CUENTAI                TO COM-RUT                                                                                                     
           MOVE SPACES                 TO COM-CTA                                                                                                     
           PERFORM LLAMA-CTARUT                                                                                                                       
           EVALUATE COM-RET                                                                                                                           
              WHEN ZEROES                                                                                                                             
                 MOVE COM-CTA          TO DFH-CUENTA                                                                                                  
                 MOVE COM-RUT          TO DFH-NUMRUT1                                                                                                 
                 MOVE COM-DRT          TO DFH-DIGRUT1                                                                                                 
              WHEN CT-100                                                                                                                             
                 MOVE GL-RUT-SIN-CTA   TO W-MENSAJE                                                                                                   
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-VALIDA-CTARUT                                                                                                              
              WHEN OTHER                                                                                                                              
                 STRING  GL-ERR-CTA-RUT  COM-RET                                                                                                      
                 DELIMITED BY SIZE INTO W-MENSAJE                                                                                                     
                 MOVE CT-3X            TO W-VALOR-ERROR                                                                                               
                 GO TO FIN-VALIDA-CTARUT                                                                                                              
           END-EVALUATE                                                                                                                               
           MOVE SPACES                 TO DFH-TIP-CTA-AHO                                                                                             
           MOVE CT-CTV                 TO RQ-PRO-OPE                                                                                                  
           MOVE DFH-CUENTA             TO RQ-OPE-OPE                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE GL-CTA-NO-EXI       TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-CTARUT                                                                                                                 
           END-IF                                                                                                                                     
EMI        IF OPE-COD-STAT NOT = CT-VIG AND NOT = CT-1XX                                                                                              
              MOVE GL-CTA-NO-VIG       TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-CTARUT                                                                                                                 
           END-IF                                                                                                                                     
           IF OPE-MON NOT = ZERO AND NOT = CT-999                                                                                                     
              MOVE GL-MON-CTA-NO-PES   TO W-MENSAJE                                                                                                   
              MOVE CT-3X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-CTARUT                                                                                                                 
           END-IF                                                                                                                                     
           MOVE OPE-COD-OFI            TO DFH-OFICTA                                                                                                  
           IF OPE-MON = ZERO                                                                                                                          
              MOVE CT-999X             TO DFH-MONCTA                                                                                                  
           ELSE                                                                                                                                       
              MOVE OPE-MON             TO DFH-MONCTA                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-VALIDA-CTARUT. EXIT.                                                                                                                       
                                                                                                                                                      
       VALIDA-FECHA.                                                                                                                                  
      *-------------                                                                                                                                  
           IF FECSOLI = SPACES                                                                                                                        
              MOVE ZEROES   TO W-FECHA-DMA                                                                                                            
           ELSE                                                                                                                                       
              MOVE FECSOLI  TO W-FECHA-DMA                                                                                                            
           END-IF                                                                                                                                     
                                                                                                                                                      
           EXEC CICS BIF DEEDIT FIELD(W-FECHA-DMA)                                                                                                    
                                LENGTH(CT-LARGO-10)                                                                                                   
           END-EXEC                                                                                                                                   
                                                                                                                                                      
           MOVE ZEROES                      TO COM-TEGR9-INDICADOR                                                                                    
           MOVE W-DIA-DMA                   TO COM-TGR9-DIA                                                                                           
           MOVE W-MES-DMA                   TO COM-TGR9-MES                                                                                           
           MOVE W-ANO-DMA                   TO COM-TGR9-ANO                                                                                           
                                                                                                                                                      
           IF COM-TEGR9-FECHA NOT = ZEROES                                                                                                            
                                                                                                                                                      
              EXEC  CICS LINK PROGRAM  (CT-TEGR009)                                                                                                   
                              COMMAREA (COM-TEGR009)                                                                                                  
                              LENGTH   (LENGTH OF COM-TEGR009)                                                                                        
              END-EXEC                                                                                                                                
                                                                                                                                                      
              IF COM-TEGR9-INDICADOR NOT = ZEROES                                                                                                     
                 MOVE GL-FEC-SOL-INC      TO W-MENSAJE                                                                                                
                 MOVE CT-6X               TO W-VALOR-ERROR                                                                                            
                 GO TO FIN-VALIDA-FECHA                                                                                                               
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE W-DIA-DMA  TO DIA-LINK W-DIA-SOL                                                                                                      
           MOVE W-MES-DMA  TO MES-LINK W-MES-SOL                                                                                                      
           MOVE W-ANO-DMA  TO ANO-LINK W-ANO-SOL                                                                                                      
           MOVE ZEROES     TO NUMERO-LINK                                                                                                             
           MOVE ZEROES     TO DIASEM-LINK                                                                                                             
           EXEC CICS LINK PROGRAM(CT-TEGR010)                                                                                                         
                          COMMAREA(PRM-LINK-FECHA)                                                                                                    
                          LENGTH(CT-LARGO-16)                                                                                                         
           END-EXEC                                                                                                                                   
                                                                                                                                                      
           IF W-F-DMA NOT = FECHA-LINK                                                                                                                
              MOVE GL-FEC-SOL-INC      TO W-MENSAJE                                                                                                   
              MOVE CT-6X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-FECHA.                                                                                                                 
                                                                                                                                                      
           IF DIASEM-LINK < CT-1 OR                                                                                                                   
              DIASEM-LINK > CT-5                                                                                                                      
              MOVE GL-FEC-SOL-NO-VAL   TO W-MENSAJE                                                                                                   
              MOVE CT-6X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-FECHA.                                                                                                                 
                                                                                                                                                      
           EXEC CICS ASKTIME ABSTIME (W-A1) END-EXEC                                                                                                  
           EXEC CICS FORMATTIME ABSTIME (W-A1)                                                                                                        
                                YYYYMMDD(W-F1)                                                                                                        
           END-EXEC                                                                                                                                   
                                                                                                                                                      
      *--> W-FECHA-SOL = FECHA SOLICITUD                                                                                                              
      *--> W-F1-AMD    = FECHA DEL DIA                                                                                                                
                                                                                                                                                      
           IF W-FECHA-SOL > W-F1-AMD                                                                                                                  
              MOVE GL-FEC-SOL-MEN-IGU  TO W-MENSAJE                                                                                                   
              MOVE CT-6X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-FECHA.                                                                                                                 
                                                                                                                                                      
           MOVE W-FECHA-SOL            TO DFH-FECSOL.                                                                                                 
                                                                                                                                                      
       FIN-VALIDA-FECHA. EXIT.                                                                                                                        
                                                                                                                                                      
      *                                                                                                                                               
       VALIDA-RUT1.                                                                                                                                   
      *-----------                                                                                                                                    
           EXEC CICS BIF DEEDIT FIELD(NUMRUT1I)                                                                                                       
                                LENGTH(CT-LARGO-9)                                                                                                    
           END-EXEC                                                                                                                                   
                                                                                                                                                      
           MOVE NUMRUT1O                    TO W-NUMRUT                                                                                               
           PERFORM VALIDA-DIGITO                                                                                                                      
           IF W-DIG-VER NOT = DIGRUT1O                                                                                                                
              MOVE GL-DIG-INC               TO W-MENSAJE                                                                                              
              MOVE CT-5X                    TO W-VALOR-ERROR                                                                                          
              GO TO FIN-VALIDA-RUT1.                                                                                                                  
                                                                                                                                                      
           MOVE NUMRUT1I                    TO RQ-NUM-CLI                                                                                             
           MOVE DIGRUT1I                    TO RQ-DIG-CLI                                                                                             
           PERFORM LEE-CLI                                                                                                                            
           IF RQ-RET = SPACES                                                                                                                         
              MOVE CLI-RUT    OF E-CLI-01   TO DFH-NUMRUT1                                                                                            
              MOVE CLI-RUT-DV OF E-CLI-01   TO DFH-DIGRUT1                                                                                            
           ELSE                                                                                                                                       
EMI           IF DFH-TPOCTA = CT-AHO                                                                                                                  
                 MOVE NUMRUT1I              TO RQ-RUT-CLA                                                                                             
                 MOVE DIGRUT1I              TO RQ-DRT-CLA                                                                                             
                 PERFORM ACCESA-CLA                                                                                                                   
                 IF RQ-RET-CLA = CT-14X                                                                                                               
                    MOVE GL-RUT1-NO-CLI     TO W-MENSAJE                                                                                              
                    MOVE CT-4X              TO W-VALOR-ERROR                                                                                          
                    GO TO FIN-VALIDA-RUT1                                                                                                             
                 END-IF                                                                                                                               
                 MOVE CLA-NRT OF E-AHR-CLI-01  TO DFH-NUMRUT1                                                                                         
                 MOVE CLA-DRT OF E-AHR-CLI-01  TO DFH-DIGRUT1                                                                                         
                 INITIALIZE PRM-BCCE040                                                                                                               
                 MOVE DFH-NUMRUT1              TO BCC-RUT                                                                                             
                 MOVE DFH-DIGRUT1              TO BCC-RUT-DV                                                                                          
                 MOVE DFH-OFICTA               TO BCC-OFI                                                                                             
                 MOVE DFH-FECSOL(CT-1:CT-4)    TO BCC-FEC(CT-5:CT-4)                                                                                  
                 MOVE DFH-FECSOL(CT-5:CT-2)    TO BCC-FEC(CT-3:CT-2)                                                                                  
                 MOVE DFH-FECSOL(CT-7:CT-2)    TO BCC-FEC(CT-1:CT-2)                                                                                  
                 EXEC CICS LINK PROGRAM(CT-BCCE040)                                                                                                   
                      COMMAREA(PRM-BCCE040)                                                                                                           
                      LENGTH(CT-LARGO-43)                                                                                                             
                 END-EXEC                                                                                                                             
                 IF BCC-RET NOT = ZEROES                                                                                                              
                    MOVE CT-B               TO W-VALOR-ERROR                                                                                          
                    MOVE BCC-RET            TO ERR-BCC-RET                                                                                            
                    MOVE BCC-CMN            TO ERR-BCC-CMN                                                                                            
                    MOVE W-MSJ-BCC          TO W-MENSAJE                                                                                              
                    GO TO ENVIAR-MAPA                                                                                                                 
                 END-IF                                                                                                                               
              ELSE                                                                                                                                    
                 MOVE GL-RUT1-NO-CLI        TO W-MENSAJE                                                                                              
                 MOVE CT-4X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT1                                                                                                                
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE ZEROES                      TO W-SW-RUT                                                                                               
                                                                                                                                                      
EMI        IF DFH-TPOCTA = CT-AHO                                                                                                                     
              MOVE DFH-CUENTA               TO RQ-OPE-NUM-RCA                                                                                         
              MOVE DFH-NUMRUT1              TO RQ-RUT-CLI-RCA                                                                                         
              MOVE DFH-DIGRUT1              TO RQ-DRT-CLI-RCA                                                                                         
                                                                                                                                                      
              PERFORM ACCESA-RCA                                                                                                                      
              IF RQ-RET-RCA = CT-14X                                                                                                                  
                 MOVE GL-REL-MAND1-NOEXI    TO W-MENSAJE                                                                                              
                 MOVE CT-4X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT1                                                                                                                
              END-IF                                                                                                                                  
              IF RCA-EST-REL  NOT = SPACES                                                                                                            
                 MOVE GL-REL-MAND1-NOVIG    TO W-MENSAJE                                                                                              
                 MOVE CT-4X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT1                                                                                                                
              END-IF                                                                                                                                  
              IF COD-TIP-REL = CT-TIT OR CT-TI1 OR CT-TI2                                                                                             
                 CONTINUE                                                                                                                             
              ELSE                                                                                                                                    
                 MOVE GL-REL-MAND1-SOLTIT   TO W-MENSAJE                                                                                              
                 MOVE CT-4X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT1                                                                                                                
              END-IF                                                                                                                                  
              IF COD-TIP-REL = CT-TI2                                                                                                                 
                 MOVE CT-1                  TO W-SW-RUT                                                                                               
              END-IF                                                                                                                                  
           ELSE                                                                                                                                       
EMI02         IF DFH-TPOCTA = CT-CRUT                                                                                                                 
EMI02            MOVE CT-CTV                TO W-PRO-RCO01                                                                                            
EMI02         ELSE                                                                                                                                    
                 MOVE DFH-TPOCTA            TO W-PRO-RCO01                                                                                            
EMI02         END-IF                                                                                                                                  
              MOVE DFH-CUENTA               TO W-OPE-RCO01                                                                                            
              MOVE DFH-NUMRUT1              TO W-RUT-RCO01                                                                                            
              MOVE W-RCO01                  TO RQ-KEY-VAL-RCO                                                                                         
              MOVE CT-RCO01                 TO RQ-KEY-RCO                                                                                             
              MOVE CT-REDKY                 TO RQ-COM-RCO                                                                                             
              MOVE SPACES                   TO RQ-RET-RCO                                                                                             
                                                                                                                                                      
              PERFORM LEE-RCO                                                                                                                         
              IF RQ-RET-RCO = CT-14X                                                                                                                  
                 MOVE GL-REL-MAND1-NOEXI    TO W-MENSAJE                                                                                              
                 MOVE CT-4X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT1                                                                                                                
              END-IF                                                                                                                                  
EMI           IF NOT (RCO-COD-RCOP = CT-TI1 OR CT-TI2 OR CT-TIT )                                                                                     
                 MOVE GL-RUT-MAND1-NOTIT1   TO W-MENSAJE                                                                                              
                 MOVE CT-4X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT1                                                                                                                
              END-IF                                                                                                                                  
              IF (RCO-COD-RCOP  = CT-TI2)                                                                                                             
                 MOVE CT-1                  TO W-SW-RUT                                                                                               
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-VALIDA-RUT1. EXIT.                                                                                                                         
                                                                                                                                                      
       VALIDA-DIGITO.                                                                                                                                 
      *-------------                                                                                                                                  
           COMPUTE W-SUMA = W-DIG(CT-9) * CT-2 +                                                                                                      
                            W-DIG(CT-8) * CT-3 +                                                                                                      
                            W-DIG(CT-7) * CT-4 +                                                                                                      
                            W-DIG(CT-6) * CT-5 +                                                                                                      
                            W-DIG(CT-5) * CT-6 +                                                                                                      
                            W-DIG(CT-4) * CT-7 +                                                                                                      
                            W-DIG(CT-3) * CT-2 +                                                                                                      
                            W-DIG(CT-2) * CT-3 +                                                                                                      
                            W-DIG(CT-1) * CT-4                                                                                                        
                                                                                                                                                      
           COMPUTE W-RESTO = W-SUMA / CT-11                                                                                                           
                                                                                                                                                      
           COMPUTE W-VALOR-DIG = CT-11 - (W-SUMA - (W-RESTO * CT-11))                                                                                 
                                                                                                                                                      
           IF W-VALOR-DIG = CT-10                                                                                                                     
              MOVE CT-K                TO W-DIG-VER                                                                                                   
           ELSE                                                                                                                                       
              IF W-VALOR-DIG = CT-11                                                                                                                  
                 MOVE CT-0X            TO W-DIG-VER                                                                                                   
              ELSE                                                                                                                                    
                 COMPUTE W-DIG-VER-N = W-VALOR-DIG                                                                                                    
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       VALIDA-RUT2.                                                                                                                                   
      *-----------                                                                                                                                    
           EXEC CICS BIF DEEDIT FIELD(NUMRUT2I)                                                                                                       
                                LENGTH(CT-LARGO-9)                                                                                                    
           END-EXEC                                                                                                                                   
                                                                                                                                                      
           MOVE NUMRUT2O               TO W-NUMRUT                                                                                                    
           PERFORM VALIDA-DIGITO                                                                                                                      
           IF W-DIG-VER NOT = DIGRUT2O                                                                                                                
              MOVE GL-DIG-INC          TO W-MENSAJE                                                                                                   
              MOVE CT-8X               TO W-VALOR-ERROR                                                                                               
              GO TO FIN-VALIDA-RUT2.                                                                                                                  
                                                                                                                                                      
           MOVE NUMRUT2I               TO RQ-NUM-CLI                                                                                                  
           MOVE DIGRUT2I               TO RQ-DIG-CLI                                                                                                  
           PERFORM LEE-CLI                                                                                                                            
           IF RQ-RET = SPACES                                                                                                                         
              MOVE CLI-RUT    OF E-CLI-01   TO DFH-NUMRUT2                                                                                            
              MOVE CLI-RUT-DV OF E-CLI-01   TO DFH-DIGRUT2                                                                                            
           ELSE                                                                                                                                       
EMI           IF DFH-TPOCTA = CT-AHO                                                                                                                  
                 MOVE NUMRUT2I              TO RQ-RUT-CLA                                                                                             
                 MOVE DIGRUT2I              TO RQ-DRT-CLA                                                                                             
                 PERFORM ACCESA-CLA                                                                                                                   
                 IF RQ-RET-CLA = SPACES                                                                                                               
                    MOVE CLA-NRT OF E-AHR-CLI-01 TO DFH-NUMRUT2                                                                                       
                    MOVE CLA-DRT OF E-AHR-CLI-01 TO DFH-DIGRUT2                                                                                       
                 ELSE                                                                                                                                 
                    MOVE GL-RUT-MAND2-NOTIT      TO W-MENSAJE                                                                                         
                    MOVE CT-7X                   TO W-VALOR-ERROR                                                                                     
                    GO TO FIN-VALIDA-RUT2                                                                                                             
                 END-IF                                                                                                                               
                 INITIALIZE PRM-BCCE040                                                                                                               
                 MOVE DFH-NUMRUT2           TO BCC-RUT                                                                                                
                 MOVE DFH-DIGRUT2           TO BCC-RUT-DV                                                                                             
                 MOVE DFH-OFICTA            TO BCC-OFI                                                                                                
                 MOVE DFH-FECSOL(CT-1:CT-4) TO BCC-FEC(CT-5:CT-4)                                                                                     
                 MOVE DFH-FECSOL(CT-5:CT-2) TO BCC-FEC(CT-3:CT-2)                                                                                     
                 MOVE DFH-FECSOL(CT-7:CT-2) TO BCC-FEC(CT-1:CT-2)                                                                                     
                 EXEC CICS LINK PROGRAM(CT-BCCE040)                                                                                                   
                        COMMAREA(PRM-BCCE040)                                                                                                         
                        LENGTH(CT-LARGO-43)                                                                                                           
                 END-EXEC                                                                                                                             
                 IF BCC-RET NOT = ZEROES                                                                                                              
                    MOVE CT-B               TO W-VALOR-ERROR                                                                                          
                    MOVE BCC-RET            TO ERR-BCC-RET                                                                                            
                    MOVE BCC-CMN            TO ERR-BCC-CMN                                                                                            
                    MOVE W-MSJ-BCC          TO W-MENSAJE                                                                                              
                    GO TO ENVIAR-MAPA                                                                                                                 
                 END-IF                                                                                                                               
              ELSE                                                                                                                                    
                 MOVE GL-RUT-MAND2-NOTIT    TO W-MENSAJE                                                                                              
                 MOVE CT-7X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT2                                                                                                                
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
EMI        IF DFH-TPOCTA = CT-AHO                                                                                                                     
              MOVE DFH-CUENTA          TO RQ-OPE-NUM-RCA                                                                                              
              MOVE DFH-NUMRUT2         TO RQ-RUT-CLI-RCA                                                                                              
              MOVE DFH-DIGRUT2         TO RQ-DRT-CLI-RCA                                                                                              
                                                                                                                                                      
              PERFORM ACCESA-RCA                                                                                                                      
              IF RQ-RET-RCA = CT-14X                                                                                                                  
                 MOVE GL-REL-MAND2-NOEXI    TO W-MENSAJE                                                                                              
                 MOVE CT-7                  TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT2                                                                                                                
              END-IF                                                                                                                                  
              IF COD-TIP-REL  = SPACES                                                                                                                
                 MOVE GL-REL-MAND2-NOVIG    TO W-MENSAJE                                                                                              
                 MOVE CT-7X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT2                                                                                                                
              END-IF                                                                                                                                  
           ELSE                                                                                                                                       
EMI02         IF DFH-TPOCTA = CT-CRUT                                                                                                                 
EMI02            MOVE CT-CTV           TO W-PRO-RCO01                                                                                                 
EMI02         ELSE                                                                                                                                    
                 MOVE DFH-TPOCTA       TO W-PRO-RCO01                                                                                                 
EMI02         END-IF                                                                                                                                  
              MOVE DFH-CUENTA          TO W-OPE-RCO01                                                                                                 
              MOVE DFH-RUT2            TO W-RUT-RCO01                                                                                                 
              MOVE W-RCO01             TO RQ-KEY-VAL-RCO                                                                                              
              MOVE CT-RCO01            TO RQ-KEY-RCO                                                                                                  
              MOVE CT-REDKY            TO RQ-COM-RCO                                                                                                  
              MOVE SPACES              TO RQ-RET-RCO                                                                                                  
              PERFORM LEE-RCO                                                                                                                         
              IF RQ-RET-RCO = CT-14X                                                                                                                  
                 MOVE GL-REL-MAND1-NOEXI    TO W-MENSAJE                                                                                              
                 MOVE CT-7X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT2                                                                                                                
              END-IF                                                                                                                                  
              IF  (RCO-COD-RCOP NOT = CT-TI2)                                                                                                         
              AND (RCO-COD-RCOP NOT = CT-TI1)                                                                                                         
                 MOVE GL-RUT-MAND2-NOTIT2   TO W-MENSAJE                                                                                              
                 MOVE CT-7X                 TO W-VALOR-ERROR                                                                                          
                 GO TO FIN-VALIDA-RUT2                                                                                                                
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       FIN-VALIDA-RUT2. EXIT.                                                                                                                         
                                                                                                                                                      
       EXISTE-MANDATO.                                                                                                                                
      *---------------                                                                                                                                
           PERFORM LEE-ROP                                                                                                                            
           IF RQ-RET-ROP = CT-14X                                                                                                                     
              GO TO FIN-EXISTE-MANDATO.                                                                                                               
                                                                                                                                                      
           MOVE ROP-NUM-OPE            TO W-OPERACION                                                                                                 
           MOVE W-NUM-11               TO DFH-NUMERO                                                                                                  
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-OPE                                                                                                  
           MOVE ROP-NUM-OPE            TO RQ-OPE-OPE                                                                                                  
           MOVE CT-REDKY               TO RQ-COM-OPE                                                                                                  
           PERFORM ACCESA-OPE                                                                                                                         
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE CT-14X              TO RQ-RET-ROP                                                                                                  
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              MOVE GL-NO-EXI-MAND      TO W-MENSAJE                                                                                                   
              GO TO FIN-EXISTE-MANDATO.                                                                                                               
                                                                                                                                                      
           MOVE CT-SI                  TO W-EXISTE                                                                                                    
                                                                                                                                                      
           IF OPE-COD-STAT NOT = CT-3XX                                                                                                               
              MOVE CT-SI               TO W-VIGTE                                                                                                     
           END-IF                                                                                                                                     
           MOVE OPE-COD-STAT           TO DFH-CODEST                                                                                                  
           MOVE OPE-FEC-FTOP           TO DFH-FECSOL                                                                                                  
           MOVE OPE-FEC-FROP           TO DFH-FECEST                                                                                                  
EMI01      IF EIBAID = DFHPF9                                                                                                                         
EMI01         MOVE W-F1-AMD            TO DFH-FECSOL                                                                                                  
EMI01      END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE CT-REDNX               TO RQ-COM-ROP.                                                                                                 
                                                                                                                                                      
       FIN-EXISTE-MANDATO. EXIT.                                                                                                                      
                                                                                                                                                      
       INGRESAR.                                                                                                                                      
      *---------                                                                                                                                      
           MOVE ZEROES                 TO DFH-REVOCA DFH-IMPRIM                                                                                       
                                          DFH-ACTIVA DFH-SALIR                                                                                        
           MOVE SPACES                 TO W-MENSAJE                                                                                                   
           MOVE DFH-ERROR              TO W-VALOR-ERROR                                                                                               
                                                                                                                                                      
           MOVE SPACE                  TO W-VALOR-ERROR                                                                                               
                                          W-VALOR-CAMBIO                                                                                              
                                                                                                                                                      
           IF NUMEROI = SPACES OR = LOW-VALUES                                                                                                        
              MOVE ZEROES              TO NUMEROI                                                                                                     
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF NUMEROI NOT = ZEROS                                                                                                                     
              MOVE ZEROES              TO DFH-GRABAR                                                                                                  
              MOVE GL-NUM-IGU-0        TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE ZEROS                  TO DFH-NUMERO NUMEROO                                                                                          
                                                                                                                                                      
           PERFORM REVISA-PANEL THRU FIN-REVISA-PANEL                                                                                                 
                                                                                                                                                      
           IF NOT SIN-CAMBIO                                                                                                                          
              MOVE ZEROES              TO DFH-GRABAR                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           PERFORM VALIDA-DATOS THRU FIN-VALIDA-DATOS                                                                                                 
           PERFORM COMPLETA-ENCABEZADO                                                                                                                
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              MOVE ZEROES              TO DFH-GRABAR                                                                                                  
              GO TO ENVIAR-MAPA                                                                                                                       
           END-IF                                                                                                                                     
                                                                                                                                                      
           IF (W-EXISTE = CT-SI) AND (W-VIGTE = CT-SI)                                                                                                
              MOVE ZEROES              TO DFH-GRABAR                                                                                                  
              MOVE DFH-NUMERO          TO NUMEROO                                                                                                     
              PERFORM PRIMERA-PAGINA                                                                                                                  
              MOVE GL-EXI-MAND-NO-TER  TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA                                                                                                                       
           ELSE                                                                                                                                       
              MOVE ZEROS               TO DFH-NUMERO                                                                                                  
              MOVE ZEROS               TO NUMEROO                                                                                                     
           END-IF                                                                                                                                     
                                                                                                                                                      
              MOVE CT-1XX              TO CODESTO DFH-CODEST                                                                                          
              MOVE GL-VIGENTE          TO GLOESTO                                                                                                     
                                                                                                                                                      
           PERFORM LIMPIA-LINEAS                                                                                                                      
                                                                                                                                                      
           IF DFH-GRABAR NOT > ZEROES                                                                                                                 
              MOVE CT-1                TO DFH-GRABAR                                                                                                  
              MOVE GL-CONF-GRA         TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           GO TO ACTIVAR-CDSE681.                                                                                                                     
                                                                                                                                                      
       PRIMERA-PAGINA.                                                                                                                                
      *---------------                                                                                                                                
           MOVE CT-MDT                 TO RQ-PRO-DET                                                                                                  
           MOVE DFH-NUMERO             TO RQ-OPE-DET                                                                                                  
           MOVE CT-99999               TO RQ-COR-DET                                                                                                  
           MOVE CT-REDKL               TO RQ-COM-DET                                                                                                  
           PERFORM ACCESA-DET                                                                                                                         
           IF RQ-RET-DET = CT-14X                                                                                                                     
              MOVE GL-MAND-NO-DET      TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE DET-CRV                TO DFH-ULTCOR                                                                                                  
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-DET                                                                                                  
           MOVE DFH-NUMERO             TO RQ-OPE-DET                                                                                                  
           MOVE ZEROES                 TO RQ-COR-DET                                                                                                  
           MOVE CT-REDKG               TO RQ-COM-DET                                                                                                  
           MOVE SPACES                 TO RQ-RET-DET                                                                                                  
                                                                                                                                                      
           MOVE ZEROES                 TO W-I                                                                                                         
           PERFORM LLENA-AVANZA THRU FIN-LLENA-AVANZA                                                                                                 
             UNTIL RQ-RET-DET = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF W-I = ZEROES                                                                                                                            
              MOVE GL-MAND-SIN-DET     TO W-MENSAJE                                                                                                   
              MOVE CT-1X               TO W-VALOR-ERROR                                                                                               
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF CORREL(CT-5) = SPACES OR LOW-VALUES                                                                                                     
              MOVE GL-NO-MAS-DET       TO W-MENSAJE                                                                                                   
           ELSE                                                                                                                                       
              MOVE CORREL(CT-5) TO W-CORRX                                                                                                            
              IF W-CORRN = DFH-ULTCOR                                                                                                                 
                 MOVE GL-NO-MAS-DET    TO W-MENSAJE                                                                                                   
              ELSE                                                                                                                                    
                 MOVE GL-MAS-DET       TO W-MENSAJE                                                                                                   
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE CORREL(CT-1)           TO DFH-CORUNO.                                                                                                 
                                                                                                                                                      
       AVANZA.                                                                                                                                        
      *-------                                                                                                                                        
           MOVE ZEROES       TO DFH-REVOCA DFH-GRABAR DFH-IMPRIM                                                                                      
                                DFH-ACTIVA DFH-SALIR                                                                                                  
           MOVE SPACES       TO W-MENSAJE                                                                                                             
           MOVE DFH-ERROR    TO W-VALOR-ERROR                                                                                                         
                                                                                                                                                      
           PERFORM REVISA-CAMBIOS THRU FIN-REVISA-CAMBIOS                                                                                             
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF CORREL(CT-5) = SPACES OR LOW-VALUES                                                                                                     
              MOVE GL-NO-MAS-DET       TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE CORREL(CT-5) TO W-CORRX                                                                                                               
           IF W-CORRN = DFH-ULTCOR                                                                                                                    
              MOVE GL-NO-MAS-DET       TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           COMPUTE W-CORRN = W-CORRN + CT-1                                                                                                           
                                                                                                                                                      
           MOVE CT-MDT            TO RQ-PRO-DET                                                                                                       
           MOVE DFH-NUMERO        TO RQ-OPE-DET                                                                                                       
           MOVE W-CORRN           TO RQ-COR-DET                                                                                                       
           MOVE CT-REDKG          TO RQ-COM-DET                                                                                                       
           MOVE SPACES            TO RQ-RET-DET                                                                                                       
                                                                                                                                                      
           MOVE ZEROES            TO W-I                                                                                                              
           PERFORM LLENA-AVANZA THRU FIN-LLENA-AVANZA                                                                                                 
             UNTIL W-I = CT-6                                                                                                                         
                OR RQ-RET-DET = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF CORREL(CT-5) = SPACES OR LOW-VALUES                                                                                                     
              MOVE GL-NO-MAS-DET       TO W-MENSAJE                                                                                                   
           ELSE                                                                                                                                       
              MOVE CORREL(CT-5)        TO W-CORRX                                                                                                     
              IF W-CORRN = DFH-ULTCOR                                                                                                                 
                 MOVE GL-NO-MAS-DET    TO W-MENSAJE                                                                                                   
              ELSE                                                                                                                                    
                 MOVE GL-MAS-DET       TO W-MENSAJE                                                                                                   
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       LIMPIA-LINEAS.                                                                                                                                 
      *--------------                                                                                                                                 
           MOVE SPACES       TO LINEA(CT-1) LINEA(CT-2) LINEA(CT-3)                                                                                   
           MOVE SPACES       TO LINEA(CT-4) LINEA(CT-5) LINEA(CT-6).                                                                                  
                                                                                                                                                      
       LLENA-AVANZA.                                                                                                                                  
      *-------------                                                                                                                                  
           PERFORM ACCESA-DET                                                                                                                         
           IF RQ-RET-DET = CT-14X                                                                                                                     
              GO TO FIN-LLENA-AVANZA.                                                                                                                 
                                                                                                                                                      
           ADD CT-1                    TO W-I                                                                                                         
           IF W-I = CT-1                                                                                                                              
              PERFORM LIMPIA-LINEAS                                                                                                                   
           END-IF                                                                                                                                     
                                                                                                                                                      
SLB01      IF W-I NOT > CT-6                                                                                                                          
              COMPUTE W-J = W-I + CT-1                                                                                                                
              PERFORM MUEVE-CAMPOS                                                                                                                    
              MOVE W-J                 TO W-I                                                                                                         
           END-IF                                                                                                                                     
                                                                                                                                                      
                                                                                                                                                      
           MOVE CT-REDNX TO RQ-COM-DET.                                                                                                               
                                                                                                                                                      
       FIN-LLENA-AVANZA. EXIT.                                                                                                                        
                                                                                                                                                      
       LEE-CONVENIO.                                                                                                                                  
      *-------------                                                                                                                                  
           MOVE PRD-COD-CVS              TO RQ-PRO-OPE                                                                                                
           MOVE OPE-NUM-CVS              TO RQ-OPE-OPE                                                                                                
           MOVE CT-REDKY                 TO RQ-COM-OPE                                                                                                
           PERFORM ACCESA-OPE                                                                                                                         
                                                                                                                                                      
           IF RQ-RET-OPE = CT-14X                                                                                                                     
              MOVE SPACES                TO W-CONVENIO                                                                                                
              MOVE OPE-NUM-CVS           TO W-COD-CVN                                                                                                 
              MOVE GL-NO-EXI-CNV         TO W-GLO-CVN                                                                                                 
              GO TO FIN-LEE-CONVENIO.                                                                                                                 
                                                                                                                                                      
           MOVE PRD-COD-CVS              TO W-PRO-RCO01                                                                                               
           MOVE OPE-NUM-CVS              TO W-OPE-RCO01                                                                                               
           MOVE ZEROS                    TO W-RUT-RCO01                                                                                               
           MOVE W-RCO01                  TO RQ-KEY-VAL-RCO                                                                                            
           MOVE CT-RCO01                 TO RQ-KEY-RCO                                                                                                
           MOVE CT-REDKG                 TO RQ-COM-RCO                                                                                                
           MOVE SPACES                   TO RQ-RET-RCO                                                                                                
                                                                                                                                                      
           PERFORM LEE-RCO                                                                                                                            
           IF (RQ-RET-RCO = CT-14X) OR                                                                                                                
              (RCO-COD-OPE NOT = PRD-COD-CVS) OR                                                                                                      
              (RCO-NUM-OPE NOT = OPE-NUM-CVS)                                                                                                         
              MOVE OPE-NUM-CVS           TO W-COD-CVN                                                                                                 
              MOVE GL-NO-EXI-RCO         TO W-GLO-CVN                                                                                                 
              GO TO FIN-LEE-CONVENIO.                                                                                                                 
                                                                                                                                                      
           MOVE RCO-NRT-CLI              TO RQ-NUM-CLI                                                                                                
           MOVE RCO-DRT-CLI              TO RQ-DIG-CLI                                                                                                
           PERFORM LEE-CLI                                                                                                                            
           IF RQ-RET = CT-14X                                                                                                                         
              MOVE RCO-NRT-CLI           TO W-COD-CVN                                                                                                 
              MOVE GL-NO-EXI-CLI         TO W-GLO-CVN                                                                                                 
              GO TO FIN-LEE-CONVENIO.                                                                                                                 
                                                                                                                                                      
           MOVE CLI-NOM TO W-CONVENIO.                                                                                                                
                                                                                                                                                      
       FIN-LEE-CONVENIO. EXIT.                                                                                                                        
                                                                                                                                                      
       RETROCEDE.                                                                                                                                     
      *----------                                                                                                                                     
           MOVE ZEROES       TO DFH-REVOCA DFH-GRABAR DFH-IMPRIM                                                                                      
                                DFH-ACTIVA DFH-SALIR                                                                                                  
           MOVE SPACES       TO W-MENSAJE                                                                                                             
           MOVE DFH-ERROR    TO W-VALOR-ERROR                                                                                                         
                                                                                                                                                      
           PERFORM REVISA-CAMBIOS THRU FIN-REVISA-CAMBIOS                                                                                             
                                                                                                                                                      
           IF NOT SIN-ERROR                                                                                                                           
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF CORREL(CT-1) = SPACES OR LOW-VALUES                                                                                                     
              MOVE GL-NO-DET               TO W-MENSAJE                                                                                               
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF CORREL(CT-1) = DFH-CORUNO                                                                                                               
              MOVE GL-PRI-PAG       TO W-MENSAJE                                                                                                      
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE CORREL(CT-1)           TO W-CORRX                                                                                                     
           IF W-CORRX = ZEROES                                                                                                                        
              MOVE GL-FNC-NO-CRR       TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           COMPUTE W-CORRN = W-CORRN - CT-1                                                                                                           
                                                                                                                                                      
           MOVE CT-MDT                 TO RQ-PRO-DET                                                                                                  
           MOVE DFH-NUMERO             TO RQ-OPE-DET                                                                                                  
           MOVE W-CORRN                TO RQ-COR-DET                                                                                                  
           MOVE CT-REDKL               TO RQ-COM-DET                                                                                                  
                                                                                                                                                      
           MOVE CT-7                   TO W-I                                                                                                         
           PERFORM LLENA-RETROCEDE THRU FIN-LLENA-RETROCEDE                                                                                           
             UNTIL W-I = CT-1                                                                                                                         
                OR RQ-RET-DET = CT-14X                                                                                                                
                                                                                                                                                      
                                                                                                                                                      
           IF CORREL (1) = DFH-CORUNO                                                                                                                 
              MOVE GL-PRI-PAG          TO W-MENSAJE.                                                                                                  
                                                                                                                                                      
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       MUEVE-CAMPOS.                                                                                                                                  
      *------------                                                                                                                                   
           MOVE DET-CRV                TO CORREL (W-I)                                                                                                
                                                                                                                                                      
EMI        IF DET-TIP-SER = CT-CVN                                                                                                                    
              MOVE PRD-COD-CVS         TO RQ-PRO-CVS                                                                                                  
              MOVE OPE-NUM-CVS         TO RQ-CVN-CVS                                                                                                  
              PERFORM LEE-CVS                                                                                                                         
              IF RQ-RET = CT-14X                                                                                                                      
                 MOVE GL-CNV-NO-EXI    TO W-MENSAJE                                                                                                   
                 GO TO ENVIAR-MAPA                                                                                                                    
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
EMI        IF DET-TIP-SER = CT-CVN                                                                                                                    
              PERFORM LEE-CONVENIO THRU FIN-LEE-CONVENIO                                                                                              
              MOVE W-CONVENIO          TO CONVENIO (W-I)                                                                                              
              IF CVS-TIP-CVN = CT-INST OR CT-CALI                                                                                                     
                 MOVE SPACES           TO IDEN (W-J)                                                                                                  
              ELSE                                                                                                                                    
                 MOVE DET-IDR-SER      TO IDEN (W-J)                                                                                                  
              END-IF                                                                                                                                  
           ELSE                                                                                                                                       
              MOVE DET-IDR-SER         TO W-IDENTIF                                                                                                   
              MOVE W-APLIC             TO APLI (W-I)                                                                                                  
              MOVE W-NRO-CTA           TO NCTA (W-I)                                                                                                  
              MOVE SPACES              TO IDEN (W-J)                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE BCO-COD OF E-MDT-DET-01     TO BNCO (W-I)                                                                                             
                                                                                                                                                      
           IF MON-COD OF E-MDT-DET-01 = ZERO OR CT-999                                                                                                
              MOVE DET-MNT-MAX-MDT     TO W-MONTO-PESO                                                                                                
              MOVE W-MONTO-PESO        TO MNTO (W-I)                                                                                                  
           ELSE                                                                                                                                       
              MOVE DET-MNT-MAX-MDT     TO W-MONTO-UF                                                                                                  
              MOVE W-MONTO-UF          TO MNTO (W-I)                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE DET-FEC-ING-EST        TO W-F-AMD                                                                                                     
           MOVE W-DIA-AMD              TO W-DIA-ED                                                                                                    
           MOVE W-MES-AMD              TO W-MES-ED                                                                                                    
           MOVE W-ANO-AMD              TO W-ANO-ED                                                                                                    
           MOVE W-FECHA-ED             TO FECH (W-I)                                                                                                  
                                                                                                                                                      
           MOVE DET-COD-EST                 TO ESTA (W-J)                                                                                             
           MOVE DET-COD-GLS(CT-5:CT-6)      TO CART (W-J)                                                                                             
                                                                                                                                                      
           MOVE MON-COD OF E-MDT-DET-01     TO RQ-COD-MON                                                                                             
           PERFORM LEE-MON                                                                                                                            
           IF RQ-RET = CT-14X                                                                                                                         
              MOVE MON-COD OF E-MDT-DET-01  TO MNDA (W-J)                                                                                             
           ELSE                                                                                                                                       
              MOVE MON-NOM-CRT              TO MNDA (W-J)                                                                                             
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE OFI-COD-RCP            TO OFIC (W-J)                                                                                                  
           MOVE DET-DIA-MDT            TO DIAP (W-J).                                                                                                 
                                                                                                                                                      
       LLENA-RETROCEDE.                                                                                                                               
      *----------------                                                                                                                               
           PERFORM ACCESA-DET                                                                                                                         
           IF RQ-RET-DET = CT-14X                                                                                                                     
              GO TO LLENA-RETROCEDE.                                                                                                                  
                                                                                                                                                      
           COMPUTE W-I = W-I - CT-2                                                                                                                   
                                                                                                                                                      
           IF W-I = CT-5                                                                                                                              
              PERFORM LIMPIA-LINEAS                                                                                                                   
           END-IF                                                                                                                                     
                                                                                                                                                      
           COMPUTE W-J = W-I + CT-1                                                                                                                   
                                                                                                                                                      
           PERFORM MUEVE-CAMPOS                                                                                                                       
                                                                                                                                                      
           MOVE CT-REDBR     TO RQ-COM-DET.                                                                                                           
                                                                                                                                                      
       FIN-LLENA-RETROCEDE. EXIT.                                                                                                                     
                                                                                                                                                      
       ACCESA-DET.                                                                                                                                    
      *-----------                                                                                                                                    
           MOVE SPACES            TO RQ-RET-DET                                                                                                       
           MOVE CT-DET01          TO W-ELM-NAME                                                                                                       
           CALL 'DBNTRY'  USING RQ-UIB                                                                                                                
                          RQ-AREA-DET                                                                                                                 
                          E-MDT-DET-01                                                                                                                
                          W-ELEMENT-LIST                                                                                                              
                                                                                                                                                      
           IF RQ-RET-DET NOT = SPACES AND NOT = CT-14X                                                                                                
              MOVE CT-B           TO W-VALOR-ERROR                                                                                                    
              MOVE RQ-DBI-DET     TO ERROR-BASE                                                                                                       
              MOVE RQ-FIL-DET     TO ERROR-TABLA                                                                                                      
              MOVE RQ-RET-DET     TO ERROR-RET                                                                                                        
              MOVE W-MSJ-ERROR    TO W-MENSAJE                                                                                                        
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF RQ-RET-DET = SPACES                                                                                                                     
EMI           IF (PRD-COD OF E-MDT-DET-01 NOT = CT-MDT) OR                                                                                            
                 (OPE-NUM OF E-MDT-DET-01 NOT = DFH-NUMERO)                                                                                           
                  MOVE CT-14X     TO RQ-RET-DET                                                                                                       
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       IMPRIMIR.                                                                                                                                      
      *---------                                                                                                                                      
           MOVE GL-OPC-ELI-MMNTO  TO W-MENSAJE                                                                                                        
           GO TO ENVIAR-MAPA.                                                                                                                         
                                                                                                                                                      
       DETALLES.                                                                                                                                      
      *---------                                                                                                                                      
           MOVE ZEROES       TO DFH-REVOCA DFH-GRABAR DFH-IMPRIM                                                                                      
                                DFH-ACTIVA DFH-SALIR                                                                                                  
           MOVE SPACES       TO W-MENSAJE                                                                                                             
           MOVE DFH-ERROR    TO W-VALOR-ERROR                                                                                                         
                                                                                                                                                      
           IF DFH-NUMERO = SPACES OR ZEROS                                                                                                            
              MOVE GL-MAND-NO-ING      TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           PERFORM REVISA-CAMBIOS THRU FIN-REVISA-CAMBIOS                                                                                             
                                                                                                                                                      
           IF (NOT SIN-ERROR)                                                                                                                         
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF TCTUA-CTA-CANCELADA = CT-S                                                                                                              
              MOVE GL-CLI-CTA-CANCEL   TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF TCTUA-CTA-NOVISTA   = CT-S                                                                                                              
              MOVE GL-CTA-SOLO-VOV     TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           IF EIBCPOSN NOT < W-POSICION (CT-1) AND                                                                                                    
              EIBCPOSN NOT > W-POSICION (CT-2)                                                                                                        
              MOVE CORREL (CT-1)       TO DFH-CORACT                                                                                                  
              GO TO ACTIVAR-CDSE681.                                                                                                                  
                                                                                                                                                      
           IF EIBCPOSN NOT < W-POSICION (CT-2) AND                                                                                                    
              EIBCPOSN NOT > W-POSICION (CT-3)                                                                                                        
              MOVE CORREL (CT-3)       TO DFH-CORACT                                                                                                  
              GO TO ACTIVAR-CDSE681.                                                                                                                  
                                                                                                                                                      
           IF EIBCPOSN NOT < W-POSICION (CT-3) AND                                                                                                    
              EIBCPOSN NOT > W-POSICION (CT-4)                                                                                                        
              MOVE CORREL (CT-5)       TO DFH-CORACT                                                                                                  
              GO TO ACTIVAR-CDSE681.                                                                                                                  
                                                                                                                                                      
           MOVE CORREL (CT-1)          TO DFH-CORACT                                                                                                  
           GO TO ACTIVAR-CDSE681.                                                                                                                     
                                                                                                                                                      
SGC    ENVIAR-MAPA.                                                                                                                                   
      *-----------                                                                                                                                    
           IF OFITERI = SPACES OR LOW-VALUES                                                                                                          
              MOVE DFH-OFIUSR          TO RQ-COD-OFI                                                                                                  
              MOVE CT-REDKY            TO RQ-COM                                                                                                      
              MOVE CT-OFI              TO RQ-FIL                                                                                                      
              MOVE CT-OFI01            TO RQ-KEY                                                                                                      
              MOVE CT-103              TO RQ-DBI                                                                                                      
              MOVE SPACES              TO RQ-RET                                                                                                      
              MOVE W-LLAVE-OFI         TO RQ-KEY-VAL                                                                                                  
              MOVE CT-OFI01            TO W-ELM-NAME                                                                                                  
              CALL 'DBNTRY'      USING RQ-UIB                                                                                                         
                                 RQ-AREA                                                                                                              
                                 OFI-01                                                                                                               
                                 W-ELEMENT-LIST                                                                                                       
              IF RQ-RET = SPACES                                                                                                                      
                 MOVE OFI-NOM          TO OFITERO                                                                                                     
              ELSE                                                                                                                                    
                 IF RQ-RET = CT-14X                                                                                                                   
                    MOVE DFH-OFIUSR       TO OFITERO                                                                                                  
                 ELSE                                                                                                                                 
                    MOVE CT-B                TO W-VALOR-ERROR                                                                                         
                    MOVE RQ-DBI              TO ERROR-BASE                                                                                            
                    MOVE RQ-FIL              TO ERROR-TABLA                                                                                           
                    MOVE RQ-RET              TO ERROR-RET                                                                                             
                    MOVE W-MSJ-ERROR         TO W-MENSAJE                                                                                             
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF                                                                                                                                     
                                                                                                                                                      
           MOVE W-VALOR-ERROR          TO DFH-ERROR                                                                                                   
                                                                                                                                                      
           EVALUATE W-VALOR-ERROR                                                                                                                     
               WHEN SPACES                                                                                                                            
                    MOVE CT-1N                   TO NUMEROL                                                                                           
               WHEN CT-1X                                                                                                                             
                    MOVE CT-1N                   TO NUMEROL                                                                                           
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-NUM-MAND-INCRC    TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-2X                                                                                                                             
                    MOVE CT-1N                   TO TPOCTAL                                                                                           
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-TIP-CTA-INCRC     TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-3X                                                                                                                             
                    MOVE CT-1N                   TO CUENTAL                                                                                           
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-NUM-CTA-INCRC     TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-4X                                                                                                                             
                    MOVE CT-1N                   TO NUMRUT1L                                                                                          
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-RUT-MAND1-INCRC   TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-5X                                                                                                                             
                    MOVE CT-1N                   TO DIGRUT1L                                                                                          
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-DIG-MAND1-INCRC   TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-6X                                                                                                                             
                    MOVE CT-1N                   TO FECSOLL                                                                                           
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-FEC-SOL-INCRC     TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-7X                                                                                                                             
                    MOVE CT-1N                   TO NUMRUT2L                                                                                          
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-RUT-MAND2-INCRC   TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-8X                                                                                                                             
                    MOVE CT-1N                   TO DIGRUT2L                                                                                          
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-DIG-MAND2-INCRC   TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-A                                                                                                                              
                    MOVE CT-1N                   TO LINMSJL                                                                                           
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-ERR-ARC-VSAM      TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN CT-B                                                                                                                              
                    MOVE CT-1N                   TO LINMSJL                                                                                           
                    IF W-MENSAJE = SPACES                                                                                                             
                       MOVE GL-ERR-DATACOM       TO W-MENSAJE                                                                                         
                    END-IF                                                                                                                            
               WHEN OTHER                                                                                                                             
                    MOVE CT-1N                   TO NUMEROL                                                                                           
                    MOVE GL-ERR-NO-IDENT         TO W-MENSAJE                                                                                         
           END-EVALUATE                                                                                                                               
                                                                                                                                                      
           MOVE W-MENSAJE              TO LINMSJO                                                                                                     
           EXEC CICS ASKTIME ABSTIME (W-A1) END-EXEC                                                                                                  
           EXEC CICS FORMATTIME ABSTIME (W-A1)                                                                                                        
                                FULLDATE(FECHAO)                                                                                                      
                                DATESEP (CT-SLASH)                                                                                                    
                                TIME    (HORAO)                                                                                                       
                                TIMESEP (CT-DOS-PUNTO)                                                                                                
                                END-EXEC                                                                                                              
                                                                                                                                                      
           IF DFH-ERASE = CT-SI                                                                                                                       
              EXEC CICS SEND MAP ('CDSM680')                                                                                                          
                             CURSOR                                                                                                                   
                             ERASE                                                                                                                    
                             END-EXEC                                                                                                                 
                                                                                                                                                      
           ELSE                                                                                                                                       
              EXEC CICS SEND MAP ('CDSM680')                                                                                                          
                             CURSOR                                                                                                                   
                             DATAONLY                                                                                                                 
                             END-EXEC                                                                                                                 
           END-IF                                                                                                                                     
                                                                                                                                                      
           EXEC CICS RETURN TRANSID (CT-DS80)                                                                                                         
                            COMMAREA (DFH-AREA-COMUN)                                                                                                 
                            LENGTH (W-LENGTH)                                                                                                         
                            END-EXEC                                                                                                                  
                                                                                                                                                      
           PERFORM TERMINO.                                                                                                                           
                                                                                                                                                      
      *                                                                                                                                               
       LEER-AHOMTAB.                                                                                                                                  
      *==============                                                                                                                                 
           MOVE SPACES                 TO OFI-CLAVE                                                                                                   
           MOVE CT-XOFI                TO OFI-RAIZ                                                                                                    
           MOVE DFH-CUENTA(CT-1:CT-3)  TO OFI-COFIC                                                                                                   
           IF OFI-COFIC = ZEROES                                                                                                                      
              MOVE CT-001              TO OFI-COFIC                                                                                                   
           END-IF                                                                                                                                     
           EXEC CICS READ                                                                                                                             
                FILE   (CT-AHOMTAB)                                                                                                                   
                INTO   (REGDAT-AHOMTAB)                                                                                                               
                RIDFLD (OFI-CLAVE)                                                                                                                    
                LENGTH (W-LARGO-AHOMTAB)                                                                                                              
                KEYLENGTH (CT-LARGO-12)                                                                                                               
                NOHANDLE                                                                                                                              
           END-EXEC                                                                                                                                   
           IF EIBRESP NOT = ZEROES                                                                                                                    
              MOVE GL-PRB-AHOMSGRT     TO W-MENSAJE                                                                                                   
              MOVE EIBRESP             TO WS-COD-ERROR                  00000610                                                                      
              MOVE WS-COD-ERROR        TO W-MENSAJE(CT-60:CT-2)         00000610                                                                      
              GO TO ENVIAR-MAPA                                         00003550                                                                      
           END-IF.                                                                                                                                    
           IF OFI-ASIGNADA IS NUMERIC                                                                                                                 
              MOVE OFI-ASIGNADA             TO DFH-OFICTA CODSUCO                                                                                     
           ELSE                                                                                                                                       
              MOVE DFH-CUENTA(CT-1:CT-3)    TO DFH-OFICTA CODSUCO                                                                                     
              IF DFH-CUENTA(CT-1:CT-3) = ZEROES                                                                                                       
                 MOVE CT-001                TO DFH-OFICTA CODSUCO                                                                                     
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       GRABA-AHOMSGRT.                                                                                                                                
      *==============                                                                                                                                 
           MOVE SPACES                      TO REGDAT-AHOMSGRT.                                                                                       
           MOVE DET-IDR-SER(CT-2:CT-9)      TO RUT-AHOMSGRT.                                                                                          
              EXEC CICS DELETE   FILE      (CT-AHOMSGRT)                                                                                              
                                 RIDFLD    (LLAVE-AHOMSGRT)                                                                                           
                                 KEYLENGTH (CT-LARGO-9)                                                                                               
                                 NOHANDLE                                                                                                             
                                 END-EXEC                                                                                                             
           IF EIBRESP NOT = ZEROES                                                                                                                    
              IF EIBRESP = CT-14 OR CT-15                                                                                                             
                 MOVE GL-RUT-YA-ASOC         TO W-MENSAJE                                                                                             
                 MOVE CT-8                   TO W-VALOR-ERROR                                                                                         
                 GO TO ENVIAR-MAPA                                      00003550                                                                      
              ELSE                                                                                                                                    
                 IF EIBRESP = CT-19                                                                                                                   
                    MOVE GL-AHOMSGRT-CERR    TO W-MENSAJE                                                                                             
                    GO TO ENVIAR-MAPA                                   00003550                                                                      
                 ELSE                                                                                                                                 
                    IF EIBRESP = CT-13                                                                                                                
                       CONTINUE                                                                                                                       
                    ELSE                                                                                                                              
                       MOVE GL-PRB-AHOMSGRT  TO W-MENSAJE                                                                                             
                       MOVE EIBRESP          TO WS-COD-ERROR            00000610                                                                      
                       MOVE WS-COD-ERROR     TO W-MENSAJE(CT-60:CT-2)   00000610                                                                      
                       GO TO ENVIAR-MAPA                                00003550                                                                      
                    END-IF                                                                                                                            
                 END-IF                                                                                                                               
              END-IF                                                                                                                                  
           END-IF.                                                                                                                                    
                                                                                                                                                      
       ACTIVAR-CDSE681.                                                                                                                               
      *---------------                                                                                                                                
           MOVE CT-DET            TO DFH-MODO                                                                                                         
           MOVE SPACES            TO DFH-RESTO                                                                                                        
EMI02      IF DFH-TPOCTA = CT-CRUT                                                                                                                    
EMI02         MOVE DFH-NUMRUT1    TO DFH-CUENTA                                                                                                       
EMI02         MOVE SPACES         TO DFH-CUENTA(CT-10:CT-11)                                                                                          
EMI02      END-IF                                                                                                                                     
           EXEC CICS XCTL PROGRAM (CT-CDSE681)                                                                                                        
                          COMMAREA(DFH-AREA-COMUN)                                                                                                    
                          LENGTH  (CT-LARGO-161)                                                                                                      
                          END-EXEC                                                                                                                    
                                                                                                                                                      
           PERFORM TERMINO.                                                                                                                           
                                                                                                                                                      
       XXX-ACTUALIZA-RCO.                                                                                                                             
      *==================                                                                                                                             
           MOVE CT-N11X           TO RCO-COD-EJC                                                                                                      
           MOVE CT-UPDAT          TO RQ-COM-RCO                                                                                                       
           PERFORM LEE-RCO                                                                                                                            
           MOVE CT-RDUNX          TO RQ-COM-RCO                                                                                                       
           PERFORM LEE-RCO.                                                                                                                           
                                                                                                                                                      
       ERROR-GENERAL.                                                                                                                                 
      *--------------                                                                                                                                 
           MOVE GL-ERR-GRAL       TO COMM-S1PGFIN                                                                                                     
           EXEC CICS XCTL PROGRAM  (CT-ASICFIN)                                                                                                       
                          COMMAREA (COMM-FIELDS)                                                                                                      
                          LENGTH   (W-LENVT01)                                                                                                        
                          END-EXEC.                                                                                                                   
                                                                                                                                                      
      *                                                                                                                                               
       9999-ABEND.                                                                                                                                    
      *------------                                                                                                                                   
           EXEC CICS ASSIGN ABCODE    (V-COD-ABEND)                                                                                                   
                            ABPROGRAM (V-PGM-ABEND)                                                                                                   
           END-EXEC                                                                                                                                   
           STRING GL-ERR-ABEND  V-COD-ABEND                                                                                                           
                  GL-ERR-ABEND2 V-PGM-ABEND                                                                                                           
                  DELIMITED BY SIZE INTO WS-GLS-ERR.                                                                                                  
           MOVE WS-GLS-ERR        TO COMM-S1PGFIN                                                                                                     
           EXEC CICS XCTL PROGRAM  (CT-ASICFIN)                                                                                                       
                          COMMAREA (COMM-FIELDS)                                                                                                      
                          LENGTH   (W-LENVT01)                                                                                                        
                          END-EXEC                                                                                                                    
           PERFORM TERMINO.                                                                                                                           
                                                                                                                                                      
      *                                                                                                                                               
       TECLA-INCORRECTA.                                                                                                                              
      *-----------------                                                                                                                              
           MOVE GL-TECL-INCRC          TO W-MENSAJE                                                                                                   
           GO TO ENVIAR-MAPA.                                                                                                                         
      *                                                                                                                                               
       TECLA-CLEAR.                                                                                                                                   
      *------------                                                                                                                                   
           EXEC CICS XCTL PROGRAM (CT-GNSPPRFN) END-EXEC                                                                                              
           PERFORM TERMINO.                                                                                                                           
                                                                                                                                                      
      *                                                                                                                                               
       SALIR.                                                                                                                                         
      *------                                                                                                                                         
           IF DFH-SALIR NOT > ZEROES                                                                                                                  
              MOVE CT-1                TO DFH-SALIR                                                                                                   
              MOVE GL-CONF-SAL         TO W-MENSAJE                                                                                                   
              GO TO ENVIAR-MAPA.                                                                                                                      
                                                                                                                                                      
           MOVE ZEROES                 TO DFH-SALIR                                                                                                   
           EXEC CICS XCTL PROGRAM (CT-GNSPPRFN) END-EXEC                                                                                              
           PERFORM TERMINO.                                                                                                                           
                                                                                                                                                      
      *                                                                                                                                               
       TERMINO.                                                                                                                                       
      *--------                                                                                                                                       
           EXEC CICS RETURN                                                                                                                           
           END-EXEC.                                                                                                                                  
